[
  {
    "id": 197,
    "documentId": "mqkaxd7invrfpaqzimmakwgp",
    "title": "A Cautionary Advice To A Young Friend",
    "text": "<p>A Cautionary Advice To A Young Friend</p><p>Proverbs 30</p><p>KJV</p><p>17+ The eye that mocketh at his father, and despiseth to obey his mother, the ravens of the valley shall pick it out, and the young eagles shall eat it.</p><p>&nbsp;</p><p>Many of us the aged have for friends some young men and women. Occasionally we meet and interact, and we tell one another “What was and &nbsp;what is!”</p><p>&nbsp;</p><p>Generations differ no one doubts this, however, some principles don’t change with generational change.&nbsp;</p><p>&nbsp;</p><p>The rate at which societal values are changing has been a source of worry and concern to the older generation! In a conversation with a young friend, this issue came up.&nbsp;</p><p>&nbsp;</p><p>The conclusion we both came up with was “ somebody ( a generation) went to sleep” A generation failed to uphold and pass on to the other what it received. It is this failure that has brought us to where we are today! The question was How do we then reset the clock?&nbsp;</p><p>&nbsp;</p><p>We see and experience these in every sphere of life be it social, church, family or national. Had the failed generation followed the principle of transferring to others what it received we would have maintain high moral and ethical standards and sanity.&nbsp;</p><p>&nbsp;</p><p>Just like the Church we have kept and observe the Lord’s Supper because, as Paul said ;&nbsp;</p><p>Corinthians 11</p><p>KJV</p><p>23+ For I have received of the Lord that which also I delivered unto you, That the Lord Jesus the same night in which he was betrayed took bread:</p><p>&nbsp;</p><p>We have passed on to us values that have kept past generations sound, united, responsive and respectful. Today all these have crumbled before our very eyes. This is a laissez-faire generation!&nbsp;</p><p>&nbsp;</p><p>The sages of old have always held as sacrosanct this commandment;</p><p>Proverbs 23</p><p>KJV</p><p>22+ Hearken unto thy father that begat thee, and despise not thy mother when she is old.</p><p>&nbsp;</p><p>Proverbs 1</p><p>KJV</p><p>8+ My son, hear the instruction of thy father, and forsake not the law of thy mother:</p><p>&nbsp;</p><p>Ephesians 6</p><p>KJV</p><p>1+ Children, obey your parents in the Lord: for this is right.</p><p>2+ Honour thy father and mother; (which is the first commandment with promise;)</p><p>&nbsp;</p><p>What do we see today?&nbsp;</p><p>&nbsp;</p><p>Proverbs 30</p><p>KJV</p><p>11+ There is a generation that curseth their father, and doth not bless their mother.</p><p>&nbsp;</p><p>Proverbs 30</p><p>KJV</p><p>12+ There is a generation that are pure in their own eyes, and yet is not washed from their filthiness.</p><p>&nbsp;</p><p>Yes, the “old order changeth”, but eternal laws/principles, truths etc remain the same. These are what is called the “ eternal non-negotiable principles and laws”</p><p>&nbsp;</p><p>One of which is respect for the elderly, in whom reside refined quality thought, wisdom and common sense as a result of experience gathered through life!</p><p>&nbsp;</p><p>If only we could all pay attention to this warning, our journey would be smooth and end well! &nbsp;</p><p>Proverbs 20</p><p>KJV</p><p>20+ Whoso curseth his father or his mother, his lamp shall be put out in obscure darkness.</p><p>&nbsp;</p><p>Every generation was once a youthful generation, blessed are those who recognize that progress and success lie in the degree and extent to which they treat those who were before them.</p><p>&nbsp;</p><p>Everything is an inheritance, a transference from one generation to the other. What have you inherited? And from whom? Your deeds etc will reveal what you inherited and from whom!&nbsp;</p><p>&nbsp;</p><p>Eyes are watching l!&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-13T16:27:27.876Z",
    "updatedAt": "2025-06-13T18:57:02.998Z",
    "publishedAt": "2025-06-13T18:57:02.987Z",
    "slug": "a-cautionary-advice-to-a-young-friend"
  },
  {
    "id": 196,
    "documentId": "nou147v4byyvoeoy5dha8t0y",
    "title": "A Wicked Heart",
    "text": "<p><strong>A Wicked Heart</strong></p><p>Proverbs 24</p><p>KJV</p><p>29+ Say not, I will do so to him as he hath done to me: I will render to the man according to his work.</p><p>&nbsp;</p><blockquote><p>Proverbs 3</p><p>KJV</p><p>28+ Say not unto thy neighbour, Go, and come again, and to morrow I will give; when thou hast it by thee.</p></blockquote><p>&nbsp;</p><p>A wicked heart is difficult to define but is noted ( identified ) by some of the characteristics indicated in the above scripture passages. The contents of a wicked heart are seen through deeds.&nbsp;</p><p>&nbsp;</p><p>It is a heart that conceives, plans and executes evil as if it were for fun! A wicked heart is a heart that rejoices and stands aloof when others suffer. It is self-centred.&nbsp;</p><p>&nbsp;</p><p>It is also a heart full of vengeance, that knows no forgiveness unless he has paid back evil with evil. It is a vindictive heart! It is a hypocritical, pretentious heart that laughs /smiles but will stab at the first opportunity it gets&nbsp;&nbsp;</p><p>&nbsp;</p><p>Read the psalmist’s experience which he captured in these vivid words;&nbsp;</p><p>&nbsp;</p><p>Psalm 41:6,9</p><p>NIV</p><p>[6] When one of them comes to see me, he speaks falsely, while his heart gathers slander; then he goes out and spreads it around. [9] Even my close friend, someone I trusted, one who shared my bread, has turned against me.</p><p>&nbsp;</p><p>A wicked heart is that heart that shops and bargains ready to sell when the price offered is right.&nbsp;</p><p>&nbsp;</p><p>Though we live, work and walk with people with wicked hearts, there is not much that we can do except to watch, pray and hide under the protective canopy of God.</p><p>&nbsp;</p><p>May we continuously search and know the type of heart we have as we are told the heart can be deceptive.&nbsp;</p><p>&nbsp;</p><p>Jeremiah 17</p><p>KJV</p><p><strong>9&nbsp;</strong>The heart is deceitful above all things, and desperately wicked: who can know it?</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-13T12:57:41.548Z",
    "updatedAt": "2025-06-13T19:58:53.574Z",
    "publishedAt": "2025-06-13T19:58:53.568Z",
    "slug": "a-wicked-heart"
  },
  {
    "id": 195,
    "documentId": "wxsp432g21hqe33xxb24fj5e",
    "title": "When The Tongue Is A Pen",
    "text": "<p>Psalms 45<br>KJV<br>1+ My heart is inditing a good matter: I speak of the things which I have made touching the king: my tongue is the pen of a ready writer.</p><p>&nbsp;</p><p>Psalm 45:1&nbsp;<br>NIV<br>[1] My heart is stirred by a noble theme as I recite my verses for the king; my tongue is the pen of a skillful writer.</p><p>&nbsp;</p><p>Like me, I am sure &nbsp;you don’t know, nor has it ever occurred to you that the “ &nbsp;tongue is a pen!”</p><p>&nbsp;</p><p>I found this verse very interesting especially as it described the “tongue” as a pen! &nbsp;“My tongue is the pen of a skillful writer”!</p><p>&nbsp;</p><p>Indeed some speak just as they write; this is a gift. Very skillful in their choices of words either spoken or written. It is always a delight to hear them speak or read what they write</p><p>&nbsp;</p><p>To speak therefore is the same as to write with a pen, &nbsp;one is audible the other silent, they all have the same audience!</p><p>&nbsp;</p><p>Words spoken or written can be classified into two categories: wise and unwise. They can make or break the spirit of their hearers or readers.</p><p>&nbsp;</p><p>Therefore heed this admonition;&nbsp;<br>Proverbs 25<br>KJV<br>11+ A word fitly spoken is like apples of gold in pictures of silver.</p><p>Proverbs 15:23&nbsp;<br>NIV<br>[23] A person finds joy in giving an apt reply---and how good is a <strong>timely word</strong>!</p><p>&nbsp;</p><p><strong>Timely words </strong>are very important, read how Isaiah puts it ; &nbsp;</p><p>Isaiah 50<br>KJV<br>4+ The Lord God hath given me the <strong>tongue of the learned, that I should know how to speak a word in season</strong> to him that is weary: he wakeneth morning by morning, he wakeneth mine ear to hear as the learned.<br><br>Words whether spoken or written live forever in the minds of both hearers and readers. Their effects may be forgiven or forgotten but not the words.</p><p>&nbsp;</p><p>On a practical note, I’ve had many referring me to things I’ve said or written before. Some in context others taken out of context!</p><p>&nbsp;</p><p>It is also important to note that the words we speak or write will be recalled on the Day of Judgment as testimonies for or against us.</p><p>&nbsp;</p><p>Matthew 12<br>KJV<br>36 But I say unto you, That every idle word that men shall speak, they shall give account thereof in the day of judgment.</p><p>37+ For by thy words thou shalt be justified, and by thy words thou shalt be condemned.</p><p>James also warned ;&nbsp;</p><p><br>James 3:1-2&nbsp;<br>NIV<br>[1] Not many of you should become teachers, my fellow believers, because you know that we who teach will be judged more strictly.</p><p>[2] We all stumble in many ways. Anyone who is never at fault in what they say is perfect, able to keep their whole body in check.</p><p>&nbsp;</p><p>So, beloved choose your words, do your best to let them be appropriate and relevant to the occasion. Be measured and economical in the use of words; either spoken or written.</p><p>&nbsp;</p><p>The tongue is a pen, use it wisely! In writing we think through before we put any word on paper, in like manner train your tongue to weigh words before they are uttered.</p><p>&nbsp;</p><p>The careless use of words has caused many a relationship, either friendship or marriage.</p><p>&nbsp;</p><p>John Franklin Tamakloe</p>",
    "createdAt": "2025-06-13T10:25:36.325Z",
    "updatedAt": "2025-06-13T10:26:42.892Z",
    "publishedAt": "2025-06-13T10:26:42.871Z",
    "slug": "when-the-tongue-is-a-pen"
  },
  {
    "id": 194,
    "documentId": "t9t6o8jk0f0vz1jmvygc2r7r",
    "title": "The World Shall Hear Of Me Again",
    "text": "<p><br>Acts 1<br>KJV<br>11+ Which also said, Ye men of Galilee, why stand ye gazing up into heaven? this same Jesus, which is taken up from you into heaven, shall so come in like manner as ye have seen him go into heaven.</p><p>&nbsp;</p><p>This was said many centuries ago and has remained the main hope and expectation of all believers!&nbsp;<br>Can it truly be said that we await with preparation and expectation, &nbsp;His second coming? &nbsp;</p><p>&nbsp;</p><p>When was the last time you heard a sermon on The Second Coming? It has been assumed and therefore pushed to the back burner. This explains why the faith of many has grown cold because they’ve lost appetite for heaven. Hmmm</p><p>&nbsp;</p><p>Rereading these scriptures brought to mind the famous statement often heard at the end of every Fu Manchu film series from the lips of popular actor Christopher Lee, aka Fu Manchu!</p><p>&nbsp;</p><p>In our youth (1960/70) we watched a series of films depicting a notorious underworld figure called Fu Manchu. Though at the end of every series he would be caught, yet before the film is brought to a close he would appear and utter the words “ the world shall hear of me again”</p><p>&nbsp;</p><p>As naive as we then were, this statement from Fu Manchu frightens us because we see him appear in another episode; we often wonder how he could reappear after his death! Truly, It is great to be young!</p><p>&nbsp;</p><p>Reading what the angel told the disciples should remind us that &nbsp;“&nbsp;<br>this same Jesus, which is taken up from you into heaven, shall so come in like manner as ye have seen him go into heaven.”</p><p>&nbsp;</p><p>This means Jesus will return in a physical form and not as a spirit as some claim and will be seen by all! What is unknown is the when! The ‘how’ we know, the ‘where He will come from’ &nbsp;we know.</p><p>&nbsp;</p><p>Have you thought about this? On that day a great mystery shall be solved as we shall see Him as He is! Whether white, black, yellow-skinned etc we don’t know. That day and hour shall declare! Truly we look forward to that day and His appearance.</p><p>&nbsp;</p><p>Beloved, since we don’t know the “when” let each be always ready so His return does not take him/her unaware. The question that should be of great concern &nbsp;is where will He find us? In what state or condition? Peaceful or angry, loving or hating? Etc. Think about this.</p><p>&nbsp;</p><p>This question worried Fanny J Crosby (1820-1915) &nbsp;a blind songwriter which led her to write this hymn ;</p><p>&nbsp;</p><p>1.&nbsp;&nbsp;&nbsp;&nbsp;When Jesus comes to reward His servants,<br>Whether it be noon or night,<br>Faithful to Him will He find us watching,<br>With our lamps all trimmed and bright?</p><p>&nbsp;</p><p>(Oh, can we say we are ready, brother?<br>Ready for the soul’s bright home?<br>Say, will He find you and me still watching,<br>Waiting, waiting when the Lord shall come?)</p><p>&nbsp;</p><p>2<br>If at the dawn of the early morning,<br>He shall call us one by one,<br>When to the Lord we restore our talents,<br>Will He answer thee—Well done?</p><p>&nbsp;</p><p>3<br>Have we been true to the trust He left us?<br>Do we seek to do our best?<br>If in our hearts there is naught condemns us,<br>We shall have a glorious rest.</p><p>&nbsp;</p><p>4<br>Blessed are those whom the Lord finds watching,<br>In His glory they shall share;<br>If He shall come at the dawn or midnight,<br>Will He find us watching there?</p><p>&nbsp;</p><p>How do we answer these questions? Yes, the world shall hear of Him again?</p><p>John Franklin Tamakloe</p>",
    "createdAt": "2025-06-11T08:18:00.474Z",
    "updatedAt": "2025-06-12T04:05:37.377Z",
    "publishedAt": "2025-06-12T04:05:37.358Z",
    "slug": "the-world-shall-hear-of-me-again"
  },
  {
    "id": 191,
    "documentId": "b1ggu4y2ryfj3tdy6nmp21nz",
    "title": "Teach Yourself How To Walk In The Truth",
    "text": "(series 5) <br>3 John 1<br>KJV<br>3 For I rejoiced greatly, when the brethren came and testified of the truth that is in thee, even as thou <b>walkest in the truth</b>.<br>4+ I have no greater joy than to hear that my children <b>walk in truth.</b><br><br>Life’s lessons are taught by following a systematically arranged curriculum or through experience. There is “ systematic truth “ and “ experiential Truth”. <br><br>The pursuit of both is recommended and desirable, but the experiential is the most preferred. An effective, useful, and successful person possesses the combination of both classroom and street ( experiential) sense! <br><br>As the psalmist requested, truth must be taught ; <br>Psalms 86<br>KJV<br>11+ Teach me thy way, O Lord; I will walk in thy truth: unite my heart to fear thy name.<br><br>In the case of Christianity, an effective useful child of God is the one who not only knows the scriptures ( theoretical) but can apply them in the real world   It is not about “ quotation “ it is about “ application”. <br><br>Two things are highlighted in the above scripture passages, “to walk in the truth” and “to walk in truth”. The two statements are not the same. <br><br>The first presupposes that there is a body of knowledge called “ the truth “  which one must uphold and apply to be described as “ walking in the truth”<br><br>To live and do things as stated in the scriptures is to “ walk in <b>the</b> truth as scripture is the Truth <br>John 17<br>KJV<br>17+ Sanctify them through thy truth: thy word is truth.<br><br>The question we  must ask ourselves daily is “Are we walking in <b>the truth</b>?”  Are we living lives that are consistent and in conformity with <b>the Truth</b>?” The Word.   <br><br>The second thought conveyed in the verses above is “ walking <b>in truth</b>” To walk In Truth is simply to be sincere, honest, to be a promise keeper, reliable, trustworthy, your word is your bond. One word sums it up “ principled”. <br><br>To walk in the teeth gladdens the heart of God and fellow man. The Apostle John could not hide his joy when he saw and experienced the life of the children of a Christian sister. <br><br>2 John 1<br>KJV<br>4+ I rejoiced greatly that I found of thy children walking in truth, as we have received a commandment from the Father.<br><br>When the knowledge of the Word of God influences us it makes us walk in truth. We deal sincerely and honestly with people as we live principled lives. <br><br>Interestingly, it is only fellow principled people who see this and admire the principled. The unprincipled finds it difficult to understand let alone accept them! <br><br>Yes, darkness and light can not coexist. The vulgar, rude, uncouth etc can not coexist with the disciplined, decent-minded, orderly etc. We see these every day as we relate to people. <br><br>Ever wondered why some disliked, speak evil of you, why your presence in their midst disturbs them etc? It is because you Walk In Truth. You call a spade a spade and not a shovel  You are principled! <br><br>Read God’s promise to the principled, those who walk in truth ; <br>1 Kings 2<br>KJV<br>4+ That the Lord may continue his word which he spake concerning me, saying, <b>If thy children take heed to their way, to walk before me in truth</b> with all their <b>heart</b> and with all their <b>soul</b>, there shall not fail thee (said he) a man on the throne of Israel.<br><br>Beloved, teach yourself how to walk not only in <b>the</b> truth but also <b>in</b> truth!<br><br>John Franklin Tamakloe",
    "createdAt": "2025-06-10T01:06:09.102Z",
    "updatedAt": "2025-06-10T01:06:09.102Z",
    "publishedAt": "2025-06-10T01:06:09.109Z",
    "slug": "teach-yourself-how-to-walk-in-the-truth"
  },
  {
    "id": 189,
    "documentId": "jx7kmjxwqxvgabsymrmg0wpu",
    "title": "Don’t Let The Green Grass Fool You!",
    "text": "Genesis 13<br>KJV<br>10+ And Lot lifted up his eyes, and beheld all the plain of Jordan, that it was well watered every where, before the Lord destroyed Sodom and Gomorrah, even as the garden of the Lord, like the land of Egypt, as thou comest unto Zoar.<br><br>A few reading the heading to this article will recall it is the title of a popular song sang by the late legendary “soul icon “ Wilson Pickett; in our time we had singers whose songs meant  a lot their words were full of wisdom. <br><br>Wilson Pickett visited Ghana in the company of the Jackson Five ( Michael Jackson and his brothers), Staple Singers, and several other top-flight soul groups, If my memory serves me right I think Ike and Tina Turner were part to entertain Ghanaians at the Independence Square. It was a night to remember! <br><br>The program was arranged such that Wilson Pickett was to appear on stage exactly at midnight; which he did wearing a black slack with silver buttons that flashed dazzlingly. Guess what, he came on stage as the hour struck midnight with his evergreen song “ Midnight Hour!“ <br><br>The crowd yelled and surged forward  as he spoke the first words of the song “ Am gonna wait till the midnight hour”. And he did! It was a scene best seen/experienced rather than told/described. That was Ghana then! <br><br>Beloved, the mistakes many have made ( and are still making) in life can be attributed to the exercise of poor judgment. Like Lot, many have allowed the “ green grass “to fool them. As the scriptures said,<br> “And Lot lifted up his eyes, and beheld all the plain of Jordan, that it was well watered every where,”. Lot was undiscerning! He did what is described today as “ failure to read between the lines”. <br><br>Oh, how many an undiscerning youth have lifted their eyes and beheld all the fake, pretentious lives  of glamour that celebrities portray  on tv and other social media handles ,  and thought they are real. Only to be disappointed with the passage of time. <br><br>Yes, do not let the fake green grass fool you. In use in Ghana today is an imitated synthetic made  “green grass” used mostly to decorate event grounds.  <br><br>For a natural “green grass” to last long and not die/dry easily the soil must be well prepared, which activity takes time. It also requires regular maintenance . Beloved, for a success to last long, it would require  a deliberate, conscious effort and  preparation .  One must be willing to invest, work hard  and wait patiently. <br><br>There are many today who are in life’s scrap yard , gnashing their teeth because they were fooled by the “ green grass” ! <br><br>Scripture is true, read a few ; <br>Proverbs 13<br>KJV<br>11+ Wealth gotten by vanity shall be diminished: but he that gathereth by labour shall increase.<br><br>Proverbs 20<br>KJV<br>21+ An inheritance may be gotten hastily at the beginning; but the end thereof shall not be blessed.<br><br>Proverbs 28<br>KJV<br>20+ A faithful man shall abound with blessings: but he that maketh haste to be rich shall not be innocent.<br><br>Proverbs 28<br>KJV<br>22+ He that hasteth to be rich hath an evil eye, and considereth not that poverty shall come upon him.<br><br>The grass is not green everywhere, therefore be discerning ! Like , Lot don’t let the green grass fool you. <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:08.922Z",
    "updatedAt": "2025-06-10T01:06:08.922Z",
    "publishedAt": "2025-06-10T01:06:08.931Z",
    "slug": "don-t-let-the-green-grass-fool-you"
  },
  {
    "id": 187,
    "documentId": "moij8rn37mmwfoiiy9sc74k6",
    "title": "He Said It, And He Did It",
    "text": "Luke 24<br>KJV<br>7+ Saying, The Son of man must be delivered into the hands of sinful men, and be crucified, and the third day rise again.<br><br>Unlike political candidates who say many things but are unable to fulfil them, all that Jesus said about himself, and what He will do or be done to Him were all fulfilled. He was an amazing Man of His Words who must be taken seriously. <br><br>One such prediction is what you’ve read;  that He will be betrayed, condemned and crucified and on the third day shall rise again. <br><br>When He first said these many were those who doubted Him, made mockery and ridiculed  Him, but it came to pass. <br><br>In the early hours of the First Day of the week, the city of Jerusalem woke up to “ breaking news ! ”. <br><br>Three women on a fact-finding mission to the cemetery where He was buried met with an empty tomb. They hurried back to town to gossip their findings to a few. They gossiped because they were afraid. <br><br>But as is normal with gossip no sooner had they whispered this to a few than it became news that went viral. <br><br>Reporters and stringers from the Jerusalem Chronicle, Jerusalem FM John 3:16,  Pilate FM, Matthew 27:24 and sister stations within and outside the city met with these women and interviewed them live on air. <br><br>They described vividly what they saw, the rolled stone, the empty tomb, and the man dressed in white who spoke to them. <br><br>They even repeated word for word what the white-clothed man said “Why seek ye the living among the dead? He has risen “<br><br>Yes, this is the Man Jesus. One newspaper headlined the morning’s publication with the words  “ He said it, and He did It!” The curious nature of the headline made the paper sold fast that by noon it has sold over several thousands. <br><br>Yes without a doubt , that Jesus died , was buried and on the third day rose again from the dead is an undeniable historical fact <br><br>We worship a risen Saviour. Upon the first day of the week as we assemble to break bread and drink of the cup let our voices and hearts rejoice   And may we do it from sincere , pure and honest hearts. <br><br>And., remember he who eat and drink in an unworthy manner, ( wicked , evil , unrepentant heart) eats and drinks damnation unto himself. <br><br>Maranatha <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:08.758Z",
    "updatedAt": "2025-06-10T01:06:08.758Z",
    "publishedAt": "2025-06-10T01:06:08.765Z",
    "slug": "he-said-it-and-he-did-it"
  },
  {
    "id": 185,
    "documentId": "nx1jsov4yw80al0s3r5pktsi",
    "title": "”Low In The Grave He Lay: For So It Is Written”",
    "text": "Psalms 16<br>KJV<br>10+ For thou wilt not leave my soul in hell; neither wilt thou suffer thine Holy One to see corruption.<br><br>This was said many centuries before it found its fulfilment in Christ! Before then many have lived in anticipation of when this prophecy will come to pass. <br><br>Yes, “ thou will not leave my soul in Hell; neither wilt thou suffer Thine Holy One To see corruption “. <br>The final contest between the forces of Good and Evil, between Jesus and the Devil was that which began from His condemnation through his trial,  the crucifixion on the Cross, his burial and finally ended with His resurrection! <br><br>Yes, by His resurrection He put to shame the nay-sayers, those who out of envy condemned and crucified Him thinking they had finished Him!  <br><br>Yes, the same will be done to us who have pledged our loyalty to Him, our enemies, our doubters and naysayers shall humiliate and make a mockery of us! <br><br>Yes, beloved our enemies will bury us in disgrace, humiliation and dishonour! They will make our names a byword by soiling our image and reputation, but we shall rise to conquer in the end. <br><br>Just like how He rose from the dead even so shall we also rise from the depth of humiliation, disgrace and dishonor that our foes have buried us. We shall rise to fame and glory in the name of Jesus. Impossibilities shall become possible. <br><br>Yes, he who laughs last laughs best! It is the doings of the Lord, disgrace and dishonor can not keep us down;  in the Name of Jesus we shall pull down the “ bars of shame “. <br><br>A hymn writer put it this way “Death can not keep its prey, he tore the bars away, up from the grave he arose with a mighty triumph over his foes, he arose a Victor from the dark domain and for forever with His saints to reign! <br><br>Yes, Low in the grave He lay Jesus, my Savior! Waiting the coming day Jesus my Lord!<br><br>Up from the grave He arose With a mighty triumph o'er His foes, He arose a Victor from the dark domain And He lives forever with His saints to reign <br><br>He arose! (He arose) He arose! (He arose) Hallelujah! Christ arose!<br><br>Vainly they watch His bed—<br>  Jesus, my Savior!<br>Vainly they seal the dead—<br>  Jesus my Lord!<br><br>Death cannot keep his prey—<br>  Jesus, my Savior!<br>He tore the bars away—<br>  Jesus my Lord!<br><br>Beloved, trust in the Risen Jesus in the face of challenges, He overcame and so will you. “Enemies are not God” is an inscription I saw written on a trotro bus. Only exercise patience! Jesus overcame, and you also will overcome! <br><br>Lessons I learnt from the death, burial and the resurrection of Jesus. These I share with you. He who laughs last laughs the best! <br><br>Have a blessed holiday <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:08.594Z",
    "updatedAt": "2025-06-10T01:06:08.594Z",
    "publishedAt": "2025-06-10T01:06:08.603Z",
    "slug": "low-in-the-grave-he-lay-for-so-it-is-written"
  },
  {
    "id": 183,
    "documentId": "htc2lqvny9sx03uja01crrjf",
    "title": "”This Our Journey Of No Return”",
    "text": "Ecclesiastes 3<br>KJV<br>22+ Wherefore I perceive that there is nothing better, than that a man should rejoice in his own works; for that is his portion: for who shall bring him to see what shall be after him?<br><br>Ask again! “for who shall bring him to see what shall be after him?” <br><br>It is easy to forget that this journey that we’ve embarked on here on Earth is a one-way journey. We came with only a one-way return ticket. We can not return to our homes once we leave. <br><br>Our visas are one-way visas and are not renewable when they expire though under certain circumstances they can be extended but not renewed. Visa extension is discretionary and is subject to conditions set by the Issuer! <br><br>What is of great worry and concern to all travellers here is the undisclosed nature of the visas, especially their expiry date. No one knows when, where and how his visa will expire. How long we stay is undisclosed! <br><br>Though many have tried to inquire,  investigate, speculate, propound theories etc; none has come out with any credible way of knowing when his/her visa will expire. <br><br>A hymn writer once said “Though men may search they can not find, for God alone does understand” Indeed the Issuer had stamped on the front page of our passport the following; <br><br>Deuteronomy 29:29 <br>NIV<br>[29] The secret things belong to the Lord our God, but the things revealed belong to us and to our children forever, that we may follow all the words of this law.<br><br>This was intended to warn us to desist from undertaking such inquiries and investigations! <br><br>This being the case how should we then spend our days/year’s etc.? <br><br>For the answers, we are privileged to have the memoirs of one person who knew this “one-way ticket “ phenomenon and spent his stay in a certain way so we shall consult him to know how we ought to spend ours! <br><br>There is a warning however, it is not everything he said he did that is recommended so read with care, caution and discernment! Readers are warned! <br><br>Before his visa expired he gave a brief expose of how he saw his stay, a frustrating and disappointing picture. Read it;<br><br>Ecclesiastes 2:18-24 <br>NIV<br>[18] I hated all the things I had toiled for under the sun because I must leave them to the one who comes after me. <br><br>[19] And who knows whether that person will be wise or foolish? Yet they will have control over all the fruit of my toil into which I have poured my effort and skill under the sun. This too is meaningless. <br><br>[20] So my heart began to despair over all my toilsome labor under the sun. [21] For a person may labor with wisdom, knowledge and skill, and then they must leave all they own to another who has not toiled for it. This too is meaningless and a great misfortune.<br><br> [22] What do people get for all the toil and anxious striving with which they labor under the sun? [23] All their days their work is grief and pain; even at night their minds do not rest. This too is meaningless.<br><br>Hope was not lost to him, read what he did and hence his advice;  <br><br>[24] <b>A person can do nothing better than to eat and drink and find satisfaction in their own toil. This too, I see, is from the hand of God</b><br><br>To conclude take note of the following; we came with a one-way return ticket. We shall not come back again. Our visas are non-renewable, even if extended they shall surely expire. As to when we are unaware. We wish we could know how many years remain on our visas!  <br><br>Knowing this take his advice ; <br>Ecclesiastes 2:24 <br>NIV<br>[24] A person can do nothing better than to eat and drink and find satisfaction in their own toil. This too, I see, is from the hand of God,<br><br>( Please do not “misread” or misinterpret  the word “drink” to mean go and “ chill” you are a Ghanaian I know you 🤣)<br><br>But on a more serious note be guided by his final advice <br><br>Ecclesiastes 11<br>KJV<br>9+ Rejoice, O young man, in thy youth; and let thy heart cheer thee in the days of thy youth, and walk in the ways of thine heart, and in the sight of thine eyes: but know thou, that for all these things God will bring thee into judgment<br><br>Ecclesiastes 12<br>KJV<br>13 Let us hear the conclusion of the whole matter: Fear God, and keep his commandments: for this is the whole duty of man.<br><br>14+ For God shall bring every work into judgment, with every secret thing, whether it be good, or whether it be evil.<br><br>A holiday reading I share with you! <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:08.426Z",
    "updatedAt": "2025-06-10T01:06:08.426Z",
    "publishedAt": "2025-06-10T01:06:08.438Z",
    "slug": "this-our-journey-of-no-return"
  },
  {
    "id": 181,
    "documentId": "lwd8lg5ncby5dqmqtjvbs5h7",
    "title": "”Each Day”",
    "text": "Each Day is Unique <br>It is a Gift;<br>Appreciate, and Thank  the Giver.<br><br>Each Day comes <br>With its  challenges, Walk And<br>Wait Patiently On the Lord! <br><br>Each Day is an Offer Of God’s Grace, accept it Wholeheartedly And,  be Gracious to Others also! <br><br>Each Day Is A Promise<br>Fulfilled, endeavour to Fulfil <br>Yours to Everyone you owe! <br><br>Each Day is A Day of <br>Refreshment and Renewal,  <br>Create time For Yourself! <br><br><b>Each Day, Each Day, Each Day</b>!<br><b>Treat each Day, With Care</b> <br><b>When It passes, It will Never Come Again!</b>! <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:08.260Z",
    "updatedAt": "2025-06-10T01:06:08.260Z",
    "publishedAt": "2025-06-10T01:06:08.266Z",
    "slug": "each-day"
  },
  {
    "id": 179,
    "documentId": "ndb1o5kf4lqi36utmkvj1pze",
    "title": "Long Forgotten",
    "text": "Ecclesiastes 9<br>KJV<br>5+ For the living know that they shall die: but the dead know not any thing, neither have they any more a reward; for the memory of them is forgotten.<br><br>I have waited the whole day expecting to read from any tabloid what this day is noted for but to no avail. <br><br>Today 17th April 1967 was the day Lt. Gen. E.K. Kotoka died as a result of the abortive coup attempt by some junior officers of the military led by Lt. S. B. Arthur. <br><br>This took place some fifty -eight years ago! As the Bible says this event, its initiators and victims are all long forgotten! <br><br>Beloved, even so, shall we all be forgotten fifty-eight years from now. The majority living at that time will not remember us. <br><br>Life will go on as it is today with no one remembering who we were! People’s interest and attention would be as it is today on the economy, the fuel price, the exchange rate etc, and how to put food on the table. <br><br>So, enjoy and make yourself happy while you are alive today! I am going to get myself some light -soup to drink! For we brought nothing into the world and we shall certainly carry nothing away. <br><br>Nobody will remember us fifty years from now. Gen. Kotoka died on 17th April 1967 exactly 58 years today life goes on as it was before! <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:08.059Z",
    "updatedAt": "2025-06-10T01:06:08.059Z",
    "publishedAt": "2025-06-10T01:06:08.072Z",
    "slug": "long-forgotten"
  },
  {
    "id": 177,
    "documentId": "y2h1sbojt01a3rv5qn99iqz5",
    "title": "The Low Side Of Our Profession: An Observation",
    "text": "Ephesians 4<br>KJV<br>25+ Wherefore putting away lying, speak every man truth with his neighbour: for we are members one of another.<br><br>Zechariah 8<br>KJV<br>16+ These are the things that ye shall do; Speak ye every man the truth to his neighbour; execute the judgment of truth and peace in your gates:<br><br>One negative practice that appears to be gaining ground among professing believers is the art of lying. Yes, you read it. <br>Like you, I’ve also asked were we born liars or we learnt them? <br><br>The ease at which lies are told with a straight face makes one wonder if lying is part of our nature. Some say it is part of our “fallen nature” which is true! <br><br>But, surely we were not born liars we learnt them, it is a habit we acquire through association. If you grew up in a lying environment the chances of you becoming one is very high! . <br><br>If you work or associate yourself with liars the chances of you becoming one is very high. It is also evidentially clear that certain professions thrive on lies to succeed so if you should work in such environments/professions the chances of you becoming a liar are high. <br><br>Please note, that I am not implying one is automatically a liar, but the chances of becoming one are high! A conscious deliberate self-restraint is what one needs to stay true to oneself in such environments /professions <br><br>It is therefore a “disease” that we contract through association, so let us therefore watch our associations and walk away from any that have the potential of influencing us to become liars<br><br>“Researchers”  have found that Lie has sisters, these are “ sister rumour-monger”, “sister gossiper” “sister, hatred” and a younger “sister jealousy”  Some have given their mother’s name as “Madam Envy”! <br><br>They described her as a ferocious woman who does not take kindly to truth, hard work and progress anywhere by anyone,  she is feared worldwide. Read it;<br><br>Proverbs 27<br>KJV<br>4+ Wrath is cruel, and anger is outrageous; but who is able to stand before envy?<br><br>Who is able to stand before Mrs ( Mr) Envy? <br><br>Beloved, of great worry and concern, is how some have perfected this act of lying such that they are believed by even the wise! They know what to put together, how to present and say things, etc. <br><br>But why must someone lie? The reasons are many but the most important ones are,  fear, insecurity, low self-esteem, inadequacy, and the  craving for social acceptance and glorification   (You can add yours)<br><br>Beloved,  lies do not build, it rather destroy. It has been known to be the cause of breakdowns, and divisions among hitherto peaceful and loving relationships! <br><br>Dearly beloved if we can go by what the scriptures teach, we should not experience any such unpleasant situations; which is <br><br>Ephesians 4<br>KJV<br>25+ Wherefore putting away lying, speak every man truth with his neighbour: for we are members one of another.<br><br>To lie is to betray a trust, and trust is the foundation on which relationships are built once betrayed everything crumbles! Many a once-strong relationship has crumbled as a result Of this act. <br><br>To put back the pieces ( trust ) is a Herculean task even if done it never looks the same as the original. So let us be careful about things we say to and about one another. <br><br>May we heed Paul’s admonition <br>Colossians 4<br>KJV<br>6+ Let your speech be alway with grace, seasoned with salt, that ye may know how ye ought to answer every man.<br><br>May peace and truth be with and among us forever. Let us work towards achieving this! I desire to live in peace with you based on shared love and the truth we speak to each other. <br><br>My thoughts to share <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:07.892Z",
    "updatedAt": "2025-06-10T01:06:07.892Z",
    "publishedAt": "2025-06-10T01:06:07.898Z",
    "slug": "the-low-side-of-our-profession-an-observation"
  },
  {
    "id": 173,
    "documentId": "t08nqyfdmx254f3oi9gjrgkp",
    "title": "How Will We Be Assessed?",
    "text": "Matthew 5<br>KJV<br>20+ For I say unto you, That except your righteousness shall exceed the righteousness of the scribes and Pharisees, ye shall in no case enter into the kingdom of heaven.<br><br>In a recent conversation with a friend, this issue of how are we going to be assessed came up! I tried to avoid, evade, and abort it but to no avail !! I kept saying “Can we change the topic, conversation etc but he kept asking! So we sat down to discuss it in an informal manner <br><br>My attempt to avoid it is simple I don’t know. Though I said this several times it was such that I had to yield. So what you are about to read are views we both expressed and shared. <br><br>We began by asking is it possible that there would be a pass mark. A range! A cut-off point, etc? We both concluded that yes it is likely. We based our conclusion on the above passage. <br><br>It is a comparative passage “Except your righteousness shall exceed the righteousness of the scribes and Pharisees,”   The word “ except “ is the operative word suggesting that there is a baseline which must be crossed. <br><br>The “righteousness “ of the Scribes and Pharisees  was set as the baseline which must be crossed before one can “enter into the kingdom of heaven.” <br><br>Indeed the entire context in which this verse was placed indicates that the bar is higher for Christians.<br><br> I told some young men that the examination I wrote and passed to qualify me for a scholarship to study in the UK if it were today I’d have failed to qualify! Each generation or dispensation has its own threshold and standard of assessing who qualifies and who does not. <br><br>If this is so, then it follows that yes there is a criterion, a pass mark that one must attain to enter the Kingdom of Heaven. <br><br>So strive to attain this pass mark. The how is what follows in the second instalment. <br><br>What is important is to note that living recklessly, haphazardly, carelessly thinking o God is merciful, forgiving etc and will surely grant one a place regardless is to deceive oneself. <br><br>To excel in school we all know what it takes;  ask to be told in case you don’t! Ask Azumah Nelson what it took him to become an undefeated champion<br><br>Even the great apostle Paul said this about himself and his quest to make the grade.  Read it ; <br>1 Corinthians 9<br>KJV<br>27+ But I keep under my body, and bring it into subjection: lest that by any means, when I have preached to others, I myself should be a castaway.<br><br>My dear, there is a pass mark to be attained. Strive to make it. Before we parted company we both agreed on how difficult it would be. But we also agreed that God has given us a bonus mark; the righteousness of Christ! This has been credited to us. All that is left for us is to  “top it up”. <br><br>God through Christ gave us 70% look for 30% to top up! <br><br>Matthew 5:20 <br>NIV<br>[20] For I tell you that <b>unless your righteousness qsurpasses that of the Pharisees and the teachers of the law, you will certainly not enter the kingdom of heaven</b>.<br><br>Please this is not a doctrinal teaching or belief, it is a friendly hypothesis just to warn us of the need to be prepared! Surely we must cross a pass mark. <br>Philippians 2:12 NIV<br>[12] Therefore, my dear friends, as you have always obeyed---not only in my presence, but now much more in my absence---continue to work out your salvation with fear and trembling,<br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:07.374Z",
    "updatedAt": "2025-06-10T01:06:07.374Z",
    "publishedAt": "2025-06-10T01:06:07.398Z",
    "slug": "how-will-we-be-assessed"
  },
  {
    "id": 171,
    "documentId": "jiqetg4h929qnholzr8om0iw",
    "title": "The Death, Burial and The Resurrection Of Jesus: Matters Arising",
    "text": "<br>Matthew 28<br>KJV<br>12 And when they were assembled with the elders and had taken counsel, they gave large money unto the soldiers,<br><br>13+ Saying, Say ye, His disciples came by night, and stole him away while we slept.<br><br>In a few days, the entire World will soon lay down its tools, industries will shut down, and in some places, massive processions through principal streets will take place with palm branches being carried, signifying the triumphant entry of this man into Jerusalem  <br><br>Others will attempt to reenact an event that shocked the world -the death burial and resurrection of a young man who died thousands of years ago by carrying wooden crosses through the streets <br><br>This young man’s name is Jesus, and the event took place in a remote corner of the world, Jerusalem to be precise. <br><br>But why is this event regarded as significant? Why would the resurrection from the dead of this Man bring to a stop all activities of life? This is an incomprehensible global phenomenon! <br><br>Since the beginning of time no man’s death, not presidents, monarchs etc has ever been marked worldwide than this Man. <br><br>Why is this man’s death observed, it is because it was by this event that Humanity gained its freedom from Death. <b>The resurrection of Jesus from the dead gave hope to a hitherto hopeless world that has until then been living in the fear of death</b>. <br><br>Read how the Hebrew writer described man’s hopeless state before the resurrection; <br><br>Hebrews 2:14-15 <br>NIV<br>[14] Since the children have flesh and blood, he too shared in their humanity so that by his death he might break the power of him who holds the power of death---that is, the devil--- <br><br>[15] <b>and free those who all their lives were held in slavery by their fear of death</b><br>.<br>By His resurrection, He *destroyed both the Power and Fear of  Death! <b>He brought to life immortality</b>. A truth He stated while alive and confirmed by his coming out of the Grave. Read it;<br><br>John 11:25-26<br> NIV<br>[25] Jesus said to her, “I am the resurrection and the life. The one who believes in me will live, even though they die; [26] and whoever lives by believing in me will never die. Do you believe this?”<br><br>Beloved, if there is no resurrection free from the dead then we’ve been deceived and doomed forever. Because it is the resurrection that gives us hope that there is life beyond the Grave. <br><br>It is the resurrection of Jesus that gave us hope that we shall be given an incorruptible body with which we shall live forever. As we can all attest to  “ change and decay in all around we see”for we can not inherit the Kingdom of God while clothed in this corruptible body. <br><br>Read all that there is about this phenomenon; <br><br>1 Corinthians 15:42-44,50-55 <br>NIV<br>[42] So will it be with the resurrection of the dead. The body that is sown is perishable, it is raised imperishable; [43] it is sown in dishonor, it is raised in glory; it is sown in weakness, it is raised in power;<br><br> [44] it is sown a natural body, it is raised a spiritual body. If there is a natural body, there is also a spiritual body. <br><br>[50] I declare to you, brothers and sisters, that flesh and blood cannot inherit the kingdom of God, nor does the perishable inherit the imperishable. <br><br>[51] Listen, I tell you a mystery: We will not all sleep, but we will all be changed--- [52] in a flash, in the twinkling of an eye, at the last trumpet. For the trumpet will sound, the dead will be raised imperishable, and we will be changed. <br><br>[53] For the perishable must clothe itself with the imperishable, and the mortal with immortality. <br><br>[54] When the perishable has been clothed with the imperishable, and the mortal with immortality, then the saying that is written will come true: “Death has been swallowed up in victory.”<br><br> [55] “Where, O death, is your victory? Where, O death, is your sting?”<br>.<br>Yes, the resurrection of Jesus Christ from the Grave is a breakthrough for us who have placed our faith and hope in Him. <br>That we shall live forever is confirmed by this event that took place several centuries ago <br><br><b>Beloved, live your life in a manner as to benefit from this event at the end of your life's journey. Do not wait till it becomes late. Act now</b>! <br><br>Maranatha! <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:07.150Z",
    "updatedAt": "2025-06-10T01:06:07.150Z",
    "publishedAt": "2025-06-10T01:06:07.165Z",
    "slug": "the-death-burial-and-the-resurrection-of-jesus-matters-arising"
  },
  {
    "id": 169,
    "documentId": "gepjw04bv1kr93z7xe59z0k6",
    "title": "Every Road",
    "text": "Every  road leads, <br>To a Destination.<br>Pleasant or Painful <br>The Choice Is Yours!<br>Ask before you Begin!<br><br>Every road leads <br>To a Destination, <br>There is No Endless Road <br>So be prepared, plan<br>Always, Carry a Road Map. <br><br>Every Road leads <br>To a Destination ; <br>Even if you Don’t Know <br>Where You're Going <br>Any Road you take will lead you there. <br><br>Every road leads <br>To a destination <br>Life is a Road, so Choose wisely <br>Always remember Decisions, <br>Determine Destinies! <br>Where will Your Road lead you? <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:06.984Z",
    "updatedAt": "2025-06-10T01:06:06.984Z",
    "publishedAt": "2025-06-10T01:06:06.993Z",
    "slug": "every-road"
  },
  {
    "id": 167,
    "documentId": "vs6je4a73pulwcs45fki3c4h",
    "title": "”Timeless”",
    "text": "Timeless <b>Words</b>, remain<br>With us even when <br>Those who Uttered <br>Them are Dead and Gone,<br>They give Us Hope and Inspiration <br><br>Timeless <b>Thoughts</b>,  <br>Are thoughts that Re-appear <br>In our Quiet Moments <br>To put us In Remembrance of Love Ones. Cherish Them!<br><br>Timeless <b>Joys</b>,<br>Are joys that Refresh, <br>And rekindle Spirits;<br>So Treasure them. <br><br><b>Timeless Words</b>,<br><b>Timeless Thoughts</b>, <br><b>Timeless Joys</b>,<br><b>These are Divine Medications</b>;<br><b>Take them as Often as you Can</b>!<br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:06.813Z",
    "updatedAt": "2025-06-10T01:06:06.813Z",
    "publishedAt": "2025-06-10T01:06:06.819Z",
    "slug": "timeless"
  },
  {
    "id": 165,
    "documentId": "eeju7qlebnf12v5bjs21x3gb",
    "title": "Footsteps",
    "text": "Psalms 17<br>KJV<br>5+ Hold up my goings in thy paths, that my footsteps slip not.<br><br>Anytime I read this verse it reminds me of mined fields that were found in Angola during their civil war where bombs and other bobby traps are hidden in the ground waiting for the innocent to step on them and be killed. <br><br>The effects of these traps were very harrowing and disturbing, they left people with amputated legs, deformed bodies etc. These are the “ fortunate “ ones for the majority of those who stepped on these bombs died. <br><br>After the war efforts were made to discover and demobilize these bombs. Another risky venture. Here is where the need to follow in the footsteps of others comes in. <br><br>Those undertaking the exercise carried with them probes, types of equipment that will buzz when they detect a mined field. After these have been removed others follow in their footsteps one foot at a time.<br><br>Beloved, this world is not a safe place it has been mined; the evil one through his agents has planted bombs in our paths to blow us off. Many are casualties because they did not follow in the steps of those who have gone before them. <br><br>We therefore need to follow in the footsteps of those who have gone ahead of us   Those who have detected and demobilised these hidden bombs and traps of the evil one. <br><br>Read how some have described and recommended this practice to us ; <br><br> 1 Corinthians 4<br>KJV<br>14 I write not these things to shame you, but as my beloved sons I warn you.<br><br>15+ For though ye have ten thousand instructers in Christ, yet have ye, not many fathers: for in Christ Jesus I have begotten you through the gospel.<br><br>16+ Wherefore I beseech you, be ye followers of me.<br><br>1 Corinthians 11<br>KJV<br>1+ Be ye followers of me, even as I also am of Christ.<br><br>Philippians 3<br>KJV<br>17+ Brethren, be followers together of me and mark them which walk so as ye have us for an ensample.<br><br>Philippians 4<br>KJV<br>9+ Those things, which ye have both learned, and received, and heard, and seen in me, do: and the God of peace shall be with you.<br><br>1 Peter 2<br>KJV<br>21+ For even hereunto were ye called: because Christ also suffered for us, leaving us an example, that ye should follow his steps:<br><br>Beloved, to avoid stepping on any satanic bomb or bobby-trap it is highly recommended that we follow in the footsteps of Christ, the apostles and any other person whose faith and example we greatly admire.  <br><br>Like the psalmist may we pray as he did that the Lord holds and keeps our feet steady in his paths so our feet do not slip. <br><br>Psalms 17<br>KJV<br>5+ Hold up my goings in thy paths, that my footsteps slip not.<br><br>A word to the wise <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:06.635Z",
    "updatedAt": "2025-06-10T01:06:06.635Z",
    "publishedAt": "2025-06-10T01:06:06.648Z",
    "slug": "footsteps"
  },
  {
    "id": 162,
    "documentId": "kvqi2jgea06ta0oj6haavokq",
    "title": "Have You Ever Asked, Why?",
    "text": "Matthew 9<br>KJV<br>30+ And their eyes were opened; and Jesus straitly charged them, saying, See that no man know it.<br><br>31 But they, when they were departed, spread abroad his fame in all that country.<br><br>I’ve come across a few things that Jesus said which I don’t get! One of which is what you’ve just read. You healed some people and placed a restraining order on them that they should not let anyone know! Aba! <br><br>Who lights a candle and places it under a table? For someone to put a lit candle under a table and not on top must have a serious reason or purpose! Why? <br><br>On another occasion ( the transfiguration on the mountain) he placed a limited embargo on the news going out public! Limited because He set a time frame. Read it <br><br>Matthew 17<br>KJV<br>9+ And as they came down from the mountain, Jesus charged them, saying, <b>Tell the vision to no man, until the Son of man be risen again from the dead</b><br><br>Again to another; <br>Matthew 8<br>KJV<br>4+ And Jesus saith unto him, See thou tell no man; but go thy way, shew thyself to the priest, and offer the gift that Moses commanded, for a testimony unto them.<br><br>The incidents recorded above and His cautions beat the mind, the fact is the news of his healing would surely give speed to his message as many will take to him; which was the very reason why he came.  And yet He forbade it. <br><br>Who would not like to advertise his success? Surely Jesus has reasons for stopping these recipients of His blessing. Though He did not state clearly the why, observing His actions does give us a clue. <br><br>The truth is the more his acts of mercy spread the more enemies he made for himself.   Read this ; <br><br>Matthew 12:13,15 <br>NIV<br>[13] Then he said to the man, “Stretch out your hand.” So he stretched it out and it was completely restored, just as sound as the other<br><br>[14] But the Pharisees went out and plotted how they might kill Jesus.<br><br>. [15] Aware of this, Jesus withdrew from that place. <br><br>Even alliances of people who once were enemies, who do not see eye to eye  were formed to harm him; read it <br><br>Mark 3<br>KJV<br>6+ And the Pharisees went forth, and straightway took counsel with the Herodians against him, how they might destroy him.<br><br>In real life, this happens! People who disagree among themselves will unite to fight you because you are their common enemy. Hmm, life! <br><br>I’ve heard a few try to explain the reason for Jesus’ restraint; but “me too” having considered and thought through the events/incidents have come to agree with some who think otherwise. <br><br>These say  “It is not everyone who should know or hear of your success”. Your failures they can be told! . <br><br>Others also say “do not show your wounds to everyone, not everybody has a plaster. Some will put in salt to increase your pain! “<br><br>Beloved on a personal note as I travel through life I’ve found these sayings or admonishments to be true. Perhaps you’ve experienced it yourself except that you did not take note nor care about it! <br><br>It was through experience that many understood why Jesus restrained these men not to tell everybody but was specific in one case regarding those they should tell! Read it ;<br><br>Matthew 8<br>KJV<br>4+ And Jesus saith unto him, See thou tell no man; but go thy way, <b>shew thyself to the priest</b>, and offer the gift that Moses commanded, for a testimony unto them.<br><br>His success story brought him enemies It got to a point that He could not walk in the open, the same has happened to some in real life; they kept themselves away from the company of others. Read it ;<br>John 7<br>KJV<br>1+ After these things Jesus walked in Galilee: for he would not walk in Jewry, because the Jews sought to kill him.<br><br>I’ve heard some give this same restraining order to some people they helped. They told them not to tell anyone. But good deeds can not be hidden they’ll come out just as those Jesus restrained did!! <br><br>Well, all said and done the advice is out there and it is a choice. Not everyone should hear of your success. Not everyone should see your wounds! Be wise! Not everyone who smiles with you loves you. <br><br>My thoughts after thinking through why Jesus restrained some from telling people of His deeds! These are my personal opinions! <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:06.300Z",
    "updatedAt": "2025-06-10T01:06:06.300Z",
    "publishedAt": "2025-06-10T01:06:06.307Z",
    "slug": "have-you-ever-asked-why"
  },
  {
    "id": 160,
    "documentId": "bisuyofoc6y312vw5on3gdp8",
    "title": "A Worthy Advice To  Keep",
    "text": "Proverbs 3<br>KJV<br>3+ Let not mercy and truth forsake thee: bind them about thy neck; write them upon the table of thine heart:<br>4 So shalt thou find favour and good understanding in the sight of God and man.<br><br>The life that pleases both God and Man according to the proverbs writer rests on two pillars, mercy and truth. To show or have mercy and to speak the truth at all times. <br><br>Is it not true that people who show mercy and speak the truth are loved, admired and appreciated by the majority except a few? <br><br>To understand what mercy means in practical terms read these ; <br>Matthew 25<br>KJV<br>35+ For I was an hungred, and ye gave me meat: I was thirsty, and ye gave me drink: I was a stranger, and ye took me in:<br>36+ Naked, and ye clothed me: I was sick, and ye visited me: I was in prison, and ye came unto me.<br><br>(also read the  Parable of the Good Samaritan; that Of the Unjust Steward etc and many others ) <br><br><br>What about Truth? We are to speak truth to all just as we are to show mercy to all. Here is where the difficulty lies. Whereas those who show mercy are loved those who speak truth are hated. <br><br>Is this not a contradiction? The very person you love because he showed you mercy, the same person you hated because he told you the truth. <br><br>But what is truth? (You remembered Pilate!)<br><br>Let’s begin with what truth is not, truth is not an allegation, it is not an assumption, I think, not perception, not a conjecture! Truth is a fact, even if it is hearsay you have investigated it and can confirm it with (empirical) evidence! <br><br>Read how the Apostle John defined truth regarding the humanity of Christ when it came under dispute by the Docetists. John’s writing (1john) was a response to the philosophy called “ Docetism” derived from the Greek word “ dokea “ which translates “ to seem, look like”. <br>( More about this another time)<br><br>John introduced his letter by stating who Jesus was, <br><br>1 John 1:1-4 <br>NIV<br>[1] <b>That which was from the beginning, which we have heard, which we have seen with our eyes, which we have looked at and our hands have touched</b>---this we proclaim concerning the Word of life<br><br>. [2] The life appeared; <b>we have seen it and testify to it</b>, and we proclaim to you the eternal life, which was with the Father and <b>has appeared to us</b>. <br><br>[3] <b>We proclaim to you what we have seen and heard</b>, so that you also may have fellowship with us. And our fellowship is with the Father and with his Son, Jesus Christ. [4] We write this to make our joy complete.<br><br>So now you know what qualifies to be called truth. Facts. To speak truth is to say for sure and with certainty what one knows (substantiate with evidence when demanded or requested)  <br><br> When Nathan confronted David concerning Bathsheba, he did not state a hearsay or an allegation but undeniable facts. <br><br>This is what the proverb writer is advising us to observe, <br>Proverbs 3:1-2<br> NIV<br>[1] My son, do not forget my teaching, but keep my commands in your heart, [2] for they will prolong your life many years and bring you peace and prosperity.<br><br>*Mercy and Truth” should not depart from you. Show mercy , yes but also be truthful! <br><br>These are hard, difficult and expensive but they are doable if one commits himself to doing them. There is always a price to pay for everything but the rewards surpass and are worth it. <br><br>A thought to share <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:06.128Z",
    "updatedAt": "2025-06-10T01:06:06.128Z",
    "publishedAt": "2025-06-10T01:06:06.136Z",
    "slug": "a-worthy-advice-to-keep"
  },
  {
    "id": 158,
    "documentId": "oe16ow454rko1an4y83ghy0r",
    "title": "When Words Mean Something",
    "text": "John 1<br>KJV<br>14+ And the Word was made flesh, and dwelt among us, (and we beheld his glory, the glory as of the only begotten of the Father,) full of grace and truth.<br><br>In my earlier article, I made the case against inaction and the mere uttering of words! In this follow up l intend to demonstrate the example God showed us so we emulate Him. <br><br>Before Jesus came everything men knew about God was theoretical, hypothetical, etc.  When they hear “ God is love “ it does not make sense it sounds ok in the ears but it can not and is not comprehended in real terms. <br><br>Everything taught to the Jews was theoretical; you’ll remember at the funeral of Lazarus Jesus engaged his sisters in a conversation.<br><br>Well let’s replay parts of that conversation to help you understand what I mean by before Jesus came everything about God was theoretical concepts <br><br>John 11:21-26 <br>NIV<br>[21] “Lord,” Martha said to Jesus, “if you had been here, my brother would not have died. [22] But I know that even now God will give you whatever you ask.”<br><br> [23] Jesus said to her, “Your brother will rise again.” [24] Martha answered, “I know he will rise again in the resurrection at the last day.”<br><br> [25] Jesus said to her, “I am the resurrection and the life. The one who believes in me will live, even though they die; [26] and whoever lives by believing in me will never die. Do you believe this?”<br><br>Here the subject matter was the “ resurrection “ and from what Martha said she has heard, and been taught all about this subject but she was made to understand that it was “ futuristic”. <br><br>No one can fault her she was right for that was what it was! Many things they were taught at their “rabbinical school” ( makaranta! Is the Muslim version) were theoretical <br><br>Now hear what Jesus said to her <br>John 11:25<br> NIV<br>[25] Jesus said to her, “<b>I am the resurrection</b> and the life. The one who believes in me will live, even though they die;<br><br>Jesus said “My dear in times past the resurrection was a concept, but standing right before you is the real thing -I AM THE RESURRECTION” In other words “ the word ( theory, concept) has become real! <br><br>This is what John meant when he said <br>John 1:14<br> NIV<br>[14] <b>The Word became flesh and made his dwelling among us</b>. We have seen his glory, the glory of the one and only Son, who came from the Father, full of grace and truth.<br><br>God who in the past was a concept, imaginary thought etc took upon himself flesh so He can be seen and known, no more a theory. Fili fili! <br><br>This is what John said, they experienced Him, walked and ate with Him. He was real <br><br>1 John 1:1 NIV<br>[1] That which was from the beginning, which we have heard, which we have seen with our eyes, which we have looked at and our hands have touched---this we proclaim concerning the Word of life.<br><br>To John, their preaching was not theoretical but experiential. This truly is what effective, powerful preaching/teaching is about. Experiential not theoretical! <br><br>By the coming of Jesus, the Word became flesh. God who was hitherto mere words became a reality everything said and taught about Him was made manifest and demonstrated;  made real. <br><br>In Christ, God backed His love for us in real terms! Beloved, God’s love for you is not a concept or theory ( mere words ) but real. <br><br>May we learn to practicalize our words through deeds so men will know what we mean when we say something! God showed us how to do it. <br><br>My thoughts to share <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:05.828Z",
    "updatedAt": "2025-06-10T01:06:05.828Z",
    "publishedAt": "2025-06-10T01:06:05.850Z",
    "slug": "when-words-mean-something"
  },
  {
    "id": 156,
    "documentId": "pvl53iy22th7sbuq0zhylpmg",
    "title": "When Words Mean Nothing, But Sounds",
    "text": "James 2<br>KJV<br>15+ If a brother or sister be naked, and destitute of daily food,<br><br>16+ And one of you say unto them, Depart in peace, be ye warmed and filled; notwithstanding ye give them not those things which are needful to the body; what doth it profit?<br><br>The greatest challenge we face as Believers is our inability to translate words into deeds. If you’ve lived as long as some have you’ll understand what this means. <br><br>James saw firsthand how members of the congregation he attended were responding to an appeal made on behalf of a destitute hence his inspired rhetorical question. He wrote from practical experience and observation. <br><br>In effect, he is saying words are meaningless if not backed by deeds. We see this daily in our fellowship where some stand in the midst of the assembly and pours out their needs! In our case, beloved what do we do? We are simply asked to stand and “ commit the sister/brother to the Lord’s care”. <br><br>A long twenty to thirty-minute prayer is said citing and quoting copious verses of scriptures to remind God (as if He has forgotten)  that he must meet the needs of the one with the request. <br><br>We even issue as it were a “ veiled threat “ in our prayers by asking  Him to act to avoid disgrace before unbelievers. Who will ask “Where is our God?” <br><br>After the prayer as usual we walk to the needy to shake his/her hands and console and comfort him/her with more words; not a hint or personal assurance of help from us. <br><br>This is what James was alluding to; read it <br>James 2:16 <br>NIV<br>[16] <b>If one of you says to them, “Go in peace; keep warm and well fed</b>,” <br><br>Nyamè wô hô ôbè yè! Fama Nyame! Ôtsèsô Nyamè wô tsè à aboà entetià sô nyà bî ( forgive my poor twi!) <br><br>There have been instances where some have refused to tell their congregation the sufferings they are going through   When asked why, they replied  “ I know them they hear but do nothing! So I am better off not telling them”. O! <br><br>Yes,  beloved this is what happens when words mean nothing but sounds to some, and because they would not want their ears to be disturbed they prefer not to open up! <br><br>There is a need for us individually and collectively to examine ourselves concerning these ! Words without acts mean nothing but mere sounds to a sufferer. This trend of behaviour is very high among us. <br><br>The Apostle John also saw what James experienced; read how he put it; <br><br>1 John 3:18<br> NIV<br>[18] Dear children, let us not love with words or speech but with actions and in truth.<br><br>I, John (the minister) have also seen and continue to experience this hence what you’ve just read. My testimony and experience are shared by many! <br><br>A word to the wise!<br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:05.611Z",
    "updatedAt": "2025-06-10T01:06:05.611Z",
    "publishedAt": "2025-06-10T01:06:05.618Z",
    "slug": "when-words-mean-nothing-but-sounds"
  },
  {
    "id": 154,
    "documentId": "mrm2ffth5odki7f3f65gxpwg",
    "title": "Concerning Registers: Which Is Which ?",
    "text": "Revelation 20<br>KJV<br>15+ And whosoever was not found written in the book of life was cast into the lake of fire.<br><br>Local Church records on individuals are relevant for several reasons and purposes but it should be noted that these are limited to our stay here   They’ll not be used in Heaven. Why? <br><br>Have you asked why? Well, the question is who will carry it there? If two people are the last to remain on earth then one dies and is buried by the other what happens when the last one dies?   <br><br>Who will bury him, and assuming the church register was in his custody who carries it to Heaven? <br><br>I’ve said these to make the point that some think once they have their names on a church’s register that is.it; they pay no attention to anything not even their lifestyle and doings! Once they are regular at church so be it. They’ll be mentioned in Heaven! <br><br>You know this is not the case yet many by their actions believe it to be so. <br><br>As you’ve just read God or Heaven has its own register. From which qualified candidates shall be admitted. Names in  this register are not categorized or placed under the congregation's names or where they are located<br><br>They are individual names with no country, tribe, etc listed against them. No bond or free, no poor or rich, no black or fair complexioned, no literate or illiterate, no fool or wise! No Laborer or CEO, <br><br>They are simply names of people who believed that Jesus Christ is the Son of God and by believing they gave themselves to be baptized and lived their lives in line with what pleases God. <br><br>Beloved this is all that there is to be admitted into Heaven. If you can do this you’ll be guaranteed a place! When Paul said to work out your salvation this is what he meant. <br><br>Philippians 2<br>KJV<br>12+ Wherefore, my beloved, as ye have always obeyed, not as in my presence only, but now much more in my absence, work out your own salvation with fear and trembling.<br><br>Church register good as it is for local administration purposes, is no guarantee of admission to Heaven. Heaven has its own, make sure your name is in that one. How to do that is what you’ve just read. <br><br>Assure yourself that your name is there. I am sure you know this hymn; it is the way someone summed up what you’ve just read. <br><br><br>My faith has found a resting place,<br>  Not in device nor creed;<br>I trust the Ever-living One,<br>  His wounds for me shall plead.<br> <br>I need no other argument,<br>  I need no other plea;<br>It is enough that Jesus died,<br>    And that He died for me.<br>2<br>Enough for me that Jesus saves,<br>  This ends my fear and doubt;<br>A sinful soul I come to Him,<br>  He’ll never cast me out.<br>3<br>My heart is leaning on the Word,<br>  The written Word of God,<br>Salvation by my Savior’s name,<br>  Salvation through His blood.<br>4<br>My great Physician heals the sick,<br>  The lost He came to save;<br>For me His precious blood He shed,<br>  For me His life He gave.<br><br>Thoughts to share. Salvation is a personal, not a corporate endeavour <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:05.198Z",
    "updatedAt": "2025-06-10T01:06:05.198Z",
    "publishedAt": "2025-06-10T01:06:05.231Z",
    "slug": "concerning-registers-which-is-which"
  },
  {
    "id": 152,
    "documentId": "vrxmwlhlka715hsv7yr0pvq7",
    "title": "Waiting List",
    "text": "Matthew 25<br>KJV<br>41+ Then shall he say also unto them on the left hand, Depart from me, ye cursed, into everlasting fire, prepared for the devil and his angels:<br><br>Waiting lists of any type or kind can be very frustrating. It requires patience which on many occasions is difficult to practice. <br><br>Waiting list for interview. A waiting list for employment. A waiting list for admission into a college/university.  Waiting list to board a flight. Waiting list at Telcos office just for SIM card etc. <br><br>In general, let us admit that “ waiting “ is a tough time, only a few can endure it. <br><br>In an article I posted recently I made mention of the fact that all who believe in Jesus are on a waiting list regarding their mansion above! Do you know that in like manner all unbelievers alive today are on the waiting list of the Devil? <br><br>Ever since he fell, he has also been busy building “cubicles” not mansions for his followers. It appears he has more on his waiting list and with limited space available to him the best he can afford is a cubicle. <br><br>If you want to know the size of a typical cubicle the devil is putting up for his followers, beloved ask an ex-prisoner or visit a prison to see for yourself. <br><br>You can apply to stay in one for a night for free l am sure the Warders will be glad to grant you the request. There you’ll get a foretaste of what it means to live in the heat. <br><br>With this in mind let us do whatever it takes to help those who are on his waiting list to remove  their names and  place them on that of Heaven <br><br>The majority of these don’t know the type of housing the devil is preparing for them. It is not a mansion but a cubicle. What we would call today an oven or furnace. <br><br>To those whose names are on Heaven’s waiting list please do your best every day to keep your name there! It is not automatic keep checking regularly by way of how you live! <br><br>My thoughts to share! Please help someone today! <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:04.997Z",
    "updatedAt": "2025-06-10T01:06:04.997Z",
    "publishedAt": "2025-06-10T01:06:05.009Z",
    "slug": "waiting-list"
  },
  {
    "id": 150,
    "documentId": "ur1qslroxwulrf1mus5dsrvj",
    "title": "Ask To Be Told",
    "text": "<p>Ask to be told&nbsp;<br>Is an advice&nbsp;<br>The wise accept, the unwise ignore&nbsp;<br>To their destruction&nbsp;<br><br>Ask to be told&nbsp;<br>If accepted and&nbsp;<br>Followed, turns a Fool&nbsp;<br>Into a Wise person&nbsp;<br><br>Ask to be told&nbsp;<br>If obeyed and practised&nbsp;<br>Turns the ignorant<br>Into a knowledgeable&nbsp;<br><br>Ask to be told,&nbsp;<br>As a piece of advice Becomes handy&nbsp;<br>When you are at the Crossroads ;&nbsp;<br>Not knowing which way to turn<br><br>Ask to be told,&nbsp;<br>And you’ll never;<br>Miss the way!&nbsp;<br>Nor your blessings.&nbsp;<br><br>Ask to be told&nbsp;<br>Always remember&nbsp;<br>It’s a four-word sentence&nbsp;<br>Carry it with you every day.<br><br>John Franklin Tamakloe<br>&nbsp;</p>",
    "createdAt": "2025-06-10T01:06:04.833Z",
    "updatedAt": "2025-06-13T12:15:37.321Z",
    "publishedAt": "2025-06-13T12:15:37.303Z",
    "slug": "ask-to-be-told"
  },
  {
    "id": 148,
    "documentId": "mzk71m8dh3e4ub8jw0b3ovmd",
    "title": "My Gratitude To You!",
    "text": "Hebrews 6<br>KJV<br>10+ For God is not unrighteous to forget your work and labour of love, which ye have shewed toward his name, in that ye have ministered to the saints, and do minister.<br><br>Mark 9<br>KJV<br>41+ For whosoever shall give you a cup of water to drink in my name, because ye belong to Christ, verily I say unto you, he shall not lose his reward.<br><br>The above is my prayer for you, that God would honour His Word and promise and bring it to pass in your life. <br><br>I received so much from you today ( Sunday ) and can not thank you individually but I’d like you to know that I appreciate everything you gave to me. <br><br>On behalf of my family, I say thank you. May the love that binds us together in Christ grow from strength to strength. <br><br>John Franklin Tamakloe <br>Minister ( retired)<br>",
    "createdAt": "2025-06-10T01:06:04.665Z",
    "updatedAt": "2025-06-10T01:06:04.665Z",
    "publishedAt": "2025-06-10T01:06:04.672Z",
    "slug": "my-gratitude-to-you"
  },
  {
    "id": 146,
    "documentId": "clc4ylwnbvryjnca1kdu17u6",
    "title": "Out Of The Mouth Of Babes",
    "text": "Matthew 21<br>KJV<br>16+ And said unto him, Hearest thou what these say? And Jesus saith unto them, Yea; have ye never read, Out of the mouth of babes and sucklings thou hast perfected praise?<br><br>Psalms 8<br>KJV<br>2+ Out of the mouth of babes and sucklings hast thou ordained strength because of thine enemies, that thou mightest still the enemy and the avenger.<br><br>An interesting thing happened today that I believe confirms what the above scriptures say to us. <br><br>I had come out from a church service this morning and was getting ready to move away; a brother engaged me in a brief chat and while doing so a young girl of twelve; walked to me asking to talk to me! <br><br>I therefore excused the brother so I could listen to this little girl. Read what she said” I have been reading your articles and do share them with friends at school, now that you are leaving us I’d like you to continue posting so I can benefit from them and share them with my friends “<br><br>I was dumbfounded, with a deep surprise in my eyes! I asked myself how such a little girl like this showed a keen interest in what I write and post. <br><br>She told me how beneficial they are to her! I instantly hugged and encouraged her to continue reading and assured her I’d not stop posting to whichever platform she reads them. <br><br>She mentioned my poems, and how they sound rhythmic and easy to understand; tears welled up in my eyes. Indeed out of the mouth of babes, God has ordained His glory. <br><br>What some adults delete, ignore, refuse to read, regard as useless, unnecessary etc is rather a material of worth and importance to a little child. <br><br>Yes, many are called but few shall be saved. Many are invited but only a few shall respond! Many see these articles but only a few read them. My heart was made glad by this little girl’s appreciation and appeal to me. <br><br>Oh God, Thy Word is true.! <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:04.470Z",
    "updatedAt": "2025-06-10T01:06:04.470Z",
    "publishedAt": "2025-06-10T01:06:04.481Z",
    "slug": "out-of-the-mouth-of-babes"
  },
  {
    "id": 144,
    "documentId": "apumn9k6tnfoo9rqztxb676r",
    "title": "Gethsemane, A Visit",
    "text": "John 18<br>KJV<br>1+ When Jesus had spoken these words, he went forth with his disciples over the brook Cedron, where was a garden, into the which he entered, and his disciples.<br><br>2+ And Judas also, which betrayed him, knew the place: for Jesus ofttimes resorted thither with his disciples.<br><br>That  Jesus loved nature,  its beauty and its therapeutic values is what you’ve read. The verse says “for Jesus ofttimes resorted thither with his disciples” <br><br>To do what? If not relax! <br><br>Probably what Gethsemane was to Jesus in His time that is what Kakum, Aburi etc gardens are to us today! A place of relaxation, reflection and contemplation. <br><br>I get the impression that it was a well-designed and well-kept garden with sections devoted for quiet times! A popular place <br><br>It would seem the idea of having gardens has a long history. Solomon said he  had several of them ; <br>Ecclesiastes 2<br>KJV<br>5+ I made me gardens and orchards, and I planted trees in them of all kind of fruits:<br><br>6 I made me pools of water, to water therewith the wood that bringeth forth trees:<br><br>Song of Solomon 4<br>KJV<br>16+ Awake, O north wind; and come, thou south; blow upon my garden, that the spices thereof may flow out. Let my beloved come into his garden, and eat his pleasant fruits.<br><br>A Refreshing place to be! <br><br>So what is the essence of this article? To let you know that Jesus loved nature, visited and relaxed his mind and spirit! You too find time to do the same.  <br><br>Here is one that will not cost you anything; take a trip to Mamfe, drive down through the forest to Tinkong, onward to Koforidua and back. You’ll be refreshed! <br><br>I patronized these routes on several occasions on my way to Kumasi and can attest. <br><br>Or drive through Shai towards Asutuare junction pause along the route to take in fresh air and enjoy the sight and breeze. I experienced these many years ago to Akosombo  and can attest <br><br>Yes, identify and patronize your “Gethsemane” but do not forget your Judas knows there and will one day give you away! It happened to Jesus, it can and will happen to you.  So be on guard. A word to the wise!! <br><br>Thoughts to share. <br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:04.287Z",
    "updatedAt": "2025-06-10T01:06:04.287Z",
    "publishedAt": "2025-06-10T01:06:04.309Z",
    "slug": "gethsemane-a-visit"
  },
  {
    "id": 142,
    "documentId": "gm8htn6ooyxv5b9wu5uvs7yz",
    "title": "What Are We After: Who Would Want To Be Homeless?",
    "text": "John 14<br>KJV<br>2+ In my Father's house are many mansions: if it were not so, I would have told you. I go to prepare a place for you.<br><br>My dear, it is very easy to forget why we are followers of Jesus,  this comes when we get ourselves involved in fighting over irrelevant unrelated things! <br><br>Things like arguing about who is who in the church, who commands and who must obey, who smiles with me and who does not, preferring one over another,  forming and upholding alliances etc. <br><br>These are irrelevant yet they are top on the agenda of some as a result they focus on how to either undo or overdo the other. <br><br>The disciples at a point in time engaged themselves in similar irrelevant arguments in the time of Christ. Read one; <br><br>Mark 9<br>KJV<br>33+ And he came to Capernaum: and being in the house he asked them, What was it that ye disputed among yourselves by the way?<br>34+ But they held their peace: for by the way they had disputed among themselves, who should be the greatest. <br><br>Luke 22<br>KJV<br>24+ And there was also a strife among them, which of them should be accounted the greatest.<br><br>Even two of them engaged their mother to lobby on their behalf. Read it; <br><br>Matthew 20<br>KJV<br>20 Then came to him the mother of Zebedee's children with her sons, worshipping him, and desiring a certain thing of him.<br><br>21+ And he said unto her, What wilt thou? She saith unto him, Grant that these my two sons may sit, the one on thy right hand, and the other on the left, in thy kingdom.<br><br>Beloved,  what should engage our thoughts and minds is how to be a recipient of one of the promised mansions! What must I do to inherit one, should be our greatest concern! <br><br>Dear reader, be careful you don’t become a “ homeless “ person in heaven by pursuing the irrelevant to the neglecting of the relevant! <br>In actual fact, there will be none there! Which means you will not be there. Sad. <br><br>Read what Paul said should occupy our thoughts and minds;<br><br>Philippians 4:8 <br>NIV<br>[8] Finally, brothers and sisters, whatever is true, whatever is noble, whatever is right, whatever is pure, whatever is lovely, whatever is admirable---if anything is excellent or praiseworthy---think about such things.<br><br>A free <b>mansion</b>  in Heaven is to be preferred to what pertains here so think these thoughts, and concern yourself with what will get you one! <br><br>While here, beloved let us do whatever will put our names on the “waiting- list!”<br><br>My thoughts as I relook at the words of Jesus. Is your name on the waiting -list? <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:04.109Z",
    "updatedAt": "2025-06-10T01:06:04.109Z",
    "publishedAt": "2025-06-10T01:06:04.116Z",
    "slug": "what-are-we-after-who-would-want-to-be-homeless"
  },
  {
    "id": 140,
    "documentId": "i69y4vzm95x2z2wmw552ns76",
    "title": "Who Is A True Christian?",
    "text": "Romans 2<br>KJV<br>28+ For he is not a Jew, which is one outwardly; neither is that circumcision, which is outward in the flesh:<br><br>29 But he is a Jew, which is one inwardly; and circumcision is that of the heart, in the spirit, and not in the letter; whose praise is not of men, but of God.<br><br>I’ve been looking closely at  Paul’s observations regarding religious professions.  For example the designation, Christian is applied to anyone who attends a Church. But is this what it should be? <br><br>In interviews when one is asked what religion he professes the answer is Christianity   Meanwhile he does not live by what his faith teaches. His is an outward profession <br><br>This is what Paul was concerned about in the case of the Jew. He prides himself on being a Jew but in reality, his “ Jewishness “ is not seen through his deeds. It is only a tag or badge that he wears. <br><br>Beloved, Can’t this be said of many who profess to be Christians? Isn’t our profession just a tag or a badge we wear outwardly? <br><br>From what Paul is saying, One is not a Christian outwardly but rather inwardly. Christianity is not a badge to be worn but a life to lead. True Christianity is the outward expression of what is in the heart! <br><br>In other words, one is not a Christian by words but by deeds. Now, the question is do our deeds confirm what we profess to be? <br><br>Read what Paul said is the real   definition of a Jew; <br>Romans 2:29 <br>NIV<br>[29] No, <b>a person is a Jew who is one inwardly</b>; and circumcision is circumcision of the heart, by the Spirit, not by the written code. Such a person's praise is not from other people, but from God.<br><br>Apply this to our modern time, a Christian is one inward,  on whose heart is written the laws/rules of Christ. It is <b>deeds that define who is a Christian</b>!  <br><br>Let as many as profess to be Christians be seen and defined by their deeds and not by the outward expression of mere words! <br><br>A thought to share as it challenges me daily. A true Christian is one in deed. <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:03.917Z",
    "updatedAt": "2025-06-10T01:06:03.917Z",
    "publishedAt": "2025-06-10T01:06:03.926Z",
    "slug": "who-is-a-true-christian"
  },
  {
    "id": 138,
    "documentId": "jjbf2lvm88l2m297o7oskc1d",
    "title": "The Problem Of Filth",
    "text": "2 Corinthians 7<br>KJV<br>1+ Having therefore these promises, dearly beloved, let us cleanse ourselves from all filthiness of the flesh and spirit, perfecting holiness in the fear of God.<br><br>This appeal by Paul continues to be valid and of great relevance today. He made mention of two types of “ filth “ the filthiness of the flesh “ and that of the “ spirit “ ! <br><br>Indeed as our cities and surroundings are engulfed by material ( physical )  filth even so are some fellowships engulfed with spiritual filth. <br><br>What is worrying is just like how we can live the filth in our community without raising a voice; even so, we can live with the spiritual filth that surrounds us in the fellowship without raising a voice. <br><br>Like society, dare to raise a voice and you’ll be shot down even so it is in some fellowships.  <br><br>But what is  “filthiness of the flesh ?” Simply put anything that contaminates and works against the natural purpose and use of the flesh. This definition is broad so you can fill in the specifics. <br><br>Any moral conduct, behavior etc that contradicts the normal, acceptable standard is a filthiness Of the flesh. <br><br>Paul gives a clue, read it <br>Romans 1<br>KJV<br>26+ For this cause God gave them up unto vile affections: for even their women did change the natural use into that which is against nature:<br><br>27 And likewise also the men, leaving the natural use of the woman, burned in their lust one toward another; men with men working that which is unseemly, and receiving in themselves that recompence of their error which was meet.<br><br>Any abuse ( two words put together; abnormal and use =abuse, abnormal usage ) of nature results in “filthiness of the flesh” such as “gratifications” <br><br>Paul is saying, dear believer now that you have switched sides by your conversion do away with any form of abuse that will make you fleshly filthy. <br><br>Filthiness of the flesh therefore has to do with moral and ethical failure. <br><br>Do not forget, He has said ;<br>2 Corinthians 5<br>KJV<br>17+ Therefore if any man be in Christ, he is a new creature: old things are passed away; behold, all things have become new.<br><br>What about “ filthiness of spirit?” This has to do with spiritual contamination, some things contaminate the spirit, negative things that take place inside us. <br><br>Our evil thoughts and minds about someone or something etc. A contaminated spirit can not pray to God and expect to be heard. A contaminated spirit (heart)  can not offer an acceptable sacrifice ( worship ) to God<br><br>Read what Jesus said about the filthiness of the spirit and what it can not do.  <br><br> Matthew 6<br>KJV<br>14+ For if ye forgive men their trespasses, your heavenly Father will also forgive you:<br><br>15 But if ye forgive not men their trespasses, neither will your Father forgive your trespasses.<br><br>Ever wondered why your prayers are not answered? Well, among other reasons it is the spiritual filth ( hatred, envy, jealousy, evil speaking etc) that is in your heart against someone which is the reason. Your spirit is contaminated, it is filthy <br><br>Another example of spiritual filth; <br>Matthew 5<br>KJV<br>23+ Therefore if thou bring thy gift to the altar, and there rememberest that thy brother hath ought against thee;<br><br>24 Leave there thy gift before the altar, and go thy way; first be reconciled to thy brother, and then come and offer thy gift.<br><br>With a spiritually filthy heart, how can one’s sacrifice be accepted? <br><br>Finally, spiritual filth includes dabbling in spiritism and consulting with spiritualists, to invoke curses on perceived enemies. <br><br>Beloved, this is what Paul meant by his appeal ; <br><br>2 Corinthians 7:1 <br>NIV<br>[1] Therefore, since we have these promises, dear friends, let us purify ourselves from everything that contaminates body and spirit, perfecting holiness out of reverence for God<br><br>Let us rid ourselves of any filth be it fleshly or spiritual. <br><br>Thoughts to share. <br><br>John Franklin Tamakloe.<br>",
    "createdAt": "2025-06-10T01:06:03.681Z",
    "updatedAt": "2025-06-10T01:06:03.681Z",
    "publishedAt": "2025-06-10T01:06:03.694Z",
    "slug": "the-problem-of-filth"
  },
  {
    "id": 136,
    "documentId": "odlwgc6wu71v23boqwf6g5la",
    "title": "Who Will Roll  Away The Stone?",
    "text": "Mark 16<br>KJV<br>3+ And they said among themselves, Who shall roll us away the stone from the door of the sepulchre?<br><br>These women faced a challenge,  which was beyond them, the question is did they not know that the tomb was sealed? Surely they’ll know since it is a tradition common among them <br><br>What is not mentioned is the driving force behind what they tried to do. Faith. They believed that whatever it was they would get help so they went to the tomb <br><br>Just as they saw, the stone has been rolled  away <br><br>4 And when they looked, they saw that the stone was rolled away: for it was very great.<br><br>These women took a step of faith and as is known of God, He rewards faith.   The Hebrew writer puts it this way <br><br>Hebrews 11<br>KJV<br>6+ But without faith it is impossible to please him: for he that cometh to God must believe that he is, and that he is a <b>rewarder of them that diligently seek him</b><br><br>Are you also asking   “Who will roll away the stones?” Like these women take a step of faith, walk to the “ stone “ and you’ll be surprised as they were that the stone has been rolled away! <br><br>With faith, the impossible becomes possible, give it a try today. Here is a personal testimony last two weeks  I was faced with a great challenge “Who will roll away my stones?” was my headache. <br><br>Before the week ended, all the  “stones” were rolled away! What was impossible became possible in ways that surprised me! . <br><br>Yes! God rewards faith, activate your Faith. My testimony to share. <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:03.488Z",
    "updatedAt": "2025-06-10T01:06:03.488Z",
    "publishedAt": "2025-06-10T01:06:03.502Z",
    "slug": "who-will-roll-away-the-stone"
  },
  {
    "id": 134,
    "documentId": "f1a9ckeuwkuhfh8uz1k12pij",
    "title": "Nothing Lasts Forever",
    "text": "Nothing in life <br>Is meant to last,<br>Forever, not even our <br>Very lives. Therefore, <br>Enjoy every Moment! <br><br>Nothing in life,<br>Is meant to last<br>Forever, not even Friendship<br>Therefore know this, And prepare  <br><br>Nothing in life <br>Is meant to last <br>Forever, everything <br>Is in Transition, For <br>Time and Tide wait for No Man! <br><br>Nothing in life,<br>Is meant to last,<br>Forever, so make <br>The Most out of Every Opportunity <br>That comes your way <br><br>Nothing in Life <br>Is meant to last<br>Forever, today We are <br>Tomorrow we will be more <br>So, spend every minute wisely <br><br>Nothing in Life <br>Is meant to last <br>Forever, today I am “is”<br>Tomorrow, l will be “ was “ <br>So, boast not thyself!<br><br>Nothing in Life <br>Is meant to last <br>Forever, positions are <br>Not possessions Visit the Cemetery and Read <br>The Inscriptions on Tombstones!  <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:03.280Z",
    "updatedAt": "2025-06-10T01:06:03.280Z",
    "publishedAt": "2025-06-10T01:06:03.305Z",
    "slug": "nothing-lasts-forever"
  },
  {
    "id": 132,
    "documentId": "mbekjlkct4uzakru9jp5h5bb",
    "title": "Another Day Has Dawned",
    "text": "<br><b>Another Day has dawned,  <br>And,  another Month has begun, <br>Our hearts are filled <br>With gratitude, as we behold <br>Your love, mercy and grace</b>. <br><br>Another Day has dawned, <br>And, another Month has begun<br>We the living, appreciate ;<br>The gift of life you <br>Continue to bless us with. <br><br>Another Day has dawned <br>And, another Month has begun <br>Through the eyes of sinful Men;  <br>Thy glory may not see <br>We Your children will Adore Thee!<br><br>Another Day has dawned; <br>And, another Month has begun, <br>Our prayer and plea is,<br>Father, continue to guide; <br>And lead Us not into Temptation <br>For, Thine Is the Glory, Power and Majesty! Forever. <br><br>John Franklin Tamakloe<br>",
    "createdAt": "2025-06-10T01:06:03.026Z",
    "updatedAt": "2025-06-10T01:06:03.026Z",
    "publishedAt": "2025-06-10T01:06:03.042Z",
    "slug": "another-day-has-dawned"
  },
  {
    "id": 198,
    "documentId": "sx31dwffcdmqzdq7qoeohi2k",
    "title": "Did You Know God Composed A Song? ",
    "text": "<p>&nbsp;</p><p><strong>Did You Know God Composed A Song?</strong></p><blockquote><p>Deuteronomy 31:19,22&nbsp;</p><p>NIV</p><p>[19] “Now write down this song and teach it to the Israelites and have them sing it, so that it may be a witness for me against them. [22] So Moses wrote down this song that day and taught it to the Israelites.</p></blockquote><p>&nbsp;</p><p>Did you know that God once dictated a song to Moses to teach Israel? That is what the verses say!&nbsp;</p><p>&nbsp;</p><p>Isn’t it interesting and revealing that God composed a song for Moses to teach Israel? This must be a special song. How we wish it were preserved for us to hear!</p><p>&nbsp;</p><p>After reading this, I struggled with myself: How was Moses going to teach it? I can't imagine Moses being a song’s teacher!&nbsp;</p><p>&nbsp;</p><p>God knew long ago what we now know concerning the impact and power of songs! God knew it was an effective medium of communication so He used it to communicate with Israel.&nbsp;</p><p>&nbsp;</p><p>David also knew this and as we read most of the psalms were written by him &nbsp; His son Solomon would probably have won a Grammy Award and the Nobel Prize for Literature if he were alive today.&nbsp;</p><p>&nbsp;</p><p>He alone wrote ;&nbsp;</p><blockquote><p>1 Kings 4</p><p>KJV</p><p>32 And he spake three thousand proverbs: and his songs were a thousand and five.</p></blockquote><p>&nbsp;</p><p>The words of songs be they secular or spiritual never fade they remain evergreen! The older they get the better they are understood and appreciated!&nbsp;</p><p>&nbsp;</p><p>Just pause for a moment and recall songs you knew when you were young and sang at school! As you ponder over the words you now understand them better than before, because you can relate to them through experience.&nbsp;</p><p>&nbsp;</p><p>Every hymn/song is experiential, the author or composer wrote from experience. Popular hymns such as “ It is well with my soul “, ( Horatio Spafford) “O love that will not let me go “ ( George Matheson) were written from experience&nbsp;</p><p>&nbsp;</p><p>Here is the incident that inspired or influenced the&nbsp; hymn “It Is Well with My Soul “ (Horatio Spafford)</p><p>&nbsp;</p><p>“Spafford wrote the famous hymn \"It is Well With My Soul\" after hearing that his four daughters had died on a ship collision. This was two years after his only son died to pneumonia and his entire business was destroyed by the Chicago fire.” (Copied)&nbsp;</p><p>&nbsp;</p><p>Songs/hymns etc put us in remembrance of events, situations, experiences and circumstances that occur in life.&nbsp;</p><p>&nbsp;</p><p>Let me suggest and encourage you to write some of your life’s experiences; someone, some day will put them into hymns or songs of praise! If not songs, they can be turned into stories that will inspire generations after you.&nbsp;</p><p>&nbsp;</p><p>Your struggles, successes and failures are inspirational, they will speak to us even though you are dead and gone!.&nbsp;</p><p>&nbsp;</p><p>My thoughts&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-14T08:03:31.471Z",
    "updatedAt": "2025-06-14T21:50:07.547Z",
    "publishedAt": "2025-06-14T21:50:07.541Z",
    "slug": "did-you-know-god-composed-a-song"
  },
  {
    "id": 199,
    "documentId": "xw43tf1z1kq7am8jgfikc2t1",
    "title": "What Ageing Has Taught Me",
    "text": "<p>&nbsp;</p><p>What Ageing Has Taught Me</p><p>(Part 1)</p><p>1 Corinthians 13</p><p>KJV</p><p>11 When I was a child, I spake as a child, I understood as a child, I thought as a child: but when I became a man, I put away childish things.</p><p>&nbsp;</p><p>It was boxing legend the late Muhammad Ali ( Cassius Clay) who said “If a man is fifty years old but acts and behaves like a twenty-year-old; he has wasted thirty years of his life “. This is similar to what Paul wrote which you’ve read above.&nbsp;</p><p>&nbsp;</p><p>Attitudes and behaviours must be consistent with one’s age. You are fifty yet acting like a twenty-five year old. The question is “Is this true with most of us ?” From how we dress to how we speak and the things we say and how we say them all these show people how old we are. What our birth certificate states is different from how we act and behave.&nbsp;</p><p>&nbsp;</p><p>What most do not know is this, nobody will ask you how old you are; they know by how you dress, talk, act, behave etc and what your desires are.&nbsp;</p><p>&nbsp;</p><p>Some habits and characters of some have not changed, though they’ve been around for years now; they’ve remained the same ever since you knew them!&nbsp;</p><p>&nbsp;</p><p>What accounts for these, one may ask? Many things, the key among which is the inability/unwillingness to grow! Many fail to work on their attitudes and character as they grow, they take them for granted and even boast of them. Be your age.&nbsp;</p><p>&nbsp;</p><p>As you age you must make every effort to re-examine your life. How you appear in public, how you behave in public, how you speak in public, everything about you must sync or be consistent with your age.&nbsp;</p><p>&nbsp;</p><p>Read what Paul said about himself; &nbsp;</p><p>1 Corinthians 13</p><p>KJV</p><p>11 When I was a child, I spake as a child, I understood as a child, I thought as a child: but when I became a man, I put away childish things.</p><p>&nbsp;</p><p>Oh, what a man! He said I lived and acted in ways that are consistent with my age.&nbsp; What about you? Have you listened to yourself lately? What about your behaviour how consistent is it with your age?&nbsp;</p><p>&nbsp;</p><p>You’ve heard some tell you “ grow graciously” do you know what they want to tell you? Let your attitudes and behaviours be consistent with your age, this is what they mean!</p><p>&nbsp;</p><p>Ageing is not about grey hair, it is about changes in how we behave; unfortunately, most of our behaviours give us away as we’ve failed to put away “ childish ” ways.&nbsp;</p><p>&nbsp;</p><p>Please pay attention to these. A word to the wise!&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p>",
    "createdAt": "2025-06-14T09:00:52.345Z",
    "updatedAt": "2025-06-14T09:00:52.345Z",
    "publishedAt": "2025-06-14T09:00:52.341Z",
    "slug": "what-ageing-has-taught-me"
  },
  {
    "id": 200,
    "documentId": "nkbc920fggv8itden5ftjt36",
    "title": "What Ageing Has Taught Me: My Testimony ",
    "text": "<p>What Ageing Has Taught Me: My Testimony</p><p><strong>Part 3&nbsp;</strong></p><blockquote><p>Acts 20</p><p>KJV</p><p>35+ I have shewed you all things, how that so labouring ye ought to support the weak, and to remember the words of the Lord Jesus, how he said, It is more blessed to give than to receive.</p></blockquote><p>&nbsp;</p><p>As I age this verse of scripture becomes more and more pronounced than before. We have used it to take the Sunday collection which is true and right but its significance can be felt as you age.&nbsp;</p><p>&nbsp;</p><p>I remember seeing my late mother Agnes Dede Kwawu untie the end of her outer cloth to give her last pesewa to us though we could see she needed it. I’ve seen my dad do a similar thing to my younger sisters. It is now that I can fully grasp the reason and meaning behind these actions.&nbsp;</p><p>&nbsp;</p><p>As they aged we became the recipients of their last pesewas’; these were of no value or significance to them. They are happy to see us use them to buy toffee and other sweets!.&nbsp;</p><p>&nbsp;</p><p>To them “ it is more blessed to give than to receive”. They were happier giving to us than taking from us. Those who are fortunate to have their grannies and grandpas alive will testify to this.&nbsp;</p><p>&nbsp;</p><p>As they age their needs are fewer so they give away what they consider as excess! This is a sign of the mature aged; they give instead of withholding and receiving!&nbsp;</p><p>&nbsp;</p><p>There is the opposite also the immature aged who is never satisfied with what they have. Their rooms are full of things they do not need but they will not give them away. They continue to ask and receive. When will they learn “ it is more blessed to give than to receive”&nbsp;</p><p>&nbsp;</p><p>A great lesson ageing should teach us is what Paul wrote and attributed to the Lord. That at a certain age in life, we should be givers rather than receivers!&nbsp;</p><p>&nbsp;</p><p>Not only should giving be limited to the material but also the spiritual and intellectual! When we are young we receive much knowledge As we age we should give back to others this knowledge! This explains why at retirement some still teach and preach.&nbsp;</p><p>&nbsp;</p><p>Ageing has taught me to give more than to receive because my needs are fewer. Which confirms what Jesus said&nbsp;</p><p>&nbsp;</p><blockquote><p>Acts 20:35&nbsp;</p><p>NIV</p><p>[35] In everything I did, I showed you that by this kind of hard work, we must help the weak, remembering the words the Lord Jesus himself said: 'It is more blessed to give than to receive.' ”</p></blockquote><p>&nbsp;</p><p>Look into your wardrobe, hangers and shoe racks, jewel boxes etc ask yourself do I need these? Are they of any use or value to me? Bless some needy person with them and your reward will be great in heaven!!</p><p>&nbsp;</p><p>Part 4</p><p>John Franklin Tamakloe&nbsp;</p><p>(Evangelist)</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-14T09:23:45.212Z",
    "updatedAt": "2025-06-14T21:49:12.809Z",
    "publishedAt": "2025-06-14T21:49:12.802Z",
    "slug": "what-ageing-has-taught-me-my-testimony"
  },
  {
    "id": 203,
    "documentId": "bppa6j47d0alqe9rnfso0vw8",
    "title": "When Dark Clouds Overshadow",
    "text": "<p>When Dark Clouds Overshadow</p><p>&nbsp;</p><p>When dark Clouds,&nbsp;<br>Overshadow my Way,&nbsp;<br>There Is A Light that,&nbsp;<br>Will Shine to Guide Me!</p><p>&nbsp;</p><p>When dark Clouds,&nbsp;<br>Overshadow my Way,&nbsp;<br>My Faith Shall Lead,<br>And sustain Me through! &nbsp;</p><p>&nbsp;</p><p>When dark Clouds,&nbsp;<br>Overshadow my Way,&nbsp;<br>I’ll still lift and Uphold,&nbsp;<br>Thy &nbsp;Cross!</p><p>&nbsp;</p><p>When dark Clouds.<br>Overshadow my Way&nbsp;<br>And my Sight Is Blurred<br>Thou will Give me Eyes to See!</p><p>&nbsp;</p><p>When dark Clouds,&nbsp;<br>Overshadow my Way,<br>Even the Impossible,&nbsp;<br>Shall become Possible! &nbsp;</p><p>&nbsp;</p><p>Indeed, My Faith,&nbsp;<br>Looks up to There,<br>Thou Lamb of Calvary,&nbsp;<br>You’ll Never Leave Me Alone.</p><p>&nbsp;</p><p>John Franklin Tamakloe</p>",
    "createdAt": "2025-06-14T17:52:18.068Z",
    "updatedAt": "2025-06-14T17:52:18.068Z",
    "publishedAt": "2025-06-14T17:52:18.063Z",
    "slug": "when-dark-clouds-overshadow"
  },
  {
    "id": 202,
    "documentId": "kn38p7rtu98kanqvtaamf35m",
    "title": "To Whom Shall We Go?",
    "text": "<p>To Whom Shall We Go?</p><blockquote><p>John 6<br>KJV<br>68+ Then Simon Peter answered him, Lord, to whom shall we go? thou hast the words of eternal life.</p></blockquote><p>&nbsp;</p><p>To whom shall we go is a question to ask when one is at a crossroads! When things are not falling in place after you’ve tried and done all that is necessary, and yet.</p><p>&nbsp;</p><p>The realities of life can put you as it were in a tight corner such that you become frustrated. In a situation where reason has failed, human help is not forthcoming, desperation has set in and you are at your wit’s end.</p><p>&nbsp;</p><p>Here is where Peter’s response comes in handy! Turn to Jesus!</p><p>&nbsp;</p><p>Many a time this simple three-word sentence is not understood in practical terms! What does it mean to “turn to Jesus” &nbsp;in practice? &nbsp;<br>&nbsp;</p><p><strong>It means going to Him through prayers, meditating on His Word, and reflecting, all done in the quiet and alone. Cry, weep, etc., if you can; these will come automatically as the heart is overburdened with grief! &nbsp;</strong><br>&nbsp;</p><p>Jesus is our only hope in times of trial! Remain calm and gentle no matter how long it takes; the storms will come to pass! Just anchor firmly in Christ.</p><p>&nbsp;</p><p>Let the words of the popular hymn “Will your anchor hold” &nbsp;encourage you ;</p><p>&nbsp;</p><p>“<strong>We have an anchor that keeps the soul</strong><br><strong>Stedfast and sure while the billows roll,</strong><br><strong>Fastened to the Rock which cannot move,</strong><br><strong>&nbsp;Grounded firm and deep in the Savior’s love”.</strong></p><p>&nbsp;</p><p>John Franklin Tamakloe</p>",
    "createdAt": "2025-06-14T17:47:20.923Z",
    "updatedAt": "2025-06-14T21:47:34.050Z",
    "publishedAt": "2025-06-14T21:47:34.039Z",
    "slug": "to-whom-shall-we-go"
  },
  {
    "id": 201,
    "documentId": "rvfqlk4jd9ul18d5vqiwrxtc",
    "title": "Give No Ear: A Practical Advice",
    "text": "<p>Give No Ear: A Practical Advice</p><blockquote><p>Ecclesiastes 7<br>KJV<br>20 For there is not a just man upon earth, that doeth good, and sinneth not.<br>21+ Also take no heed unto all words that are spoken; lest thou hear thy servant curse thee:</p></blockquote><p>&nbsp;</p><p>The writer of these words, Solomon to me was a pragmatist and it is this that draws me closer to him! He tells it as it is and calls a spade a spade.</p><p>How I wish I could leave behind my diaries to be read by all just like he has done with his titled Ecclesiastics! I’ve been working on mine for many years now! Hmmm! Enyè easy!</p><p>&nbsp;</p><p>From the two verses above he confirms what is true but often inadmissible by many. There is no perfect man on earth, we are all “ striving” and “learning” to be! Each one is at one stage higher or lower than the other! This is a fact of life!</p><p>&nbsp;</p><blockquote><p>Ecclesiastes 7:20&nbsp;<br>NIV<br>[20] Indeed, there is no one on earth who is righteous, no one who does what is right and never sins.</p></blockquote><p>&nbsp;</p><p>You’ve heard it said, “Whatever you do people will talk about you !” Have you asked why? This happens because those who are at your level of maturity understand and appreciate you whereas those below will condemn and speak evil of you! It is as simple as this</p><p>&nbsp;</p><p>It is so because their level of understanding, knowledge and experience is lower than yours. If they wear the shoes you wore, stand where you stood, hear what you heard, and see what you saw and know what you knew ; they’ll appreciate and make informed comments.</p><p>&nbsp;</p><p>But quite often this is not the case &nbsp;It is for this reason that Solomon advised;&nbsp;</p><blockquote><p>Ecclesiastes 7:21&nbsp;<br>NIV<br>[21] *Do not pay attention to every word people say*, or you may hear your servant cursing you---</p></blockquote><p>&nbsp;</p><p>It is not “every word, “ they say which is relevant some may others may not. Take the relevant and throw the irrelevant into the trash basket! In other words, do not take them to heart.</p><p>&nbsp;</p><p>This calls for discernment, the ability to discern what is and what is not, and here lies the difficulty!&nbsp;<br><br>To the immature and unwise everything said ( words) is relevant. So he ends up hearing his servant cursing him which makes him go mad!</p><p>&nbsp;</p><p>If only we could apply the “Solomonic” formula and advice to tell the relevant from the irrelevant it would help us know who to listen to or not. It is not everything said by everybody that matters.&nbsp;<br>Some things said by some matters.</p><p>&nbsp;</p><p>If you want to know where this approach is more pronounced and applicable then it is the political arena. Whatever a ruling government says or does the opposition will say the contrary. Some of the “ contrary “ statements, suggestions etc will make sense others non-sense!</p><p>&nbsp;</p><p>Beloved do not give ear to everything said about you, you know yourself better than they do. Listen to some, ignore others. Move on with your life, always remember people’s level of maturity informs what they see and what they say!</p><p>&nbsp;</p><p>You owe no one an explanation except God! He will judge you according to what He knows about you He will not call any to tell Him anything about you.</p><p>&nbsp;</p><blockquote><p>2 Corinthians 5<br>KJV<br>10+ For we must all appear before the judgment seat of Christ; that every one may receive the things done in his body, according to that he hath done, whether it be good or bad.</p></blockquote><p>&nbsp;</p><blockquote><p>Romans 14<br>KJV<br>10+ But why dost thou judge thy brother? or why dost thou set at nought thy brother? for we shall all stand before the judgment seat of Christ.</p></blockquote><p>&nbsp;</p><p>My take.</p><p>&nbsp;</p><p>John Franklin Tamakloe</p>",
    "createdAt": "2025-06-14T17:38:03.359Z",
    "updatedAt": "2025-06-14T21:48:43.553Z",
    "publishedAt": "2025-06-14T21:48:43.544Z",
    "slug": "give-no-ear-a-practical-advice"
  },
  {
    "id": 204,
    "documentId": "kc5prua7sul9wpp37jv2xob5",
    "title": "Live, So As Not To Regret",
    "text": "<p>Live, So As Not To Regret<br>&nbsp;</p><blockquote><p>Matthew 8<br>KJV<br>12+ But the children of the kingdom shall be cast out into outer darkness: there shall be weeping and gnashing of teeth.</p></blockquote><p>&nbsp;</p><p>This is a very strange statement made by the Lord, which should serve as a warning to every believer. That the “ children of the kingdom shall be cast out into outer darkness” is an undeniable truth that should not be taken for granted.</p><p>&nbsp;</p><p>We who believe and have been baptized into Christ are the children of the kingdom He is referring to; &nbsp; there is no guarantee that we shall be spared if we live reckless unrepentant lives.</p><p>This truth runs through many verses just that many are not observant.<br><br>Read this,&nbsp;</p><blockquote><p><br>Mark 16<br>KJV<br>16+ He that believeth and is baptized *shall be saved*; but he that believeth not shall be damned.</p></blockquote><p>&nbsp;</p><p>“Shall be saved” is not the same as “is saved “. He that believeth and is baptized shall be saved is not the same as “ he that believeth and is baptized is saved”.</p><p>&nbsp;</p><p>Paul also echoed the same when he said&nbsp;<br>&nbsp;</p><blockquote><p>Romans 10<br>KJV<br>13+ For whosoever shall call upon the name of the Lord shall be saved.</p></blockquote><p>The possibility of one losing his salvation is forcefully affirmed by Paul,&nbsp;</p><p>&nbsp;</p><p>Read it;&nbsp;<br>&nbsp;</p><blockquote><p>1 Corinthians 10<br>KJV<br>12+ Wherefore let him that thinketh he standeth take heed lest he fall.</p></blockquote><p>&nbsp;</p><p>The Apostle John added to this when he said;&nbsp;<br>&nbsp;</p><blockquote><p>2 John 1:8&nbsp;<br>NIV<br>[8] <strong>Watch out that you do not lose what we have worked for, but that you may be rewarded fully.</strong></p></blockquote><p><br>So you see, live so as not to regret in the end, the expression “ weeping and gnashing Of teeth “ is summed up in one word; regret”.</p><p>&nbsp;</p><p><strong>Beloved, let us walk wisely paying attention and giving heed to the warnings, pieces of advice, guidances etc; &nbsp;that are spoken or written which we hear or read daily.</strong></p><p>&nbsp;</p><p>Nothing is more painful than to be disappointed in Heaven, which is possible when your name is not found &nbsp;in the Book of Life. Please note, not a local church attendance or membership register!</p><p>&nbsp;</p><p>This document is not admissible in heaven; it is necessary and valuable here for local membership administrative purposes! When the last member dies, that register is closed and will be left here. You may have your name in it but not in that which is in Heaven Please note the difference.</p><p>&nbsp;</p><p>&nbsp;Read it ;&nbsp;<br>&nbsp;</p><blockquote><p>Revelation 20:12, 15<br>NIV<br>And I saw the dead, great and small, standing before the throne, and books were opened. Another book was opened, which is the book of life. The dead were judged according to what they had done as recorded in the books.</p><p>[15] Anyone whose name was not found written in the Book of Life was thrown into the lake of fire</p></blockquote><p>.</p><p>Maranatha!</p><p>&nbsp;</p><p>John Franklin Tamakloe.</p>",
    "createdAt": "2025-06-14T18:06:26.376Z",
    "updatedAt": "2025-06-14T21:46:11.942Z",
    "publishedAt": "2025-06-14T21:46:11.887Z",
    "slug": "live-so-as-not-to-regret"
  },
  {
    "id": 205,
    "documentId": "gsib5fsf5bhkj4rn7x7jfpg4",
    "title": "Honour: What Does It Mean?",
    "text": "<p>&nbsp;</p><p>&nbsp;</p><p>Honour: What Does It Mean?</p><p>Proverbs 30</p><p>KJV</p><p>17 The eye that mocketh at his father, and despiseth to obey his mother, the ravens of the valley shall pick it out, and the young eagles shall eat it.</p><p>&nbsp;</p><p>Proverbs 23</p><p>KJV</p><p>22+ Hearken unto thy father that begat thee, and despise not thy mother when she is old.</p><p>&nbsp;</p><p>Every man or woman has two indispensable personalities: a father and a mother, persons he/she can not ignore or despise.&nbsp;</p><p>&nbsp;</p><p>Why is this so? It is so because his/her life depends on how he/she treats them. Divine ordinances support this statement as stated below ;&nbsp;</p><p>&nbsp;</p><p>Exodus 20</p><p>KJV</p><p>12+ Honour thy father and thy mother: that thy days may be long upon the land which the Lord thy God giveth thee.</p><p>&nbsp;</p><p>Ephesians 6</p><p>KJV</p><p>Ephesians 6</p><p>KJV</p><p>1+ Children, obey your parents in the Lord: for this is right.</p><p>&nbsp;</p><p>2+ Honour thy father and mother; (which is the first commandment with promise;)</p><p>&nbsp;</p><p>3 That it may be well with thee, and thou mayest live long on the earth.</p><p>&nbsp;</p><p>The operative word is “ honour”, what does it mean “ to honour?”&nbsp; Why is this important?&nbsp;</p><p>&nbsp;</p><p><strong>To honour is simply to acknowledge, respect and submit to someone regardless of social, economic, etc status.&nbsp;</strong></p><p>&nbsp;</p><p>What most don’t know is that the above-mentioned (acknowledgement, respect, submission) are the <strong>prerequisites for establishing and maintaining a good relationship!.&nbsp;</strong></p><p>&nbsp;</p><p>If we acknowledge, respect and submit to each other we shall have good relationships among and between us; which will result in peace, happiness and goodwill! We shall always be at peace with ourselves.&nbsp;</p><p>&nbsp;</p><p>If in doubt, take time to observe the type of relationship or bond&nbsp; between any two persons you know, ie wife /husband; friends, colleagues at work, school etc&nbsp;</p><p>&nbsp;</p><p>If it is strong it is characterised by these three; if it is weak it is because either one or two of these ( or all ) are missing&nbsp;</p><p>&nbsp;</p><p>A relationship or bond is stronger where these are practised, acknowledgement, respect and submission to one another.&nbsp;</p><p>&nbsp;</p><p>So, this is what it means to honour! To have and to maintain a good relationship with anyone ( father, mother, friend etc) we must acknowledge, respect and submit to one another.&nbsp;</p><p>&nbsp;</p><p>This is why Paul admonished believers to submit to each other&nbsp;</p><p>&nbsp;</p><p>Ephesians 5</p><p>KJV</p><p>21+ Submitting yourselves one to another in the fear of God.</p><p>&nbsp;</p><p>Philippians 2</p><p>KJV</p><p>3+ Let nothing be done through strife or vainglory; but in lowliness of mind let each esteem other better than themselves.</p><p>(Acknowledgement, respect, submission is implied!)&nbsp;</p><p>&nbsp;</p><p>Where these three are missing here is what it leads to ;</p><p>Galatians 5</p><p>KJV</p><p>26+ Let us not be desirous of vain glory, provoking one another, envying one another.</p><p>&nbsp;</p><p>A word to the wise.&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-15T08:24:04.622Z",
    "updatedAt": "2025-06-15T08:24:04.622Z",
    "publishedAt": "2025-06-15T08:24:04.611Z",
    "slug": "honour-what-does-it-mean"
  },
  {
    "id": 206,
    "documentId": "pd21e72efj2snzm0vqm8r66d",
    "title": "My Visit To The Cemetery: Matters Arising! ",
    "text": "<p>The Certainty Of God’s Word: My Visit To The Cemetery</p><p>Genesis 3</p><p>KJV</p><p><strong>19</strong><i><strong>+</strong></i><strong>&nbsp;</strong>In the sweat of thy face shalt thou eat bread, till thou return unto the ground; for out of it wast thou taken: for dust thou art, and unto dust shalt thou return.</p><p>&nbsp;</p><p>Recently I visited a cemetery and after performing the burial activity, I waited for a while to take a closer look at the individual graves scattered about. Of interest to me are the dates written on them. A few graves caught my attention these were graves with old dates.&nbsp;</p><p>&nbsp;</p><p>The dates written on these tombs indicate that those buried underneath the slabs have been there for over a hundred years! Amazing sight to see.&nbsp;</p><p>&nbsp;</p><p>I stood still and asked what the conditions of the bodies buried under the concrete slabs were. It is likely their flesh is turned to earth and so also may their bones be.&nbsp;</p><p>&nbsp;</p><p>While I walked away the truth that hit me hard in the face is what God said “” For dust thou art, and unto dust shalt thou return.”&nbsp;We came from the earth and shall return to it.&nbsp;</p><p>&nbsp;</p><p>Beloved, everything came from the earth and shall return to the same ! You name it, whatever we have was taken from the earth ! As an example , the Food we eat was from the earth after we eat and ease ourselves they go back to the earth.</p><p>&nbsp;</p><p>Precious items such as necklaces, earrings, clothing, automobiles etc are all products from materials buried in the earth. We dug them up in their natural forms, refined them and turned them into what we need. They shall all return to the earth with time!</p><p>&nbsp;</p><p>&nbsp;All these confirm what Paul said;&nbsp;&nbsp;</p><p>1 Timothy 6</p><p>KJV</p><p><strong>7</strong><i><strong>+</strong></i><strong>&nbsp;</strong>For we brought nothing into this world, and it is certain we can carry nothing out.</p><p>&nbsp;</p><p>Nothing we have belongs to us, they belong to the earth, and the earth belongs to God. So everything shall return to the earth and through that to God who created it. This is what is meant when we say God owns everything.&nbsp;</p><p>&nbsp;</p><p>We are therefore “tenants” of the earth, everything is on rent. When our tenancy expires so goes everything! &nbsp;</p><p>&nbsp;</p><p>Here is what my visit to the cemetery reminded me of, which I share with you! Dust I am and unto dust I shall return. Everything I have shall return to the earth; and so will yours be. &nbsp;The next time you visit a cemetery take time to walk around and read the dates on tombs.&nbsp;</p><p>&nbsp;</p><p>So let us be wise regarding how we use whatever we &nbsp;have, knowing that one day we shall give them back to the Owner. Enjoy them though.</p><p>&nbsp;</p><p>Yè bè wû enti yèń —-? Hmmmm eyè asemoo!&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-15T12:10:25.587Z",
    "updatedAt": "2025-06-15T12:10:25.587Z",
    "publishedAt": "2025-06-15T12:10:25.572Z",
    "slug": "my-visit-to-the-cemetery-matters-arising"
  },
  {
    "id": 207,
    "documentId": "wclttsxr1xuyyplvkodrmmbm",
    "title": "A Tragedy: An Evil Under The Sun",
    "text": "<p>&nbsp;</p><p>&nbsp;</p><p>A Tragedy: An Evil Under The Sun.</p><p>Job 19:14-16</p><p>NIV</p><p>[14] My relatives have gone away; my closest friends have forgotten me. [15] My guests and my female servants count me a foreigner; they look on me as on a stranger.</p><p>&nbsp;</p><p>[16] I summon my servant, but he does not answer, though I beg him with my own mouth.</p><p>&nbsp;</p><p>A sorrowful incident was screened on a social media handle that I watched which resonated with the above words! It has to do with neglect.&nbsp;</p><p>&nbsp;</p><p>A man who once commanded admiration and respect in his youthful and adult working life was reduced to a nobody in his old age. In his heyday, he had many who waited on him. His office and home were like a beehive!&nbsp;</p><p>&nbsp;</p><p>Suddenly things changed when he left office and went into retirement, All his friends deserted him, even his family especially those he cared for were nowhere near him.&nbsp;</p><p>&nbsp;</p><p>His calls and cries were not heard by any of them. He was left to struggle on his own It was these that brought to my mind these scriptures;&nbsp;</p><p>Job 19:14&nbsp;</p><p>NIV</p><p>[14] My relatives have gone away; my closest friends have forgotten me.</p><p>&nbsp;</p><p>Even his servants who waited on him when he was active looked at him like a stranger. They hear his call but will attend to him as and when they feel like. He is no longer of use to them. Yes!&nbsp;</p><p>&nbsp;</p><p>Job 19:15&nbsp;</p><p>NIV</p><p>[15] My guests and my female servants count me a foreigner; they look on me as on a stranger.</p><p>&nbsp;</p><p>This is a sad reflection of who we are and how we treat people we once adored but when they age they become despicable to us. No wonder the proverb writer said;</p><p>Proverbs 19:6&nbsp;</p><p>NIV</p><p>[6] Many curry favor with a ruler, and everyone is the friend of one who gives gifts.</p><p>&nbsp;</p><p>Ours is a society/culture of “ use and dump “. You are of benefit to us so long as we can get something from you.&nbsp;</p><p>&nbsp;</p><p>Yes, even today that is called “ Father’s Day” How many of the men who have helped you have you said a word of appreciation to?&nbsp;</p><p>&nbsp;</p><p>How much will it cost you to text a simple well-wishing message? Nothing. But you’ve not done it because they no longer feature in your mind!&nbsp;</p><p>&nbsp;</p><p>Years ago when they were of benefit to you, you were the first to send them messages! Not today. Yes, you “used and dumped them”. They once brought joy and happiness to your life. What a tragedy.&nbsp;</p><p>&nbsp;</p><p>Read it again;&nbsp;</p><p>Job 19</p><p>KJV</p><p>14 My kinsfolk have failed, and my familiar friends have forgotten me.</p><p>15+ They that dwell in mine house, and my maids, count me for a stranger: I am an alien in their sight.</p><p>&nbsp;</p><p>16 I called my servant, and he gave me no answer; I intreated him with my mouth.</p><p>&nbsp;</p><p>A sad reflection of who and what we are to the aged. May God grant us the spirit of discernment to know those who are “fair-weather friends” whose reason and purpose for being around us is to “use and dump” us.&nbsp;</p><p>&nbsp;</p><p>My lamentations!&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-15T16:27:25.901Z",
    "updatedAt": "2025-06-15T16:27:25.901Z",
    "publishedAt": "2025-06-15T16:27:25.888Z",
    "slug": "a-tragedy-an-evil-under-the-sun"
  },
  {
    "id": 208,
    "documentId": "hj8b6ox20befz647h9azdn3c",
    "title": "Trust As An Investment ",
    "text": "<p>&nbsp;</p><p>Trust As An Investment</p><p>Psalms 5</p><p>KJV</p><p>11+ But let all those that put their trust in thee rejoice: let them ever shout for joy, because thou defendest them: let them also that love thy name be joyful in thee.</p><p>&nbsp;</p><p>Trust is an <strong>investment</strong>, therefore be careful whom you invest in. Be a wise investor! Many an investment has gone bad due to poor judgment&nbsp;</p><p>&nbsp;</p><p>Trust is a <strong>currency</strong>, it can appreciate or depreciate therefore value any trust people repose in you. Use it wisely&nbsp;</p><p>&nbsp;</p><p>Trust is a <strong>key</strong> to success and failure. Depending on its value at any given time, it can open or shut doors.&nbsp;</p><p>&nbsp;</p><p>Trust is an investment people make in you they will therefore expect a good return; so do not squander their trust.&nbsp;</p><p>&nbsp;</p><p>Once depreciated, trust is difficult to appreciate no matter how hard you try. Be diligent to maintain its value at an appreciable level at all times.&nbsp;</p><p>&nbsp;</p><p><strong>Trust is not your personal property, it belongs to others. They can withdraw it, close their account with you without notice; so be careful and watchful.</strong></p><p>&nbsp;</p><p>Many have gone bankrupt as a result of squandering both the goodwill and trust invested in them. Let this not happen to you&nbsp;</p><p>&nbsp;</p><p>My few thoughts to share with you&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p>",
    "createdAt": "2025-06-16T08:26:23.410Z",
    "updatedAt": "2025-06-16T08:26:23.410Z",
    "publishedAt": "2025-06-16T08:26:23.397Z",
    "slug": "trust-as-an-investment"
  },
  {
    "id": 209,
    "documentId": "q79kneyk6k0u3a1v8yohsb8u",
    "title": "Try Again: Because You Said So!",
    "text": "<p>Try Again: Because You Said So!</p><blockquote><p>Luke 5</p><p>KJV</p><p>5+ And Simon answering said unto him, Master, we have toiled all the night, and have taken nothing: nevertheless at thy word I will let down the net.</p><p>&nbsp;</p></blockquote><p>On reading this incident two important lessons stood out!&nbsp;</p><p>&nbsp;</p><p>Like many, I have faced challenges that nearly brought me down! I have encountered frustrations and disappointments in life ( and still do!); but the ‘whispers’ of a few placed my feet firmly on the ground.&nbsp;</p><p>&nbsp;</p><p>My story, like yours, is not different from that of Peter, Can you imagine the frustrations and disappointments with which he uttered these words?&nbsp;</p><blockquote><p>Luke 5:5</p><p>NIV</p><p>[5] Simon answered, “Master, we've worked hard all night and haven't caught anything. But because you say so, I will let down the nets.”</p></blockquote><p>&nbsp;</p><p>Experienced as he was in the art of fishing, he caught nothing! Experienced as we may be yet our endeavors/efforts show no sign of progress. But when someone whispered words of hope victory was ours to claim.&nbsp;</p><p>&nbsp;</p><p>Yes, beloved “because you said so “ many a frustrated and a disappointed, can stand on their feet.&nbsp;</p><p>&nbsp;</p><p>Let me be personal here, when I first put pen to paper to write articles, I came under a barrage of ‘attacks’ from some who thought they were my target of writing!&nbsp;</p><p>&nbsp;</p><p>Such were the ‘attacks’ that I almost gave up! I announced that effect at a general meeting! As soon as I took my seat two men stood up to say how beneficial my articles are to them.&nbsp;</p><p>&nbsp;</p><p>It is to these two men that I owe my perseverance in writing over the years. We need friends who will speak to us Words of encouragement. Unfortunately, these are a few apart. On the contrary, it is the opposite that abounds!&nbsp;</p><p>&nbsp;</p><p>Jesus spoke encouraging words to Peter which resulted in success; read it&nbsp;</p><blockquote><p>Luke 5:6&nbsp;</p><p>NIV</p><p>[6] When they had done so, they caught such a large number of fish that their nets began to break.</p></blockquote><p>&nbsp;</p><p>Many potential, gifted etc persons whose contributions be it secular or spiritual that can change the course of history and make life better for many are unable to step out because of the negative, discouraging voices that surround them. The impossibility thinkers!&nbsp;</p><p>&nbsp;</p><p>May we learn to speak words of encouragement to those who are undertaking tasks that will bring hope to us.&nbsp;</p><p>&nbsp;</p><p>The second important lesson Peter’s response and subsequent actions teach us is the need to be <strong>discerning and flexible.&nbsp;</strong></p><p>&nbsp;</p><p>Peter knew who Jesus was so he was willing to act on his directive.&nbsp; Some in his shoes would have turned down His directive. These will say “ We ( experts ) have toiled all night catching nothing; who are you and what do you know about fishing?”</p><p>&nbsp;</p><p>Oh, we hear this said to many today. “Who are you to say this or that ??”I like the word Peter used” <strong>Nevertheless</strong>” Yes, nevertheless, regardless of who or what “ I will give it a try”.&nbsp;</p><p>&nbsp;</p><p>Come to think of it, Jesus did not say anything Peter didn’t know.&nbsp;</p><p>Read it ;</p><blockquote><p>4 Now when he had left speaking, he said unto Simon, Launch out into the deep, and let down your nets for a draught.</p></blockquote><p>&nbsp;</p><p>The context seems to suggest that Peter and his crew had earlier gone on a fishing expedition which resulted in nothing. So they berthed their boats and washed their nets.&nbsp;</p><p>&nbsp;</p><p>Read it ;</p><blockquote><p>Luke 5:2-3&nbsp;</p><p>NIV</p><p>[2] He saw at the water's edge two boats, left there by the fishermen, who were washing their nets.&nbsp;</p><p>&nbsp;</p><p>[3] He got into one of the boats, the one belonging to Simon, and asked him to put out a little from shore. Then he sat down and taught the people from the boat.</p></blockquote><p>&nbsp;</p><p>The earlier expedition brought nothing but disappointment, this explains the reason Peter said what he said. He initially doubted, he is human just like us.&nbsp;</p><p>&nbsp;</p><p>But he quickly discerned and was flexible in thought and decision. Here is where he puts many of us to shame probably including you! &nbsp;</p><p>&nbsp;</p><p><strong>Dear reader be discerning and flexible in life After all you lose nothing by giving a suggestion a trial!</strong></p><p>&nbsp;</p><p><strong>Discernment and flexibility are signs of growth and maturity, whereas fanaticism is a sign of the opposite.&nbsp;</strong></p><p>&nbsp;</p><p>Come to think of it Jesus did not say anything strange or new.&nbsp; Peter knew and understood what he suggested.&nbsp;</p><p>&nbsp;</p><p>Read it ;&nbsp;</p><blockquote><p>Luke 5:4&nbsp;</p><p>NIV</p><p>[4] When he had finished speaking, he said to Simon, “Put out into deep water, and let down the nets for a catch.”</p></blockquote><p>&nbsp;</p><p>“Deep Water Oooh” that was what he suggested to Peter. Something Peter knew from experience but probably overlooked.&nbsp;</p><p>&nbsp;</p><p>How many times have we not been reminded of something we knew but overlooked which is key to our succeeding in an undertaking?&nbsp;</p><p>&nbsp;</p><p>Is this not what is meant by “ Sankofa ?”&nbsp;&nbsp;</p><p>&nbsp;</p><p>These two lessons I learnt from reading this incident which I share with you I hope it helps!&nbsp;</p><p>&nbsp;</p><ol><li>If you have nothing positive to say keep quiet.&nbsp;</li><li>Be discerning and flexible in thought and decisions. You may have the monopoly over some form of knowledge ( speciality ) but certainly not over WISDOM! .&nbsp;</li></ol><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-17T08:56:39.475Z",
    "updatedAt": "2025-06-20T03:34:02.918Z",
    "publishedAt": "2025-06-20T03:34:02.905Z",
    "slug": "try-again-because-you-said-so"
  },
  {
    "id": 210,
    "documentId": "mo4vqcafaaugj04nd00xr8s9",
    "title": "I Want To Know What Love Is! ",
    "text": "<p>I Want To Know What Love Is!</p><blockquote><p>1 Chronicles 11</p><p>KJV</p><p>17 And David longed, and said, Oh that one would give me a drink of the water of the well of Beth–lehem, that is at the gate!</p><p>&nbsp;</p><p>18 And the three brake through the host of the Philistines, and drew water out of the well of Beth–lehem, that was by the gate, and took it, and brought it to David: but David would not drink of it, but poured it out to the Lord,</p></blockquote><p>&nbsp;</p><p>Centuries before Jesus stated the definition of love, many were living it which is proven by the incident recorded in the passage you’ve just read!&nbsp;</p><p><br>To Jesus,</p><blockquote><p>John 15</p><p>KJV</p><p><strong>13</strong><a href=\"#\"><i><strong>+</strong></i></a><strong> </strong>Greater love hath no man than this, that a man lay down his life for his friends.</p><p>&nbsp;</p></blockquote><p>And this is exactly what these men demonstrated!&nbsp;<br>&nbsp;</p><p>Yes, if you want to know what love is, and if you want to know who loves you and if you want to know if it is a greater or a lesser love; then here is how to tell&nbsp;</p><p>&nbsp;</p><p>Oh lest I forget, incidentally the title of this article may sound familiar to some. Yes, it is that of popular secular music!&nbsp;</p><p>&nbsp;</p><p>Yes, everybody wants to know what true love is, for many parade themselves in front of us claiming and shouting from rooftops that they love us. How do we know?&nbsp;</p><p>&nbsp;</p><p>If you were to ask David what love is, this is what he would point to as love! To make a sacrifice and to take a risk for the beloved!&nbsp;</p><p>&nbsp;</p><p><strong>In the above incident, David expressed a wish, but his wish became a command. Yes, when your wish(es) becomes a command to someone and he fulfils it, then it is a demonstration that you are loved by that someone.&nbsp;</strong></p><p>&nbsp;</p><p>Oh, this brings to mind some interesting occasions in our youthful days! When a lady we are dating expresses a wish, say “Oh I wish I could chew a khebab “! Oh, how we quickly translate and understand that wish to be a command! And obey it promptly! Yes!&nbsp;</p><p>&nbsp;</p><p>No matter where, how or at what cost; &nbsp; we would go to any length to get it. Yes!&nbsp; Love takes risks and makes sacrifices. This is what love is!&nbsp;</p><p>&nbsp;</p><p>Let’s visit Joseph and ask him “What is love”? Hear him!&nbsp;</p><blockquote><p>Genesis 50</p><p>KJV</p><p>20+ But as for you, ye thought evil against me; but God meant it unto good, to bring to pass, as it is this day, to save much people alive.</p><p>&nbsp;</p><p>21 Now therefore fear ye not: I will nourish you, and your little ones. And he comforted them, and spake kindly unto them.</p></blockquote><p>&nbsp;</p><p>This was part of what he said to his treacherous, wicked brethren when they came to apologize to him!&nbsp;</p><p>&nbsp;</p><p><strong>Do you want to know what love is? Here is what it is, it forgives when an admission of wrong, confession is made and an apology is rendered. Yes!&nbsp;</strong></p><p>&nbsp;</p><p>It is not as some say “Oh even if none of these is done it does not matter forgive for the sake of your peace of mind! Really? &nbsp;</p><p>&nbsp;</p><p>Listen, there are two types of spoons; a long and a short one Everyone carries them with them through life.&nbsp;</p><p>&nbsp;</p><p>Yes if none of the above is done, you use the long spoon to dine with the offender. You do not stay away from the table, but if they are done you use the shorter!&nbsp;</p><p>&nbsp;</p><p>Take it or leave it even as you read this article you are using either of them to dine with someone just that you don’t know! &nbsp;</p><p>&nbsp;</p><p>Try to understand what this means, it is a coded statement, be wise It is about restoring a broken relationship.&nbsp;</p><p>&nbsp;</p><p>There are many relationships in which the members are dining with each other using long,&nbsp; not short spoons! This is a fact and a reality of life! If you are very discerning and wise you’ll see it.&nbsp;</p><p>&nbsp;</p><p>Beloved, like you I also want to know what love is. Please let us show it to each other by deeds and not words.&nbsp;</p><p>&nbsp;</p><p>A thought to share with you&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-18T09:50:06.045Z",
    "updatedAt": "2025-06-20T03:32:30.871Z",
    "publishedAt": "2025-06-20T03:32:30.851Z",
    "slug": "i-want-to-know-what-love-is"
  },
  {
    "id": 211,
    "documentId": "uu24fwif3yejx16lamjt362w",
    "title": "The Valley Of Decision ",
    "text": "<p>The Valley Of Decision&nbsp;</p><blockquote><p>Joel 3</p><p>KJV</p><p>14+ Multitudes, multitudes in the valley of decision: for the day of the Lord is near in the valley of decision.</p><p>&nbsp;</p></blockquote><p>The words of this scripture featured in one of the songs of the world-acclaimed ‘social philosopher’ Robert Nestor Marley. The Valley Of Decision!&nbsp;</p><p>&nbsp;</p><p>In every man’s life, there comes a moment that demands action—a decisive moment that, if left unattended, can lead to a lifelong disaster!&nbsp;</p><p>&nbsp;</p><p><strong>In the Valley of Decision, we are confronted with questions that have to do with our destiny. Questions that have to do with our spiritual, economic, social etc destinies.&nbsp;</strong></p><p>&nbsp;</p><p>The decisions and choices we make will shape our life’s destinies. What we are today reflects the choices we made in the past.. What we shall be tomorrow is based on what we do or don’t do today</p><p>&nbsp;</p><p>Some choices are irreversible and so are some decisions. Ask any aged person and he /she will confirm this to you. This is because he/she has once walked through the Valley of Decision.&nbsp;</p><p>&nbsp;</p><p>Every step we take in every hour or day forms part of the building blocks we lay for our future. The entire structure of the building will be completed at our old age. It is for this reason that we must weigh carefully the choices we make.&nbsp;</p><p>&nbsp;</p><p>It must be admitted, many of us (including this writer ) have made some irreversible choices, the consequences of which are with us today.&nbsp;</p><p>&nbsp;</p><p>Human as we are we can not escape such mistakes. We just have to accept and live with them till we sleep one night and wake up no more! . Though a difficult and daunting task yet we have no choice but to face it squarely&nbsp; &nbsp;To procrastinate is to postpone what will catch up with us later&nbsp;</p><p>&nbsp;</p><p>Walking through the Valley of Decision in life, beloved requires help. Hear how someone who once walked through this Valley concluded;&nbsp;</p><p>&nbsp;</p><blockquote><p>Psalms 23</p><p>KJV</p><p>4+ Yea, though I walk through the valley of the shadow of death, I will fear no evil: for thou art with me; thy rod and thy staff they comfort me.</p></blockquote><p>&nbsp;</p><p>Rod and staff here indicate, training, guidance and discipline. Read a few ;</p><p>&nbsp;</p><blockquote><p>Job 5</p><p>KJV</p><p><strong>17</strong><i><strong>+</strong></i><strong>&nbsp;</strong>Behold, happy is the man whom God correcteth: therefore despise not thou the chastening of the Almighty:</p></blockquote><p>&nbsp;</p><blockquote><p>Proverbs 3</p><p>KJV</p><p><strong>11</strong><i><strong>+</strong></i><strong>&nbsp;</strong>My son, despise not the chastening of the Lord; neither be weary of his correction:</p><p><strong>12</strong><i><strong>+</strong></i><strong>&nbsp;</strong>For whom the Lord loveth he correcteth; even as a father the son in whom he delighteth.</p></blockquote><p>&nbsp;</p><blockquote><p>Hebrews 12</p><p>KJV</p><p><strong>5</strong><i><strong>+</strong></i><strong>&nbsp;</strong>And ye have forgotten the exhortation which speaketh unto you as unto children, My son, despise not thou the chastening of the Lord, nor faint when thou art rebuked of him:</p><p><strong>6</strong><i><strong>+</strong></i><strong>&nbsp;</strong>For whom the Lord loveth he chasteneth, and scourgeth every son whom he receiveth.</p></blockquote><p>&nbsp;</p><blockquote><p>1 Corinthians 11</p><p>KJV</p><p><strong>32</strong><i><strong>+</strong></i><strong>&nbsp;</strong>But when we are judged, we are chastened of the Lord, that we should not be condemned with the world.</p></blockquote><p>&nbsp;</p><p>He acknowledged and attributed his successful walk through this Valley to God. “I will fear no evil, for thou art with me” he said.&nbsp;</p><p>&nbsp;</p><p>Beloved, it is only with the presence of God in our lives, and the help of the Holy Spirit that we can walk successfully through the Valley of Decision.&nbsp;</p><p>&nbsp;</p><p>The Holy Spirit will illuminate both the eye and the mind guiding and granting us the ability to discern so we make the right decisions and choices. He does these through the Word and promptings! A key feature in the believer’s daily walk with God which unfortunately the majority overlook! .&nbsp;</p><p>&nbsp;</p><p>The Valley of Decision is a valley that some have visited and climbed out of, Make every effort to walk through it successfully!&nbsp;</p><p>&nbsp;</p><p><i><strong>If you ever find yourself in the Valley of Decision do not panic seek help when and where necessary. &nbsp;</strong></i></p><p>&nbsp;</p><p>Thoughts to share&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-19T09:51:09.484Z",
    "updatedAt": "2025-06-20T03:43:24.419Z",
    "publishedAt": "2025-06-20T03:43:24.413Z",
    "slug": "the-valley-of-decision"
  },
  {
    "id": 212,
    "documentId": "yymb3trfaxssbj02jnujl8v7",
    "title": "Self Restraint: An Essential Requirement",
    "text": "<p>Self Restraint: An Essential Requirement&nbsp;</p><blockquote><p>Proverbs 25</p><p>KJV</p><p>28+ He that hath no rule over his own spirit is like a city that is broken down, and without walls.</p><p>&nbsp;</p></blockquote><p>I&nbsp; am not a chef, nor do I have any cooking experience, but anytime I taste a delicious meal I often ask to know the “what” and “how”. The answer I usually get always points to the “ingredients “ used.&nbsp;</p><p>&nbsp;</p><p>I am told by the “experts” that for a meal to pass the test, it must have the right proportions of ingredients.&nbsp;</p><p>&nbsp;</p><p>I found this knowledge relevant and applicable to life. For any life to be called a good life it must have in proportion all virtues. Virtues such as honesty , trustworthiness , politeness , respectfulness etc. Most important of all is “self-restraint”.&nbsp;</p><p>&nbsp;</p><p>As the above scriptures state, “self-restraint” “ self rule “and “self-control” must be part of what it takes to be a good-natured man.&nbsp;</p><p>&nbsp;</p><p>To hold one’s spirit in check no matter what the situation may be, is more to be preferred than anything else.&nbsp;</p><p>&nbsp;</p><p>Read it again&nbsp;</p><blockquote><p>Proverbs 16</p><p>KJV</p><p>32+ He that is slow to anger is better than the mighty; and he that ruleth his spirit than he that taketh a city.</p></blockquote><p>&nbsp;</p><p>It does not take much to take a city but it takes much to rule one’s spirit. To take a city is an external warfare but to rule one’s spirit is internal which is the toughest. This explains why not many can rule their spirits!&nbsp;</p><p>&nbsp;</p><p>To be unable to rule one’s spirit is simply to be lacking in character, unprincipled, because <strong>character is the anchor that holds a person in check amid human storms!</strong></p><p>&nbsp;</p><p>You may have been at some meetings where there were outbursts, tempers flaring and the atmosphere was thick and tense. This is because someone failed to ‘rule his spirit’!&nbsp;</p><p>&nbsp;</p><p>To be around people who have mastered the art of self-restraint is a joy and a delight, Conversations and discussions are conducted in a low tone! &nbsp;Anything said no matter how unpleasant does not provoke outbursts, silence is maintained! Each at the meeting has learned to swallow his pride!&nbsp;</p><p>&nbsp;</p><p>Take note, when two people standing close to each other speak (shout) to each other in a high tone then know that they are out of sync. They’ve both failed to rule their spirits.&nbsp;</p><p>&nbsp;</p><p>So, how do we self-restrain (rule) our spirits? It begins with self-respect which is then extended to others.&nbsp;</p><p>&nbsp;</p><p>The next is acceptance; to accept that all men are not the same in terms of thought and practice; there will always be differences. Make room for divergent views and opinions, speak/express yours respectfully and politely.&nbsp;</p><p>&nbsp;</p><p>Not everyone knows what you know, In life some are above you, while others are below in many respects. So factor this into your dealings with people. Learn from the one above you, and teach the one below you.&nbsp;</p><p>&nbsp;</p><p>Learn to agree, and or disagree, know what is essential and what is not.&nbsp; In essentials stand firm on nonessential give way to liberty!&nbsp;</p><p>&nbsp;</p><p>Walk away from anyone who is lacking in character and is unprincipled! Avoid the “noisy”, these are vexations to the spirit&nbsp;</p><p>&nbsp;</p><p>Always remember, in the midst of the unwise, it would be foolhardy to be wise. As a proverb says so “ save your breath to cool your porridge “.&nbsp;</p><p>&nbsp;</p><p>Always remember this;&nbsp;</p><blockquote><p>Proverbs 9:8-9&nbsp;</p><p>NIV</p><p>[8] Do not rebuke mockers or they will hate you; rebuke the wise and they will love you. [9] Instruct the wise and they will be wiser still; teach the righteous and they will add to their learning.</p></blockquote><p>&nbsp;</p><p>Above all, exercise maximum self-control by putting a heavy padlock on your lips among provocateurs. Be deliberate and conscious.&nbsp;</p><p>&nbsp;</p><p>Finally, be patient towards all;&nbsp;</p><blockquote><p>Ecclesiastes 7</p><p>KJV</p><p><strong>8</strong><i><strong>+</strong></i><strong>&nbsp;</strong>Better is the end of a thing than the beginning thereof: and the patient in spirit is better than the proud in spirit.</p><p><strong>9</strong><i><strong>+</strong></i><strong>&nbsp;</strong>Be not hasty in thy spirit to be angry: for anger resteth in the bosom of fools.</p></blockquote><p>&nbsp;</p><p>Thoughts to share&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-20T08:39:38.411Z",
    "updatedAt": "2025-06-20T20:22:02.888Z",
    "publishedAt": "2025-06-20T20:22:02.880Z",
    "slug": "self-restraint-an-essential-requirement"
  },
  {
    "id": 213,
    "documentId": "kplr9ugxq0fnolxjflywwng6",
    "title": "A Spiritual Accident Report: A Must-Read",
    "text": "<p>A Spiritual Accident Report: A Must-Read</p><p>(Please this is a satirical article, think deeply to understand it!)&nbsp;</p><p>&nbsp;</p><blockquote><p>John 8</p><p>KJV</p><p>44+ Ye are of your father the devil, and the lusts of your father ye will do. He was a murderer from the beginning, and abode not in the truth, because there is no truth in him. When he speaketh a lie, he speaketh of his own: for he is a liar, and the father of it.</p></blockquote><p>&nbsp;</p><p>A young man with high-flying credentials many believed was destined to succeed was reported dead suddenly through a “spiritual road traffic accident”&nbsp;</p><p>&nbsp;</p><p>Such was the shock to many that the “spiritual police” launched as usual a “ spiritual investigation”, the “Spiritual&nbsp; Report” they filed was shocking.&nbsp;</p><p>Read it.&nbsp;</p><p>&nbsp;</p><p>The Report stated among others that two “spiritual men “ were responsible for his death (bringing him down); they had planned to cause his death as he was brilliant, creative, and innovative at the workplace as a result he was loved and admired by many&nbsp;</p><p>&nbsp;</p><p>He was a shining star and the company took great delight in him.&nbsp;</p><p>&nbsp;</p><p>The two were arrested and during interrogation, they initially denied their involvement; unfortunately for them, their <strong>names gave them away.&nbsp;</strong></p><p>&nbsp;</p><p><strong>And guess what, their spiritual names were Mr. Envy and Mr.Jealousy.&nbsp;</strong></p><p>&nbsp;</p><p>(Be careful what name you take be it your real name or a nickname. It will one day give you away).&nbsp;</p><p>&nbsp;</p><p>The children and grandchildren of Mr. Envy and Mr. Jealousy are still alive and kicking. Is this not what Jesus meant when he said?&nbsp;</p><p>&nbsp;</p><blockquote><p>John 8:44</p><p>NIV</p><p>[44] You belong to your father, the devil, and you want to carry out your father's desires. He was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies.</p></blockquote><p>&nbsp;</p><p>Indeed by their deeds, you shall know them. These two men (Messrs Envy and Jealousy) should be feared as they’ve wrecked the life and future of many a person destined for greatness. They operate clandestinely, in most instances unknown to their victims. They act as lovers!&nbsp;</p><p>&nbsp;</p><p>Please do not forget, it was one of them ( My Envy) who killed Jesus. Pilate the trial judge saw him inciting the people but failed to cause his arrest. He influenced the people to reject Jesus&nbsp;</p><p>&nbsp;</p><p>Read it;&nbsp;</p><blockquote><p>Matthew 27</p><p>KJV</p><p>17 Therefore when they were gathered together, Pilate said unto them, Whom will ye that I release unto you? Barabbas, or Jesus which is called Christ?</p><p>18+ <strong>For he knew that for envy they had delivered him.</strong></p></blockquote><p>&nbsp;</p><p>On other occasions read what Mr. Envy did to Paul and a few others!&nbsp;</p><blockquote><p>Acts 17</p><p>KJV</p><p>5+ But the Jews which believed not, moved with envy, took unto them certain lewd fellows of the baser sort, and gathered a company, and set all the city on an uproar, and assaulted the house of Jason, and sought to bring them out to the people.</p></blockquote><p>&nbsp;</p><blockquote><p>Acts 13</p><p>KJV</p><p>50+ But the Jews stirred up the devout and honourable women, and the chief men of the city, and raised persecution against Paul and Barnabas, and <strong>expelled them out of their coasts.</strong></p></blockquote><p>&nbsp;</p><blockquote><p>Acts 13</p><p>KJV</p><p>45+ But when the Jews saw the multitudes, they were <strong>filled with envy, a</strong>nd spake against those things which were spoken by Paul, contradicting and blaspheming.</p></blockquote><p>&nbsp;</p><p>At a competition held by Satan to select the most dangerous and wicked spirit he could deploy easily to destroy progressive men; it was Mr. Envy who won there was no challenger!&nbsp;</p><p>&nbsp;</p><p>Read it&nbsp;</p><blockquote><p>Proverbs 27</p><p>KJV</p><p>4+ Wrath is cruel, and anger is outrageous; but who can stand before envy?</p></blockquote><p>&nbsp;</p><p>That is the Result of the Contest as published, Wrath and Anger could not match Envy. Wrath and Anger are limited by time, but not Envy. He has a supercharged battery that makes him stay longer in the hearts and minds of those he takes captive.&nbsp;</p><p>&nbsp;</p><p>Satan once conferred on Mr. Envy the Order of Hell; ( OOH) Subtle Destructive &nbsp;Division; which is the highest on&nbsp; Satan’s Honours List.&nbsp;</p><p>&nbsp;</p><p>My dear, fear Mr Envy, and his children; &nbsp;envious people. If they can kill Jesus then who and what are you to them? You will never know how powerful and active they are until you fall into their grip. Perhaps you have heard many talk about them and thought it was just a story or an exaggeration! It isn’t!&nbsp;</p><p>&nbsp;</p><p>Here are some tips the “Spiritual Police” gave to the “Spiritual Public” after investigating the cause of death of this young and upcoming star:-&nbsp;</p><p>&nbsp;</p><p>Tips</p><ol><li>Remain strong and steadfast in spirit, do not waver</li><li>&nbsp;</li><li>Post /paste on your walls these writings “ no shaking, no surrender, no retreat “. “If God be for us, who can be against us” &nbsp; No weapon”&nbsp;</li></ol><p>&nbsp;</p><p>A very interesting read, the Report of the police investigation into the death of an aspiring, rising star; it could be you. Therefore watch your ways carefully wherever you find yourself, be it in secular or divine settings.&nbsp;</p><p>&nbsp;</p><p>A word to the wise is hidden in the above satire you’ve read.&nbsp;🤣</p><p>&nbsp;</p><p>John Franklin Tamakloe</p>",
    "createdAt": "2025-06-20T09:32:43.066Z",
    "updatedAt": "2025-06-20T20:23:01.701Z",
    "publishedAt": "2025-06-20T20:23:01.695Z",
    "slug": "a-spiritual-accident-report-a-must-read"
  },
  {
    "id": 214,
    "documentId": "v4zgpxakitwe2nrihcvrs8ys",
    "title": "The Hidden Reward:A Testimony",
    "text": "<p>The Hidden Reward: A Testimony.&nbsp;</p><blockquote><p>Galatians 6</p><p>KJV</p><p>7+ Be not deceived; God is not mocked: for whatsoever a man soweth, that shall he also reap.</p></blockquote><p>&nbsp;</p><blockquote><p>Proverbs 21</p><p>KJV</p><p>21+ He that followeth after righteousness and mercy findeth life, righteousness, and honour.</p></blockquote><p>&nbsp;</p><p>The two scriptures above are statements, confirmations, and recommendations; they are also universal spiritual and physical laws!&nbsp;</p><p>&nbsp;</p><p>Sowing and reaping is common knowledge to everyone hence no need to belabor it. What is often not highlighted is the fact that not every sowing is deliberate, some are done unknowingly&nbsp;</p><p>&nbsp;</p><p>This aspect of sowing was brought home to me when I received a blessing from someone who said he was a recipient/beneficiary of a “seed” I sowed. &nbsp;</p><p>&nbsp;</p><p>This “stranger” tried to remind me of the “when”, “where” and “how” this “seed” was sown but I could not remember! He confirmed that yes, I was not aware of what I was doing at the time!&nbsp;</p><p>&nbsp;</p><p>This brought to mind two other scriptures ;</p><blockquote><p>Ecclesiastes 11</p><p>KJV</p><p>1+ Cast thy bread upon the waters: for thou shalt find it after many days.</p></blockquote><p>&nbsp;</p><p>The other, the parable of the Sower;&nbsp;</p><blockquote><p>Luke 8</p><p>KJV</p><p>5+ A sower went out to sow his seed: and as he sowed, some fell by the way side; and it was trodden down, and the fowls of the air devoured it.</p></blockquote><p>&nbsp;</p><p>Beloved there are many a seed we’ve sown unintentionally the results of which we shall reap at the appropriate time. Be they good or bad!</p><p>&nbsp;</p><p>While thinking through this encounter the following scripture also came to mind ;&nbsp;</p><blockquote><p>Galatians 6</p><p>KJV</p><p>9+ And let us not be weary in well doing: for in due season we shall reap, if we faint not.</p></blockquote><p>&nbsp;</p><p>God loving /fearing people will give back to us what we give out consciously or otherwise! Some in pursuit of a cause they believed to be just not to seek recognition ended up being recognised.&nbsp;</p><p>&nbsp;</p><p>Take the case of the ongoing activities of the group known as the “Bus Stop Boys”. Their pursuit of keeping drainages open and clean has won them national recognition&nbsp;</p><p>&nbsp;</p><p>This also confirms what the writer of the Proverbs letter said ;&nbsp;</p><blockquote><p>Proverbs 21</p><p>KJV</p><p>21+ He that followeth after righteousness and mercy findeth life, righteousness, and honour.</p></blockquote><p>&nbsp;</p><p>That we get what we deserve as a result of what we do is a true observation in life.</p><p>&nbsp;</p><p>Follow the path of evil and you’ll get evil paid back to you. In the same way as following the path of righteousness, you’ll get righteousness credited in return.&nbsp;</p><p>&nbsp;</p><p>The question then is which path are we walking, and where is it leading to? Pause for a moment to think over this.&nbsp;</p><p>&nbsp;</p><p>Here are a few “ follow afters” that are worth considering ;</p><blockquote><p>Romans 14</p><p>KJV</p><p>19+ Let us therefore follow after the things which make for peace, and things wherewith one may edify another.</p></blockquote><p>&nbsp;</p><blockquote><p>Psalms 34</p><p>KJV</p><p>14+ Depart from evil, and do good; seek peace, and pursue it.</p></blockquote><p>&nbsp;</p><blockquote><p>Hebrews 12</p><p>KJV</p><p>14+ Follow peace with all men, and holiness, without which no man shall see the Lord:</p></blockquote><p>&nbsp;</p><p>Whatever we sow, knowingly or unknowingly (good or bad) we shall receive payments.&nbsp;</p><p>&nbsp;</p><p>A testimony to share&nbsp;&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-21T09:01:34.754Z",
    "updatedAt": "2025-06-21T12:58:53.941Z",
    "publishedAt": "2025-06-21T12:58:53.935Z",
    "slug": "the-hidden-rewarda-testimony"
  },
  {
    "id": 215,
    "documentId": "df52cdlqhix5b3a135d5q2lj",
    "title": "Yet A Little While",
    "text": "<p>Yet A Little While</p><blockquote><p>Psalms 37</p><p>KJV</p><p>10+ For yet a little while, and the wicked shall not be: yea, thou shalt diligently consider his place, and it shall not be.</p></blockquote><p>&nbsp;</p><p>There is no permanency in life, everything is in transition This reminds me of inscriptions we read embossed on some trotro wooden vehicles that were the public means of transportation in Accra in the sixties and seventies</p><p>&nbsp;</p><p>One such inscription reads “ Friends today, enemies tomorrow’”. As a primary school pupil, these writings served as reading exercises as we learn to read. There were many such inscriptions; as they were the fashion of the time, owners used their vehicles to express their thoughts, feelings and sentiments.&nbsp;</p><p>&nbsp;</p><p>But truly speaking nothing is permanent in life not even relationships. Some we forget as we move on in life and our associations change; others we break as goals, interests, values and aspirations change. The worst of which is when a friend becomes an enemy.&nbsp;</p><p>&nbsp;</p><p>It is important to note that what unites us as friends is our shared interests, goals, values, principles etc Whenever there is a shift or change in any of these we part company. This definition of friendship is what the prophet Amos gave&nbsp;</p><blockquote><p>Amos 3</p><p>KJV</p><p>3 Can two walk together, except they be agreed?</p></blockquote><p>&nbsp;</p><p>Though this can be heartbreaking and a source of worry, we take consolation in what Solomon once said regarding the non-permanency of everything. Hence to be forewarned is to be forearmed; read it ;&nbsp;</p><p>&nbsp;</p><blockquote><p>Ecclesiastes 3:8&nbsp;</p><p>NIV</p><p>[8] a time to love and a time to hate, a time for war and a time for peace.</p></blockquote><p>&nbsp;</p><p>All that is needed is for one to be prepared for any such situation, this way one can move on in life. Who you call a friend today can become your enemy tomorrow. Remain true and be committed to what is right!&nbsp;</p><p>&nbsp;</p><p>Yes, yet a little while it shall come to pass. A word to the wise is enough!&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-21T10:37:48.242Z",
    "updatedAt": "2025-06-21T12:57:52.047Z",
    "publishedAt": "2025-06-21T12:57:52.022Z",
    "slug": "yet-a-little-while"
  },
  {
    "id": 216,
    "documentId": "ghs0oqjxorxd9hih0wzmmeci",
    "title": "While We Wait",
    "text": "<p>While We Wait&nbsp;</p><p><br>While we wait,&nbsp;<br>Can be Moments; &nbsp;<br>Full of Anxiety<br>But still, &nbsp;We Must &nbsp; Wait</p><p>&nbsp;</p><p>While we wait&nbsp;<br>Can be moments&nbsp;<br>Of joy, as we anticipate;<br>But still, we must wait</p><p>&nbsp;</p><p>While we wait,<br>Fear and uncertainty;&nbsp;<br>Paints a gloomy picture&nbsp;<br>But still, we must wait</p><p>&nbsp;</p><p>While we wait&nbsp;<br>Self-examination,&nbsp;<br>Must be a constant activity&nbsp;<br>But still, we must wait</p><p>&nbsp;</p><p>While we wait&nbsp;<br>Let’s repair all,<br>Damages we have caused;<br>But still, we must wait &nbsp;</p><p>&nbsp;</p><p>While we wait&nbsp;<br>Each day counts ;<br>Be wise and discerning&nbsp;<br>But still, we must wait</p><p>&nbsp;</p><p>While we wait&nbsp;<br>We know not when;&nbsp;<br>The trumpet shall sound,<br>But still, we must wait</p><p>&nbsp;</p><p>While we wait, &nbsp;<br>Ask, have I&nbsp;<br>Wounded Any Soul?;<br>But still, we must wait</p><p>&nbsp;</p><p>While we wait<br>May Love, Peace&nbsp;<br>Brotherly Kindness; &nbsp;<br>Bind us Together</p><p>&nbsp;</p><p>(A Dedicated Word Of Caution, Hope etc. to All Saints )</p><p>&nbsp;</p><p>John Franklin Tamakloe</p>",
    "createdAt": "2025-06-21T13:39:47.046Z",
    "updatedAt": "2025-06-21T13:39:47.046Z",
    "publishedAt": "2025-06-21T13:39:47.039Z",
    "slug": "while-we-wait"
  },
  {
    "id": 217,
    "documentId": "wqslu8z7j83um85ouvd04oa1",
    "title": "Destination: Which Way Are You Heading? ",
    "text": "<p>Destination: Which Way Are You Heading?</p><blockquote><p>John 14:4-6&nbsp;</p><p>NIV</p><p>[4] You know the way to the place where I am going.”&nbsp;</p><p>&nbsp;</p><p>[5] Thomas said to him, “Lord, we don't know where you are going, so how can we know the way?”&nbsp;</p><p>&nbsp;</p><p>[6] Jesus answered, “I am the way and the truth and the life. No one comes to the Father except through me.</p></blockquote><p>&nbsp;</p><p>I remember when I first arrived in Headington, Oxford I stayed on campus for a few days without going to the city centre though I needed a few items for use The reason was simple, I didn’t know how to get around! I felt shy to ask for help.&nbsp;</p><p>&nbsp;</p><p>There was no Google Maps at the time. It had not yet been invented or created.&nbsp;</p><p>&nbsp;</p><p>After a day or two when life was getting rough due to my lacking these basic items, I decided to go out on my own. And guess what I got lost. I struggled to find my way back to campus.&nbsp;</p><p>&nbsp;</p><p>During the first weeks when lectures began, I made friends with some African students, fortunately, some lived in England so they knew their way around places.&nbsp;</p><p>&nbsp;</p><p>The first thing they suggested to me was to buy a guidebook. Interestingly there are guidebooks covering the entire country, mainly focused on streets. If you are in Oxford there is one solely for use there.&nbsp;</p><p>&nbsp;</p><p>Oh, they also made me know that I can approach any Policeman I meet and ask for directions. Something I did when I visited London! Though some helped, others confused me the more!&nbsp;</p><p>&nbsp;</p><p>Thankfully I bought a copy which settled my fear of getting lost in town! I bought those of other county’s I visited during my stay&nbsp;</p><p>&nbsp;</p><p>To know one’s destination especially how to get there is very important in life.&nbsp;</p><p>&nbsp;</p><p>The same applies to Christianity, Jesus once told his disciples “You know the way to the place where I am going.”! He didn’t land when one ( Thomas) raised his hands to say Massa (sic) “&nbsp;</p><p>Lord, we don't know where you are going, so how can we know the way?”&nbsp;</p><p>&nbsp;</p><p>Did you notice? He said they don’t know the “ where “ and the “ how”. A destination is made up of two things the place and the how to get there.&nbsp;</p><p>&nbsp;</p><p>I guess you’ve heard said “ if you don’t know where you are going any direction to take will lead you there “&nbsp;</p><p>&nbsp;</p><p>It is one thing to know the place and another to know how to get there! We know a place by hearing others tell us of it. This is a theoretical approach, which creates in us a desire to visit the place.&nbsp;</p><p>&nbsp;</p><p>We know Heaven through the stories and descriptions the scriptures provide! Read the book of Revelation and some of the things Jesus said about the place in the Gospels.&nbsp;</p><p>&nbsp;</p><p>Critical to the issue is how to get there. Here is where mankind is divided. Though everyone would love to be there, sadly only a few will make it. Why? Because they are not paying attention to the map!&nbsp;</p><p>&nbsp;</p><p>It was to avoid this that Jesus explicitly said “I am the way and the truth and the life. No one comes to the Father except through me.”</p><p>&nbsp;</p><p>I rest my case. Want to go to Heaven? Here is the answer to the question “How do I get there ?” The Guide Book is the Scriptures, consult it regularly as you travel the way.&nbsp;</p><p>&nbsp;</p><p>There may be junctions or bypasses etc make sure you don’t miss them. Most importantly always keep your eyes on the road!&nbsp;</p><p>&nbsp;</p><p>A thought to share&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-22T08:49:05.584Z",
    "updatedAt": "2025-06-23T04:31:52.941Z",
    "publishedAt": "2025-06-23T04:31:52.931Z",
    "slug": "destination-which-way-are-you-heading"
  },
  {
    "id": 218,
    "documentId": "pydswaxm2gvtiut9k4lf843v",
    "title": "How Long? ",
    "text": "<p>How Long Are We Going To Be Here?&nbsp;</p><blockquote><p>James 4</p><p>KJV</p><p>14+ Whereas ye know not what shall be on the morrow. For what is your life? It is even a vapour, that appeareth for a little time, and then vanisheth away.</p></blockquote><p>&nbsp;</p><p>How long are you going to be here is a question no one can answer! Many have tried but to no avail. Even medical practitioners have told some that they will leave within a few months but this has turned into years.&nbsp;</p><p>&nbsp;</p><p>The transient and impermanent nature of our stay is what James described as a “ vapour” A vapour is a mist, it rises and within seconds vanishes into thin air. Life if compared to a flower, it grows, blossoms, gives out fragrance and thereafter withers! Who knows at which stage of this plant you are at this moment in life?</p><p>&nbsp;</p><p>Compared to the grass here is what Peter said about life;&nbsp;</p><blockquote><p>1 Peter 1</p><p>KJV</p><p>24+ For all flesh is as grass, and all the glory of man as the flower of grass. The grass withereth, and the flower thereof falleth away:</p></blockquote><p>&nbsp;</p><p>Our beauty, handsomeness, glory, fame, popularity etc will fade with time!&nbsp;</p><p>&nbsp;</p><p>When Isaiah was told “ Cry” and he asked what he was to say read what he was told;&nbsp;</p><blockquote><p>Isaiah 40</p><p>KJV</p><p>6+ The voice said, Cry. And he said, What shall I cry? All flesh is grass, and all the goodliness thereof is as the flower of the field:</p><p>7 The grass withereth, the flower fadeth: because the spirit of the Lord bloweth upon it: surely the people is grass.</p></blockquote><p>&nbsp;</p><p>The psalmist also added his voice;&nbsp;</p><blockquote><p>Psalms 103</p><p>KJV</p><p>15+ As for man, his days are as grass: as a flower of the field, so he flourisheth.</p><p>&nbsp;</p><p>16+ For the wind passeth over it, and it is gone; and the place thereof shall know it no more.</p></blockquote><p>&nbsp;</p><p>Scriptures record a conversation between Peter and Jesus. Peter tried to ask this very question though he didn’t put it directly; a careful reading of the conversation between him and Jesus indicates that was his intended question&nbsp;</p><p>&nbsp;</p><p>Read it;&nbsp;</p><blockquote><p>John 21:20-23&nbsp;</p><p>NIV</p><p>[20] Peter turned and saw that the disciple whom Jesus loved was following them. (This was the one who had leaned back against Jesus at the supper and had said, “Lord, who is going to betray you?”)</p><p>&nbsp;</p><p>[21] When Peter saw him, he asked, “Lord, what about him?”</p><p>[22] Jesus answered, “If I want him to remain alive until I return, what is that to you? You must follow me.”</p><p>&nbsp;</p><p>[23] Because of this, the rumor spread among the believers that this disciple would not die. But Jesus did not say that he would not die; he only said, “If I want him to remain alive until I return, what is that to you?”</p></blockquote><p>&nbsp;</p><p>So, yes the duration of our stay here is unknown as is testified to by the variations in ages we see on the funeral posters/banners of those who have been recalled! The obituary notifications.&nbsp;</p><p>&nbsp;</p><p>This being the case beloved, let us make the most out of what time we are allotted! It is true none can initiate and complete whatever he/she desire; but initiate something anyway.&nbsp;</p><p>&nbsp;</p><p>It is true you can not please or make everybody happy, but let a few feel happy and enjoy their time with you! This is how they will remember you.&nbsp;</p><p>&nbsp;</p><p>Impact a life for good and not evil! Let whatever duration you stay/spend here be meaningful! For we are here today, gone tomorrow! Do not lose sight of this, factor it into everything you do.&nbsp;</p><p>&nbsp;</p><p>My thoughts to share&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-24T09:33:40.066Z",
    "updatedAt": "2025-06-24T09:41:34.126Z",
    "publishedAt": "2025-06-24T09:41:34.118Z",
    "slug": "how-long"
  },
  {
    "id": 219,
    "documentId": "h60gorolg7mygano1k2ca13g",
    "title": "The Beauty Of Life",
    "text": "<p>The Beauty Of Life!</p><p>The Beauty of Life&nbsp;<br>Is to wake up<br>Feeling &nbsp;Well and Sound&nbsp;<br>This is the Beauty Of Life</p><p>&nbsp;</p><p>The Beauty Of Life&nbsp;<br>Is to accept yourself&nbsp;<br>And be who you are, regardless&nbsp;<br>This is the Beauty Of life</p><p>&nbsp;</p><p>The Beauty Of Life<br>Is to &nbsp;love and be loved&nbsp;</p><p>And appreciated &nbsp;;&nbsp;<br>This is the Beauty Of life</p><p>&nbsp;</p><p>The Beauty of Life&nbsp;<br>Is to have and enjoy<br>The &nbsp;company of genuine friends&nbsp;<br>This is the Beauty Of Life</p><p>&nbsp;</p><p>The Beauty Of Life&nbsp;<br>Is to live and enjoy each&nbsp;<br>Day as if it is your last&nbsp;<br>This is the Beauty Of Life.</p><p>&nbsp;</p><p>The Beauty of Life&nbsp;<br>Is not about what they’ll say&nbsp;<br>But what God says ;&nbsp;<br>This is the Beauty Of life</p><p>&nbsp;</p><p>The Beauty of Life&nbsp;<br>Is to ensure You Owe no man Nothing,&nbsp;</p><p>Except the debt of love<br>This is the Beauty Of life</p><p>&nbsp;</p><p>Now all has been Heard;</p><p>Here is the conclusion of the matter:&nbsp;</p><p>Fear God and Keep his Commandments,</p><p>&nbsp;For this is the Duty of all Mankind.</p><p><br>John Franklin Tamakloe</p>",
    "createdAt": "2025-06-24T14:06:21.710Z",
    "updatedAt": "2025-06-24T14:06:21.710Z",
    "publishedAt": "2025-06-24T14:06:21.691Z",
    "slug": "the-beauty-of-life"
  },
  {
    "id": 220,
    "documentId": "ykdfd172b3bnwx02ua8xvvd3",
    "title": "A Confession Of Note ",
    "text": "<p>A Confession Of Note: Identifying With The Psalmist&nbsp;</p><p>Psalms 38</p><p>KJV</p><p>4+ For mine iniquities are gone over mine head: as an heavy burden they are too heavy for me. 5 My wounds stink and are corrupt because of my foolishness.</p><p>&nbsp;</p><p>6 I am troubled; I am bowed down greatly; I go mourning all the day long. 11 My lovers and my friends stand aloof from my sore; and my kinsmen stand afar off.</p><p>&nbsp;</p><p>12+ They also that seek after my life lay snares for me: and they that seek my hurt speak mischievous things, and imagine deceits all the day long.</p><p>&nbsp;</p><p>The above are the outpourings of the psalmist, confessing his waywardness and the calamities that befell Him.&nbsp;</p><p>&nbsp;</p><p>The entire psalm must be read as to appreciate and feel the desperate nature of a burdened heart &nbsp;Like the psalmist, we all must admit that the ills that befall us are basically due to our “ foolishness “. Read what he said;</p><p>&nbsp;</p><p>“My wounds stink and are corrupt because of my foolishness.”&nbsp;</p><p>&nbsp;</p><p>To be foolish is to be unwise, not taking heed or paying attention to details. To take/make decisions based on assumptions. Or to give credit to someone who does not deserve it; only to regret later. To abuse a privilege granted or an honour bestowed.&nbsp;</p><p>&nbsp;</p><p>Beloved this is what has plunged many of us into holes that are so deep that we can not come out without suffering bruises!. Yes, the price we pay for being unwise and undiscerning!&nbsp;</p><p>&nbsp;</p><p>Nothing hurts the most when those you thought would provide you with a cover stand aloof. Read the case of the psalmist ;</p><p>Psalm 38:11&nbsp;</p><p>NIV</p><p>[11] My friends and companions avoid me because of my wounds; my neighbors stay far away.</p><p>&nbsp;</p><p>As if this is all, others will put as it were “ salt into the wound “. (sic) Read it;&nbsp;</p><p>Psalm 38:12,19-20</p><p>NIV</p><p>[12] Those who want to kill me set their traps, those who would harm me talk of my ruin; all day long they scheme and lie.&nbsp;</p><p>&nbsp;</p><p>[19] Many have become my enemies without cause ; those who hate me without reason are numerous.&nbsp;</p><p>[20] Those who repay my good with evil lodge accusations against me, though I seek only to do what is good.</p><p>&nbsp;</p><p>Yes, “though I seek only to do what is good !” Can you identify with any of these? Yes, surely you can! Well, you are not alone The psalmist of old experienced what you are going through today.&nbsp;</p><p>&nbsp;</p><p>Take courage for these are temporal trials, soon it will be over. Remain steadfast by holding on and trusting in God. This was exactly what the psalmist did!&nbsp;</p><p>Psalm 38:21-22</p><p>NIV</p><p>[21] Lord, do not forsake me; do not be far from me, my God. [22] Come quickly to help me, my Lord and my Savior.</p><p>&nbsp;</p><p>Say to yourself “ whatever will be should be, may God’s will be done”&nbsp; Like Jesus, pray “</p><p>Matthew 26:42</p><p>NIV</p><p>[42] He went away a second time and prayed, “My <strong>Father, if it is not possible for this cup to be taken away unless I drink it, may your will be done.”</strong></p><p>&nbsp;</p><p>Indeed, May His Will Be Done!.&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-26T08:55:05.145Z",
    "updatedAt": "2025-06-26T08:55:05.145Z",
    "publishedAt": "2025-06-26T08:55:05.127Z",
    "slug": "a-confession-of-note"
  },
  {
    "id": 221,
    "documentId": "kl302o84eggqqkhjis0e35e8",
    "title": "Keeping The Saved Safe",
    "text": "<p>Keeping The Saved Safe: Why I Write.</p><p>1 Peter 2</p><p>KJV</p><p>2+ As newborn babes, desire the sincere milk of the word, that ye may grow thereby:</p><p>&nbsp;</p><p>There is diversity of service in the Ministry a fact often acknowledged but less understood! All these services are interlinked, with the end goal being the salvation of a soul.</p><p>&nbsp;</p><p>Reread what the Holy Spirit said to the church through&nbsp; the Apostle Paul ;</p><p>1 Corinthians 12:4-6&nbsp;</p><p>NIV</p><p>[4] There are different kinds of gifts, but the same Spirit distributes them. [5] There are different kinds of service, but the same Lord. [6] There are different kinds of working, but in all of them and in everyone it is the same God at work.</p><p>&nbsp;</p><p>As stated earlier the end goal of these services (gifts) is summed up by the Holy Spirit In these words ;&nbsp;</p><p>1 Corinthians 12:7&nbsp;</p><p>NIV</p><p>[7] Now to each one the manifestation of the Spirit is given for the common good.</p><p>&nbsp;</p><p>Did you read “ the common good “? They were meant to be used in a way that benefits everybody.&nbsp;</p><p>&nbsp;</p><p>Ephesians 4:12&nbsp;</p><p>NIV</p><p>[12] to equip his people for works of service, so that the body of Christ may be built up</p><p>&nbsp;</p><p>They were therefore not given to provoke envy, jealousy or rivalry in the church; but to help build the Body of Christ.&nbsp;</p><p>&nbsp;</p><p>Now to the point of this writeup, some have asked why I don’t devote the time and platform to teaching “ doctrine”? By which they mean subjects such as “ baptism, weekly observance of the Lord’s Supper, giving, a cappella (unaccompanied) singing etc!&nbsp;</p><p>&nbsp;</p><p>Good and relevant as these are, my target audience is not unbelievers but believers. My writings are meant to keep the saved safe. To mature them in the faith by living/leading lives that reflect their profession as believers. &nbsp;</p><p>&nbsp;</p><p>My writings are inspired by the following scriptures ;&nbsp;</p><p>Matthew 28</p><p>KJV</p><p>20+ Teaching them to observe all things whatsoever I have commanded you:&nbsp;</p><p>&nbsp;</p><p>1 Peter 2:2 NIV</p><p>[2] Like newborn babies, crave pure spiritual milk, so that by it you may grow up in your salvation,</p><p>&nbsp;</p><p>Hebrews 6</p><p>KJV</p><p>1+ Therefore leaving the principles of the doctrine of Christ, let us go on unto perfection;&nbsp;</p><p>&nbsp;</p><p>These and several other scriptures suggest that the saved must be kept safe, they will not be kept safe by repeatedly teaching the very same subjects that they believed and were brought into Christ. Baptism by immersion. Weekly Lord’s Supper etc.&nbsp;</p><p>&nbsp;</p><p>There are the “milk, &nbsp;“bones, meat” subjects which suggest the need for a progressive growth and development of every believer. &nbsp;</p><p>&nbsp;</p><p>The continuous emphasis and teaching of these elementary subjects (post-baptism) have resulted in a lack of growth ( maturity ); evidence of which we encounter every day among us.&nbsp;</p><p>&nbsp;</p><p>The Hebrew writer encountered a similar situation hence he wrote;&nbsp;</p><p>Hebrews 5</p><p>KJV</p><p>12+ For when for the time ye ought to be teachers, ye have need that one teach you again which be the first principles of the oracles of God; and are become such as have need of milk, and not of strong meat.</p><p>&nbsp;</p><p>Is this not a true reflection of how many look? Read how he described some of us;&nbsp;</p><p>13 For every one that useth milk is unskilful in the word of righteousness: for he is a babe.</p><p>&nbsp;</p><p>Oh, what a sad description! Could this be you? Read how he concluded ;&nbsp;</p><p>14 But strong meat belongeth to them that are of full age, even those who by reason of use have their senses exercised to discern both good and evil.</p><p>&nbsp;</p><p>Grow your faith, that is what He means!&nbsp;</p><p>&nbsp;</p><p>So, my writings are meant to turn “spiritual children” into “spiritual adults”! It does not come to me as a surprise when some don’t read them because they are content with being “spiritual infants” in Christ. A condition that manifests itself in how they behave and conduct themselves in the Assembly even though they have been in Christ for a long time!.&nbsp;</p><p>&nbsp;</p><p>If you are wondering or asking why I don’t write about baptism, the Lord’s Supper, etc it is because some are teaching them. These are foundational settings, after which I lay blocks of “Christian character” to complete the spiritual building!&nbsp;</p><p>&nbsp;</p><p>Those who teach such subjects and I are working together. We are both collaborating to build the church of God. Without them I can not lay the blocks of Christlike character which my writings are meant to be.&nbsp;</p><p>&nbsp;</p><p>This also explains why I am not into “ controversies “ but rather what will build a believer in word and deed. Lifestyle. I have defined my target audience, the post-baptized believer.&nbsp;</p><p>&nbsp;</p><p>I do not write to answer “ what must I do to be saved ?” I write to answer “What must I do to remain saved ?” &nbsp;</p><p>&nbsp;</p><p>My answer to any who wish to know why I write what I write!&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-27T10:43:23.818Z",
    "updatedAt": "2025-06-27T10:43:23.818Z",
    "publishedAt": "2025-06-27T10:43:23.785Z",
    "slug": "keeping-the-saved-safe"
  },
  {
    "id": 222,
    "documentId": "oobap80x02mxho21az2uoght",
    "title": "At The Pleasure Of God",
    "text": "<p>At The Pleasure Of God</p><p>Romans 14</p><p>KJV</p><p>8+ For whether we live, we live unto the Lord; and whether we die, we die unto the Lord: whether we live therefore, or die, we are the Lord's.</p><p>&nbsp;</p><p>Having lived through different political administrative dispensations spanning seven decades one certain thing, among several others is the transitional nature of holding a political office.&nbsp;</p><p>&nbsp;</p><p>There is no permanency in political appointments. Every appointee holds his/her office at the pleasure of the president or the appointing authority.&nbsp;</p><p>&nbsp;</p><p>You may have heard it said, “ the president appoints and dis-appoints”. Indeed contrary to what some may think or believe. No condition is permanent, positions are not possessions! Everyone serves at the pleasure of somebody&nbsp;</p><p>&nbsp;</p><p>Beloved, the same applies to our walk and work with God, He alone “appoints and dis-appoints”. We live and serve at His pleasure. He “ ordains and dis-ordains”! None can query or fight Him over his “appointment and or dis-appointment “</p><p>&nbsp;</p><p>Read again what Paul said ;</p><p>Romans 14:8&nbsp;</p><p>NIV</p><p>[8] If we live, we live for the Lord; and if we die, we die for the Lord. So, whether we live or die, we belong to the Lord.</p><p>&nbsp;</p><p>We are His to use as He wishes, He made us to serve His purposes on Earth. So wherever you find yourself be it “pleasant or unpleasant” understand that you are there or in that situation because He wants to use YOU!</p><p>&nbsp;</p><p>Jesus once found himself in a “worrying” situation, Read what he said;&nbsp;</p><p>John 12:27&nbsp;</p><p>NIV</p><p>[27] “Now my soul is troubled, and what shall I say? 'Father, save me from this hour'? No, it was for this very reason I came to this hour.</p><p>&nbsp;</p><p>Did you read that “ it was for this very reason I came to this hour!”. Take note and be guided by this example!&nbsp;</p><p>&nbsp;</p><p>Events that occur in the lives of the children of God are meant to serve a divine purpose. The difficulty we have is recognizing and knowing in advance that it is God’s will.&nbsp;</p><p>&nbsp;</p><p>This may be difficult to accept by many but history and experience show how true this statement is. How many times, and at what point have you not quoted what Paul wrote regarding things that happen to us?&nbsp;</p><p>Romans 8</p><p>KJV</p><p>28+ And we know that all things work together for good to them that love God, to them who are the called according to his purpose.</p><p>&nbsp;</p><p>“And we know “ at what time did we know; is it not after we have complained? Yes.&nbsp;</p><p>Beloved, whatever purpose(s) for which God called you will work well for you in the end.</p><p>&nbsp;</p><p>If He takes you through “fire/heat “He will have His Hand on the thermostat, to regulate it. Is this not what He meant when He spoke through Isaiah; &nbsp;Read it,</p><p>Isaiah 43</p><p>KJV</p><p>2+ When thou passest through the waters, I will be with thee; and through the rivers, they shall not overflow thee: when thou walkest through the fire, thou shalt not be burned; neither shall the flame kindle upon thee.</p><p>&nbsp;</p><p>We are unable to accept these assurances and live with them because of two things, fear and anxiety. Admittedly we are human, none is exempt! (Not even this writer !) Ours is to wait patiently which again is a difficult thing to do!&nbsp;</p><p>&nbsp;</p><p>Patience is required! To walk and serve God beloved patience is required. If we do not have patience we can not serve or walk with Him This writer learnt this the hard way ( and continues to learn) and can testify that it is true.&nbsp;</p><p>&nbsp;</p><p>Be honest, have you not ever said in private “Why is God slow in doing this or that for me?”&nbsp; Yes! To be patient is to wait and waiting for the majority is a challenge!&nbsp;</p><p>&nbsp;</p><p>Finally, how do we learn patience?&nbsp;</p><p>&nbsp;</p><p>We do this by acknowledging that we are weak, do not know it all, can not do it on our own we need help, and this help will come from someone who will act when he has time for us. &nbsp;</p><p>&nbsp;</p><p>Whether that someone will attend to us immediately or later, we don’t know it all depends on their time and not ours.&nbsp;</p><p>&nbsp;</p><p>Through experience, we have all been treated like this before. I have asked for help from some who acted on my request at the time they wished, even as I write some have but even said a word! Nor did they show any sign of attending to a request for help! I can not force or compel them. Mine is to wait and this is patience, painful as it may be!&nbsp;</p><p>&nbsp;</p><p>Beloved, if we can wait patiently for humans to attend to our needs, then we can do the same with God. The difference is, though men may disappoint, He doesn’t! &nbsp;</p><p>&nbsp;</p><p>Let us learn to resign our wills to Him. Yes, whether we live or die, we are His. We live and serve at His pleasure! He alone “ appoints, and or dis-appoints” To Him we owe everything!.&nbsp;</p><p>&nbsp;</p><p>Owû mûô, nkwa muô Nipè ènÿè hô!&nbsp;</p><p>&nbsp;</p><p>Thoughts to share&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-28T08:48:45.069Z",
    "updatedAt": "2025-06-28T08:48:45.069Z",
    "publishedAt": "2025-06-28T08:48:45.055Z",
    "slug": "at-the-pleasure-of-god"
  },
  {
    "id": 223,
    "documentId": "bfv66axbywjxf6508i7tymb2",
    "title": "Partnering For Success",
    "text": "<p>Partnering For Success</p><p>Exodus 17</p><p>KJV</p><p>11+ And it came to pass, when Moses held up his hand, that Israel prevailed: and when he let down his hand, Amalek prevailed.</p><p>&nbsp;</p><p>It is undeniable that no one can single-handedly win any battle, a truth demonstrated by the record of how Israel won its battle against Amalek.&nbsp;</p><p>&nbsp;</p><p>Fierce was the battle, strong were the enemies that it became necessary that an unconventional tactic has to be deployed. A tactic that involved three Moses, Aaron and Hur.&nbsp;</p><p>&nbsp;</p><p>The initial arrangement was that Moses was to stand on top of a hill to be visible to the Israeli forces under the command of Joshua. He was to carry with him the rod of office&nbsp;</p><p>&nbsp;</p><p>Read it ;</p><p>Exodus 17:9&nbsp;</p><p>NIV</p><p>[9] Moses said to Joshua, “Choose some of our men and go out to fight the Amalekites. Tomorrow I will stand on top of the hill with the staff of God in my hands.”</p><p>&nbsp;</p><p>[10] So Joshua fought the Amalekites as Moses had ordered, and Moses, Aaron and Hur went to the top of the hill.</p><p>&nbsp;</p><p>And so it was when Israel engaged the Amalekites, however, a strange phenomenon was observed as the battle went on; whenever Moses lowered his hands the Amalekites broke through the Israelite defence and killed many</p><p>&nbsp;</p><p>Read it;</p><p>Exodus 17:11&nbsp;</p><p>NIV</p><p>[11] As long as Moses held up his hands, the Israelites were winning, but whenever he lowered his hands, the Amalekites were winning.</p><p>&nbsp;</p><p>Moses, human as he is got tired of standing and holding high his hands and so the two men Aaron and Hur came to his assistance by first finding him a huge stone on which he sat and then holding his hands high in place.&nbsp;</p><p>&nbsp;</p><p>Read it ;</p><p>Exodus 17:12</p><p>NIV</p><p>[12] When Moses' hands grew tired, they took a stone and put it under him and he sat on it. Aaron and Hur held their hands up---one on one side, one on the other---so that his hands remained steady till sunset.</p><p>&nbsp;</p><p>Oh, what a lesson! Oh how we miss this to our loss&nbsp;</p><p>&nbsp;</p><p>No one has it all. No one knows it all. No one can do it all. Success is teamwork. Success comes through collaboration. Success comes when we unite our forces, talents etc each contributing their quota.&nbsp;</p><p>&nbsp;</p><p>Let us look at the role each played in winning the battle.&nbsp;&nbsp;</p><p>&nbsp;</p><p>First God, though not mentioned yet He featured prominently in the success of Israel&nbsp;</p><p>&nbsp;</p><p>It was He who ordained and empowered Moses. The rod/staff in Moses’ Hand was the sign of God’s presence with him and His authority which he wielded.&nbsp;</p><p>&nbsp;</p><p>Second is Moses, as the leader he must be visible hence his position on top of the hill. For a team to be successful its leader must be visible at all times. A leader must inspire and encourage those he leads. This Moses did that day. He provided what is called today Inspirational leadership&nbsp;</p><p>&nbsp;</p><p>Then thirdly, Aaron and Hur, these were subordinates, it was they who mooted the idea to get Moses seated comfortably. And also supported him by holding his two arms high in place so Israel could see and advance in the battle.&nbsp;</p><p>&nbsp;</p><p>“They took a stone and put it under him and he sat on it. Aaron and Hur held his hands up---one on one side, one on the other---so that his hands remained steady till sunset.”</p><p>&nbsp;</p><p>There was no rivalry. There was no undermining, Aaron and Hur knew where they belonged. Aaron was an orator as we know from the pre-exodus account.&nbsp;</p><p>&nbsp;</p><p>He was the spokesperson when they appeared before the pharaoh. But he never used this endowment to challenge or undermine the authority of Moses, instead, he collaborated with him.&nbsp;</p><p>&nbsp;</p><p>Hur, we know very little about him but from the accounts, he was one of the trusted aides to Moses At one point placed Israel under his care along with Aaron during his absence. Read it&nbsp;</p><p>&nbsp;</p><p>Exodus 24</p><p>KJV</p><p>14+ And he said unto the elders, Tarry ye here for us, until we come again unto you: and, behold, Aaron and Hur are with you: if any man have any matters to do, let him come unto them.</p><p>&nbsp;</p><p>He was a confidant of Moses and played this subordinate role with distinction. Can you as a confidant and an aide be trusted as Hur was?&nbsp;</p><p>&nbsp;</p><p>To succeed in any endeavor there is a need for partnership. We must partner with one another to uplift the work of God. For this to become a reality we must recognize and know our place in the scheme of things.&nbsp;</p><p>&nbsp;</p><p>The spirit of rivalry, competition, etc must never be part of the project. Pride and bloated egos must be buried.&nbsp;</p><p>&nbsp;</p><p>Just like Israel, we shall win if those who lead us will cooperate, collaborate etc with each other.&nbsp;</p><p>&nbsp;</p><p>We must also accept that in every human assembly, there must be a leader of leaders. “Primus inter pares” meaning “ first among equals “ &nbsp; It is from this Latin word that we got the term “Prime Minister” &nbsp; Failure to accept this arrangement is a recipe for failure&nbsp;</p><p>&nbsp;</p><p>Aaron and Hur recognized this which led to the success of Israel! &nbsp;</p><p>&nbsp;</p><p>A thought to share! &nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-29T09:46:23.231Z",
    "updatedAt": "2025-06-29T09:46:23.231Z",
    "publishedAt": "2025-06-29T09:46:23.218Z",
    "slug": "partnering-for-success"
  },
  {
    "id": 224,
    "documentId": "fsjhnbfg8qe5r50awt2h0fqu",
    "title": "Contradictions : How To Resolve Them",
    "text": "<p>&nbsp;</p><p>&nbsp;</p><p>Seemingly Biblical Contradictions: How To Resolve Them. &nbsp;</p><p>Luke 23</p><p>KJV</p><p>46+ And when Jesus had cried with a loud voice, he said, Father, into thy hands I commend my spirit: and having said thus, he gave up the ghost.</p><p>&nbsp;</p><p>Matthew 27</p><p>KJV</p><p>50+ Jesus, when he had cried again with a loud voice, yielded up the ghost.</p><p>&nbsp;</p><p>John 19</p><p>KJV</p><p>30+ When Jesus therefore had received the vinegar, he said, It is finished: and he bowed his head, and gave up the ghost.</p><p>&nbsp;</p><p>A few weeks ago my attention was drawn to a claim to the effect that the above-cited verses are contradictions!&nbsp;</p><p>&nbsp;</p><p>Some “unfriendly” readers of the Gospels have drawn attention to the writings of Mathew, Luke and John to make the case that all three writers put out different accounts of the same event.&nbsp;</p><p>&nbsp;</p><p>According to them each of the three writers gave accounts which seem to be at variance and this has “ worried “ them!&nbsp;</p><p>&nbsp;</p><p>There is nothing wrong with what each wrote, to know exactly what was said by Jesus one has to piece together what the three wrote.&nbsp;</p><p>&nbsp;</p><p>Here we go.&nbsp;</p><p>In Mathew’s account Jesus “ cried again with a loud voice, yielded up the ghost.”&nbsp; He did not state what was said ( content) in that “cry”&nbsp;</p><p>&nbsp;</p><p>To Mathew, Jesus cried, saying something which he did not state.&nbsp;</p><p>&nbsp;</p><p>In Luke, he cried with a loud voice, and said, “Father, into thy hands I commend my spirit”: and having said thus, he gave up the ghost.”&nbsp;</p><p>&nbsp;</p><p>Luke told us what was said in that “cry”.&nbsp;</p><p>&nbsp;</p><p>Finally, John also recorded, when he “ had received the vinegar, he said, It is finished: and he bowed his head, and gave up the ghost.”</p><p>&nbsp;</p><p>So John reveals another thing that was said by Jesus!&nbsp;</p><p>&nbsp;</p><p>Both Mathew and Luke wrote “ he cried “. John wrote “ he said “ all of them admit that something was said.&nbsp;</p><p>&nbsp;</p><p>To know precisely what Jesus said we have to put all three accounts together; and this is how it reads “ It is finished: Father, into thy hands I commend my spirit”:</p><p>&nbsp;</p><p>Remember, all agreed that He gave up the ghost, but before doing so He said something!&nbsp;</p><p>&nbsp;</p><p>The purpose of this write-up is to throw light on what some termed a contradiction and to show how such thoughts are resolved.&nbsp;</p><p>&nbsp;</p><p>Many see these “missing links” in the account of the three writers as contradictions, when in fact they are not. Scriptures can not contradict themselves it is the untrained reader who sees it like that.&nbsp;</p><p>&nbsp;</p><p>The example has always been given by referring to newspaper reporters A, B and C sent by different news organizations to cover an accident or an event.&nbsp;</p><p>&nbsp;</p><p>Each presented what he saw, and they will all report the same but they may differ in a few areas&nbsp; &nbsp;This is because each reporter may have in addition to what he saw interviewed some bystanders!&nbsp;</p><p>&nbsp;</p><p>In a scenario like this, no one can fault any of the reporters because they published different stories of the same event.&nbsp;</p><p>&nbsp;</p><p>The similarities in their report show what was obvious to everyone. The dissimilarities are a result of the interviews they had with different bystanders.&nbsp;</p><p>&nbsp;</p><p>The rule is, to know what precisely took place one must put together the three reports published by the reporters. Similar to what you’ve just fine with the three Gospels&nbsp;</p><p>&nbsp;</p><p>Dear reader anytime you come across what may look to you as a “ contradiction” here is what is recommended that you do.&nbsp;</p><p>&nbsp;</p><p>First, approach the issue with an open mind. Banish all biases, preconceived thoughts, conclusions or notions from your mind.&nbsp;</p><p>&nbsp;</p><p>Secondly, credit the Author of the Scriptures, in this case, God (Holy Spirit)! Who can not make a mistake&nbsp; &nbsp;He is all-knowing</p><p>&nbsp;</p><p>Thirdly, look for verses, passages etc that contain similar thoughts; assemble all just as we’ve done above. Piece them together&nbsp;</p><p>&nbsp;</p><p>Lastly, seek help from historical documents that have something to do with the subject matter under discussion We call these “extra-biblical “ materials.&nbsp;</p><p>&nbsp;</p><p>Here is how we resolve what may appear to readers as biblical contradictions when in fact they aren’t.&nbsp;</p><p>&nbsp;</p><p>I hope this helps in knowing how to handle the seemingly contradictory verses in the scriptures&nbsp;</p><p>&nbsp;</p><p>John Franklin Tamakloe&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-29T18:34:07.270Z",
    "updatedAt": "2025-06-29T18:34:07.270Z",
    "publishedAt": "2025-06-29T18:34:07.240Z",
    "slug": "contradictions-how-to-resolve-them"
  },
  {
    "id": 225,
    "documentId": "ffhe6uhur626zatjxhw0rni6",
    "title": "Becoming What We See",
    "text": "<p>Becoming What We See: A Christlike Template</p><p>2 Corinthians 3</p><p>KJV</p><p>18+ But we all, with open face beholding as in a glass the glory of the Lord, are changed into the same image from glory to glory, even as by the Spirit of the Lord.</p><p>&nbsp;</p><p>Scripture confirms that we eventually become images of what we often see. Several examples abound in life as we see look-alikes. We also see these in professions, homes, and even in churches.&nbsp;</p><p>&nbsp;</p><p>We become who we follow, as we step in, and walk in their footsteps consciously or unconsciously. I remember receiving a WhatsApp message from a relative telling me about someone she met who speaks and acts like me, and wanted to know if the person has been associated with me.</p><p>&nbsp;</p><p>The above scriptures make a similar case for believers as they behold the glory of God! As we read, hear, and meditate daily on the Word of God we experience transformations; we are changed to look like Him in character! We end up exhibiting godly character.</p><p>&nbsp;</p><p>We become Christlike in word and deed as we stay closer to Him through His Word. His words influence our thoughts which translates into deeds. Remember, to walk with Jesus is simply to walk /live by what He taught.&nbsp;</p><p>&nbsp;</p><p>This is how observers will know if we are truly His followers.&nbsp;</p><p><br>Beloved how close we are to the Word is seen through how we do things! How we love, how we live, what fellowship we enjoy, what causes we support, what truths we uphold, where our loyalty lies etc.&nbsp;</p><p>&nbsp;</p><p>A question that should engage our thoughts is, as men watch us what conclusions will they arrive at? Do we look like Him in love? Do we look like Him by how we relate to each other? Etc.&nbsp;</p><p>&nbsp;</p><p>It is these that should engage our attention the most, as we make our claim to the world that we are His followers.&nbsp;</p><p>&nbsp;</p><p>Yes, Paul was right when he wrote;&nbsp;</p><p>2 Corinthians 3:18</p><p>NIV</p><p>[18] And we all, who with unveiled faces contemplate the Lord's glory, are being transformed into his image with ever-increasing glory, which comes from the Lord, who is the Spirit.</p><p>&nbsp;</p><p>May our Christlike lives be a template for others to emulate. May the Holy Spirit empower us as we strive every day to look like Jesus!&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-30T08:55:08.045Z",
    "updatedAt": "2025-06-30T08:55:08.045Z",
    "publishedAt": "2025-06-30T08:55:08.031Z",
    "slug": "becoming-what-we-see"
  },
  {
    "id": 226,
    "documentId": "tks81iis43gnc7pyhiyuy6w3",
    "title": "The Purge",
    "text": "<p>The Purge That Awaits Us: A Reminder</p><p>Matthew 13</p><p>KJV</p><p>41 The Son of man shall send forth his angels, and they shall gather out of his kingdom all things that offend, and them which do iniquity;</p><p>42+ And shall cast them into a furnace of fire: there shall be wailing and gnashing of teeth.</p><p>&nbsp;</p><p>In a recent conversation with some friends, a casual mention was made of death and dying; quickly the speaker was ‘cautioned’ and made to stop alluding to such scenarios in conversations.&nbsp;</p><p>&nbsp;</p><p>When he asked to know why, he was told such topics “ spoil” conversations! In other words, there are some subject matters no one would like to hear mentioned or talked about in the open.&nbsp;</p><p>&nbsp;</p><p>One of those topics I later discovered is where we shall find ourselves as professing believers when we pass away.&nbsp;</p><p>&nbsp;</p><p>As is known and believed everybody wants to be in Heaven just for the fact that he/she is a member of the church. Which is true and desirable, however, what is not mentioned is the fact that before entering Heaven there will be a purge.&nbsp;</p><p>&nbsp;</p><p>It is this “ purging” that Jesus was referring to in the above passage. Read it again&nbsp;</p><p>. “The Son of man shall send forth his angels, and they shall gather out of his kingdom all things that offend, and them which do iniquity;”&nbsp;</p><p>&nbsp;</p><p>Please note that the “ kingdom “ of Christ mentioned there is the Church of Christ! The church is Christ’s Kingdom! So there will be a purging which is to be carried out by His angels.&nbsp;</p><p>&nbsp;</p><p>All readers of the Bible know what Peter said concerning this very purging;&nbsp;</p><p>Read it</p><p>1 Peter 4</p><p>KJV</p><p>17+ For the time is come that judgment must begin at the house of God: and if it first begin at us, what shall the end be of them that obey not the gospel of God?</p><p>18 And if the righteous scarcely be saved, where shall the ungodly and the sinner appear?</p><p>&nbsp;</p><p>( Notice the three categories mentioned righteous, ungodly and sinner Everyone on earth belongs to one of these categories. Two can be found in the church, the righteous and ungodly.) &nbsp;</p><p>&nbsp;</p><p>A purge can be likened to a police swoop undertaken in a community to arrest weed (wee) smokers. In the process, everyone gets arrested whether guilty or not.</p><p>&nbsp;</p><p>Thereafter screening is done and the users are identified and arrested while the innocent are set free. This is what is implied in the scriptures above.&nbsp;</p><p>&nbsp;</p><p>Comparisons exist from reading the OT. A similar purging was ordered by God. in the days of Ezekiel&nbsp;</p><p>Read it ;</p><p>Ezekiel 9</p><p>KJV</p><p>4 And the Lord said unto him, Go through the midst of the city, through the midst of Jerusalem, and set a mark upon the foreheads of the men that sigh and that cry for all the abominations that be done in the midst thereof.</p><p>&nbsp;</p><p>6+ Slay utterly old and young, both maids, and little children, and women: but come not near any man upon whom is the mark; and begin at my sanctuary. Then they began at the ancient men which were before the house.</p><p>&nbsp;</p><p>Beloved it is not a matter of church attendance, donations, etc these are good; it is about godly living and exhibiting godly character!&nbsp;</p><p>&nbsp;</p><p>Of what use is it if I give to the poor, but am a liar, a wicked etc person, What is the difference between me and the unbeliever? The unbeliever also gives to the poor and tells lies and is wicked.&nbsp;</p><p>&nbsp;</p><p>There will be a purging so let us examine our lives and ways always lest we be taken out. Read the warning John gave us;&nbsp;</p><p>2 John 1</p><p>KJV</p><p>8 Look to yourselves, that we lose not those things which we have wrought, but that we receive a full reward.</p><p>&nbsp;</p><p>2 John 1:8&nbsp;</p><p>NIV</p><p>[8] Watch out that you do not lose what we have worked for, but that you may be rewarded fully.</p><p>&nbsp;</p><p>May the Lord bless us with an understanding heart and mind.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-06-30T10:55:47.386Z",
    "updatedAt": "2025-06-30T10:55:47.386Z",
    "publishedAt": "2025-06-30T10:55:47.381Z",
    "slug": "the-purge"
  },
  {
    "id": 227,
    "documentId": "kzhg079vyc6fve9weh5icvxn",
    "title": "All Too Soon!",
    "text": "<p>All Too Soon</p><p><br>All too soon&nbsp;<br>We have come to the&nbsp;<br>Middle of the Journey&nbsp;<br>A journey we began&nbsp;<br>With uncertainty and fear</p><p>&nbsp;</p><p>All too soon<br>We have crossed&nbsp;<br>Rivers that nearly drown And&nbsp;<br>Fires that nearly&nbsp;<br>Burnt Us, But for Thy Grace</p><p>&nbsp;</p><p>All too soon<br>We stand at the&nbsp;<br>Midpoint of Time&nbsp;<br>The past is gone<br>The future beckons&nbsp;<br>What will it be?</p><p>&nbsp;</p><p>All too soon&nbsp;<br>We are saying<br>Goodbye to a Time<br>That will Never&nbsp;<br>Appear Again</p><p>&nbsp;</p><p>All too soon&nbsp;<br>We are setting&nbsp;<br>Foot into Another<br>Time frame, What&nbsp;<br>It Holds for Us is Unknown!</p><p>&nbsp;</p><p>Peace we seek, and<br>Peace we pray For,<br>Father of Peace,&nbsp;<br>Grant therefore&nbsp;<br>This our Request</p><p>&nbsp;</p><p>In Jesus’ Name</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-07-01T07:29:49.771Z",
    "updatedAt": "2025-07-01T07:29:49.771Z",
    "publishedAt": "2025-07-01T07:29:49.753Z",
    "slug": "all-too-soon"
  },
  {
    "id": 228,
    "documentId": "q1vmmz5ighg6ixl1mbvcltve",
    "title": "Moments ",
    "text": "<p>&nbsp;</p><p>Moments</p><p>Moments are Instant&nbsp;</p><p>They don’t last long&nbsp;</p><p>Therefore seize them</p><p>&nbsp;</p><p>Moments are Instant&nbsp;</p><p>Like Vapour, They</p><p>Rise and soon Disappears&nbsp;</p><p>&nbsp;</p><p>Moments are Instant</p><p>Therefore enjoy them,&nbsp;</p><p>For they Never repeat themselves!&nbsp;&nbsp;</p><p>&nbsp;</p><p>Moments are Instant</p><p>Therefore capture&nbsp;</p><p>And store, to re-live them!&nbsp;</p><p>&nbsp;</p><p>Moments are Instant&nbsp;</p><p>They possess Healing&nbsp;</p><p>Powers therefore Cherish them&nbsp;</p><p>You’ll need them along life’s journey!&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-07-01T08:08:23.759Z",
    "updatedAt": "2025-07-01T08:08:23.759Z",
    "publishedAt": "2025-07-01T08:08:23.747Z",
    "slug": "moments"
  },
  {
    "id": 229,
    "documentId": "yq4syfulginn5u148pdfp0ui",
    "title": "The Beauty Of Friendship : A Discovery",
    "text": "<p>The Beauty Of Friendship: A Discovery. &nbsp;</p><p>2 John 1</p><p>KJV</p><p>12+ Having many things to write unto you, I would not write with paper and ink: but I trust to come unto you, and speak face to face, that our joy may be full.</p><p>&nbsp;</p><p>(The elder unto the elect lady and her children, a family )&nbsp;</p><p>&nbsp;</p><p>3 John 1</p><p>KJV</p><p>13+ I had many things to write, but I will not with ink and pen write unto thee:</p><p>14 But I trust I shall shortly see thee, and we shall speak face to face. Peace be to thee. Our friends salute thee. Greet the friends by name.</p><p>(To Gaius )&nbsp;</p><p>&nbsp;</p><p>I took a few minutes to read through the two letters (2nd/3rd) of the Apostle John and found something of human interest, friendship; which I share with you&nbsp;</p><p>&nbsp;</p><p>Like all of us, the Apostle John enjoyed the company of friends! These two letters, as indicated in their introductory and closing remarks, were written to two of his friends. One was a lady and her family, the other a gentleman named Gaius!&nbsp;</p><p>&nbsp;</p><p>He has been corresponding with them through what we may call today a WhatsApp chat; but it got to a point where he felt it was necessary to visit them so they can sit, chat, eat and laugh!&nbsp;</p><p>&nbsp;</p><p>What a thought! What a decision!</p><p>&nbsp;</p><p>Beloved, has it ever occurred to you to visit the friend(s) you’ve only been chatting with over the years. ? At least to enjoy a “face-to-face “ fellowship? To recall the good old days, the school days, the village adventures, tell tolis etc! Just a look into each other's eyes is enough, a handshake and an embrace /hug mean a lot!&nbsp;</p><p>&nbsp;</p><p>The Apostle John was human just like any of us. He longed for a personal touch instead of the impersonal ( texts messages, forwarding, forwarding, phone calls)!&nbsp;</p><p>&nbsp;</p><p>I was touched by what I observed about the Apostle and began thinking of how I can put this into practice. That was when your thought came to mind that I should visit you! We've been chatting through WhatsApp only!&nbsp;</p><p>&nbsp;</p><p>If only we can visit each other occasionally instead of the WhatsApp chats what a joy and happy moments we shall experience. We shall be revived not only emotionally but also spiritually!&nbsp;&nbsp;</p><p>&nbsp;</p><p>Presently everyone is “busy” with something that is impersonal ( work) which brings no joy except money, and money can not buy genuine love or friendship which also explains why though we have the money we have no genuine friends!&nbsp;</p><p>&nbsp;</p><p>(At least this is how I see it I may be wrong!)&nbsp;</p><p>&nbsp;</p><p>The Apostle John took time off writing (work) to visit, eat, chat and laugh with friends; so please expect my visit very soon!&nbsp;</p><p>&nbsp;</p><p>If you believe that the Apostle John took the right steps then do the same! Take time off your busy schedules and visit a friend (a genuine one) and enjoy each other’s company for at least two hours!&nbsp;</p><p>&nbsp;</p><p>This is what I took away after rereading the Apostle John’s letters! Very Interesting!&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-07-04T09:30:13.334Z",
    "updatedAt": "2025-07-04T11:05:27.051Z",
    "publishedAt": "2025-07-04T11:05:27.030Z",
    "slug": "the-beauty-of-friendship-a-discovery"
  },
  {
    "id": 230,
    "documentId": "w1t45iyu7tqxbw9lqs8za55b",
    "title": "Jesus And Social Life",
    "text": "<p>Did &nbsp;Jesus Have A Social Life?&nbsp;</p><p>Matthew 11:19 NIV</p><p>[19] The Son of Man came eating and drinking, and they say, 'Here is a glutton and a drunkard, a friend of tax collectors and sinners.' But wisdom is proved right by her deeds.”</p><p>&nbsp;</p><p>This was an answer to a complaint or condemnation that the jews brought against Jesus. It was like He was saying “whatever you do people will talk about you. “ &nbsp; Let us put this in context by reading the preceding verses ;&nbsp;</p><p>&nbsp;</p><p>Matthew 11:16-19&nbsp;</p><p>NIV</p><p>\"To what can I compare this generation? They are like children sitting in the marketplaces and calling out to others: [17] \"'We played the pipe for you, and you did not dance; we sang a dirge, and you did not mourn.'</p><p>&nbsp;</p><p>[18] For John came neither eating nor drinking, and they say, 'He has a demon.' [19] The Son of Man came eating and drinking, and they say, 'Here is a glutton and a drunkard, a friend of tax collectors and sinners.' But wisdom is proved right by her deeds.\"</p><p>&nbsp;</p><p>Whatever you want to call it the above gives us a bird’s eye view into the social life of Jesus. That Jesus led a low-key life is undisputed. He walked with and lived among the despised, rejected, looked-down-upon members of society as confirmed by what was said concerning him.&nbsp;</p><p>&nbsp;</p><p>The Jewish bourgeoisie found His association with the lowly unacceptable! They felt he was debasing the status and lowering the class, image, esteem etc that religious leaders are held. He was a disgrace to religious leadership!&nbsp;</p><p>&nbsp;</p><p>Read this ;</p><p>Luke 15</p><p>KJV</p><p>1+ Then drew near unto him all the publicans and sinners for to hear him.</p><p>2+ And the Pharisees and scribes murmured, saying, This man receiveth sinners, and eateth with them.</p><p>&nbsp;</p><p>They even queried and questioned his disciples about this. Read it;</p><p>Mark 2</p><p>KJV</p><p>16+ And when the scribes and Pharisees saw him eat with publicans and sinners, they said unto his disciples, How is it that he eateth and drinketh with publicans and sinners?</p><p>&nbsp;</p><p>Unknown to them Jesus overheard what they were saying to his disciples and turned round to answer them. Read it;</p><p>&nbsp;</p><p>17 When Jesus heard it, he saith unto them, They that are whole have no need of the physician, but they that are sick: I came not to call the righteous, but sinners to repentance.</p><p>&nbsp;</p><p>He said in today’s language “ I came not to call the holier than thou’s!&nbsp;</p><p>&nbsp;</p><p>Truly if He were to be with us today He would love to eat at the chop bars and not restaurants let alone at Kempiski! He would love to take for breakfast koko and massa, instead of baked beans, fried eggs and toasted bread!&nbsp;</p><p>&nbsp;</p><p>I am not by any means saying these are bad please, (I do enjoy the same from time to time resource permitting )because He attended parties, ate at the home of some well-to-do members of society &nbsp; These were exceptions and not the rule.&nbsp;</p><p>&nbsp;</p><p>So yes, Jesus had a social life. He attended Jewish social gatherings such as weddings where songs are sung, people dance, celebrity singers, comedians etc are invited to perform!&nbsp;</p><p>&nbsp;</p><p>(Look for and read if you can &nbsp;“Sketches Of Jewish Social Life In The Days Of Christ by Alfred Edersheim)&nbsp;</p><p>&nbsp;</p><p>Today some believers have no social life simply because it is seen and regarded as evil and satanic. To sit at a table at a wedding party with someone unknown or who does not attend his fellowship is a sin.&nbsp;</p><p>&nbsp;</p><p>To play and listen to a song by Tracy Chapman ( Words don’t come easily ) Boney M ( by the rivers of Babylon) James Brown ( Say It Loud) Wilson Pickett (Midnight Hour) Percy Sledge ( Take time to know her) all these are sinful&nbsp;</p><p>&nbsp;</p><p>To go out with loved ones to eat banku and tilapia at a kenkey joint, to go to the gym and exercise (or at home) with a secular song in the background to help the step-by-step movements during the exercise and make the practice pleasant is evil.</p><p>&nbsp;</p><p>It must always be “ Jerusalem My Happy Home, Blest Be The Tie ( meanwhile the tie that binds is a curse and questionable!)! Yes, these are beneficial and have a place but are the spiritual, not the social life. Many have mistaken the spiritual for the social.&nbsp;</p><p>&nbsp;</p><p>Man must have both the spiritual and the social not leaving out the economic life. We go to work ( economic) we attend church ( the spiritual) we must also sit, eat,&nbsp; chat,&nbsp; laugh etc ( Social)&nbsp;</p><p>&nbsp;</p><p>From the scriptures, it is evident that Jesus had a social life. Do you have a social life?&nbsp;</p><p>&nbsp;</p><p>My thoughts.&nbsp;</p>",
    "createdAt": "2025-07-04T11:12:15.276Z",
    "updatedAt": "2025-07-04T11:12:15.276Z",
    "publishedAt": "2025-07-04T11:12:15.270Z",
    "slug": "jesus-and-social-life"
  },
  {
    "id": 231,
    "documentId": "jqfc5iuuso7cxznq2wy0qwrn",
    "title": "Load Shedding: A Christian Perspective ",
    "text": "<p>Load Shedding: A Christian Perspective&nbsp;</p><p>Galatians 6</p><p>KJV</p><p>2+ Bear ye one another's burdens, and so fulfil the law of Christ.</p><p>&nbsp;</p><p>Romans 15</p><p>KJV</p><p>1+ We then that are strong ought to bear the infirmities of the weak, and not to please ourselves.</p><p>&nbsp;</p><p>1 Thessalonians 5</p><p>KJV</p><p>14+ Now we exhort you, brethren, warn them that are unruly, comfort the feebleminded, support the weak, be patient toward all men.</p><p>&nbsp;</p><p>Galatians 5</p><p>KJV</p><p>14+ For all the law is fulfilled in one word, even in this; Thou shalt love thy neighbour as thyself.</p><p>&nbsp;</p><p>1 John 4</p><p>KJV</p><p>21+ And this commandment have we from him, That he who loveth God love his brother also.</p><p>&nbsp;</p><p>The expression “ load shedding “ is a much dreaded expression that almost every Ghanaian hate to hear! Some call it “ domsor!”</p><p>&nbsp;</p><p>Load shedding was an exercise introduced by the power-generating companies as a way of rationing the limited power they can generate. It was a “burden sharing “ exercise.&nbsp;</p><p>&nbsp;</p><p>This took place at a time when the economy was not in good shape and generating inputs were not available so power plants could not operate at full capacity. Time tables ( schedules) were published and reviewed weekly.&nbsp;</p><p>&nbsp;</p><p>It is the hardship and discomfort that this exercise imposed on the citizenry that made the term “ load shedding” repugnant and nobody wants to hear it again&nbsp;</p><p>&nbsp;</p><p>But come to think of it, the power producers were only complying with what the scriptures enjoined us believers to do-share with others the limited available resources&nbsp;</p><p>&nbsp;</p><p>During the power rationing period the communities were zoned and power was supplied in an alternative fashion. Zone A gets it for a certain duration. After which Zone B and thereafter Zone C!&nbsp;</p><p>&nbsp;</p><p>In effect, we were “ bearing one another’s burden” sharing the discomfort and inconvenience in a way as not to disadvantage anybody. No one must be left in darkness which is exactly what the above scriptures teach.&nbsp;</p><p>&nbsp;</p><p>No one must go to bed on an empty stomach. No one must be denied pleasure or enjoyment; all must enjoy no matter the degree or different levels of enjoyment. The bottom line is that everyone must be happy. This is what “ Bear year one another’s burden “ means.&nbsp;</p><p>&nbsp;</p><p>All the above scriptures have one thing in common ; load ( burden )&nbsp; sharing ! Those who have must support those who don’t have.&nbsp;&nbsp;</p><p>John spoke to this subject more practically.&nbsp;&nbsp;</p><p>Read it</p><p>1 John 3</p><p>KJV</p><p>17+ But whoso hath this world's good, and seeth his brother have need, and shutteth up his bowels of compassion from him, how dwelleth the love of God in him?</p><p>&nbsp;</p><p>James also added his voice to burden sharing when he asked ;</p><p>James 2</p><p>KJV</p><p>15+ If a brother or sister be naked, and destitute of daily food,</p><p>16+ And one of you say unto them, Depart in peace, be ye warmed and filled; notwithstanding ye give them not those things which are needful to the body; what doth it profit?</p><p>&nbsp;</p><p>In our rural communities, we see this ( burden sharing ) in action, The following are shared; poverty is shared, pain is shared, sorrow is shared, Joy is shared! When one suffers all suffer, when one is blessed all share in it!</p><p>&nbsp;</p><p>We also see these among genuine friends and lovers; when one is down all help to lift him. When one suffers a mishap all rally round to offer help.&nbsp;</p><p>&nbsp;</p><p>Unfortunately, this is not so among many believers! To them, it is “ everybody for himself, God for us all” &nbsp; Every body for himself, God for us all is an economic philosophy the practice of which creates individual wealth, which &nbsp; eventually divides society as a result of the wide&nbsp; gap between the&nbsp; haves and the have-nots &nbsp; a source of social inequality&nbsp;</p><p>&nbsp;</p><p>Whereas “ burden sharing “ is a philosophy that creates social equality regardless of the prevailing economic inequality.&nbsp;</p><p>&nbsp;</p><p>Burden sharing therefore is a social philosophy the pursuit of which will lead to social peace and harmony. The apostles practised this; read the outcome&nbsp;</p><p>Acts 4</p><p>KJV</p><p>34 Neither was there any among them that lacked: for as many as were possessors of lands or houses sold them, and brought the prices of the things that were sold,</p><p>35+ And laid them down at the apostles' feet: and distribution was made unto every man according as he had need.</p><p>( Burden sharing in action )&nbsp;</p><p>&nbsp;</p><p>It is my view that many mistook an economic philosophy for the social. Everybody for himself, God for us all is not a social bug an economic philosophy! It is a driving force behind wealth creation&nbsp;</p><p>&nbsp;</p><p>If we therefore desire to create a community of love, just, equal etc then we must revisit the concept of “ load shedding “ ( burden sharing ) where generated power was rationed so no one was left in total darkness.&nbsp;</p><p>&nbsp;</p><p>My thoughts as I reread the scriptures that command us to “ bear ye one another’s burden “. Bear ye one another’s burden is a social philosophy, not an economic one. &nbsp;</p><p>&nbsp;</p><p>Pursue the everybody for himself, God for us all philosophy to create wealth, after which you practice the social philosophy of “ burden sharing” where you share with the disadvantaged what wealth you’ve created.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-07-05T21:39:29.335Z",
    "updatedAt": "2025-07-05T21:39:29.335Z",
    "publishedAt": "2025-07-05T21:39:29.307Z",
    "slug": "load-shedding-a-christian-perspective"
  },
  {
    "id": 232,
    "documentId": "j8neb67cn1koretxriqxowus",
    "title": "My Pledge",
    "text": "<p>THE PLEDGE<br>I solemnly pledge my faith and loyalty to Christ and His church. I pledge to be faithful, honest &nbsp;and true to Him in all things.</p><p>I pledge to uphold , live and portray His teachings by my life , deeds and words &nbsp;</p><p>&nbsp;</p><p>I pledge to avoid speaking negatively of the church both it’s &nbsp;past and present. Rather I’ll speak positively of it to members , friends and foes. I’ll not make reference to its past failures but only its successes.</p><p>&nbsp;</p><p>I pledge myself to serve , promote and uphold this congregation by all means possible.</p><p>I pledge to attend all it’s services as long as my strength, circumstances and situations shall allow.</p><p>&nbsp;</p><p>I pledge that In all things I’ll endeavor to put the Lord and His church first in my life.</p><p>I pledge to honour my financial obligations to the Lord through His church. I shall give in keeping with his blessings.</p><p>&nbsp;</p><p>I pledge to love my fellow believer, do good to Him/ her at all times possible.</p><p>&nbsp;</p><p>I pledge to forgive those who offend me if and when they ask for forgiveness. Even when they do not ask, for my own peace of mind and spirit I shall endeavor to forgive them. &nbsp;<br>&nbsp;</p><p>I shall harbour no grudge against any. I shall strive to be at peace with all.</p><p>&nbsp;</p><p>I pledge to help create and &nbsp;maintain peace and unity in &nbsp;the congregation.</p><p>&nbsp;</p><p>I pledge to put my knowledge, experience and, blessings at the disposal of the church of Christ. When and where duty calls I shall make myself available.</p><p>&nbsp;</p><p>So help me God.</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-07-07T13:13:32.125Z",
    "updatedAt": "2025-07-07T13:13:32.125Z",
    "publishedAt": "2025-07-07T13:13:32.099Z",
    "slug": "my-pledge"
  },
  {
    "id": 233,
    "documentId": "dq76v46l9buywhixknghuoda",
    "title": "Every Road Has An End",
    "text": "<p>Every Road Has An End, And So Is Life</p><p>&nbsp;</p><p>Every road Has An End<br>There is No road that&nbsp;<br>Does not have An End<br>So Is Life , Here On Earth</p><p>&nbsp;</p><p>Every Road Has &nbsp;An End<br>So drive with Care, Avoid speeding&nbsp;<br>For you know Not<br>When the End Will Show Up</p><p>&nbsp;</p><p>Every Road has An End<br>And So is life, So live&nbsp;<br>Soberly, Humbly, and Lovingly<br>For Your End may be Nearer<br>Than You think!</p><p>&nbsp;</p><p>Every Road has An End<br>So observe the Rules&nbsp;<br>And the Road signs. This is&nbsp;<br>How &nbsp;you’ll drive comfortably&nbsp;<br>And safely</p><p>&nbsp;</p><p>Every Road has an End&nbsp;<br>So is life, so observe the Rules,<br>Love your Neighbor As Yourself,<br>Do unto Others As you Would have Them Do To You.</p><p>&nbsp;</p><p>Like driving on A Good Road,<br>So Is Our life, if we Observe&nbsp;<br>The rules, life will be joyous&nbsp;<br>And pleasant, As we reach Our&nbsp;<br>Destination.</p><p>&nbsp;</p>",
    "createdAt": "2025-07-07T21:35:23.684Z",
    "updatedAt": "2025-07-07T21:35:23.684Z",
    "publishedAt": "2025-07-07T21:35:23.631Z",
    "slug": "every-road-has-an-end"
  },
  {
    "id": 234,
    "documentId": "yszha5bjad52mea2d8u62a34",
    "title": "Even Me!",
    "text": "<p>Even Me</p><p>1 Timothy 1</p><p>KJV</p><p>12+ And I thank Christ Jesus our Lord, who hath enabled me, for that he counted me faithful, putting me into the ministry;</p><p>&nbsp;</p><p>13 Who was before a blasphemer, and a persecutor, and injurious: but I obtained mercy, because I did it ignorantly in unbelief.</p><p>&nbsp;</p><p>What a confession, what an admission of guilt and past life! These are some of the admirable traits of Paul that made him stand tall among his contemporaries!&nbsp;</p><p>&nbsp;</p><p>It teaches lessons that most find difficult to learn and practice. Paul was saying “ even me” with all my weaknesses, the wrong and evil things I did; He has accepted me.&nbsp;</p><p>&nbsp;</p><p>The call to serve is not based on human merit, but by grace&nbsp; &nbsp;It is not our worthiness but God counting us worthy &nbsp; It is not what I know but what He reveals through me.&nbsp;</p><p>&nbsp;</p><p>As Paul admitted, it is God who “ enables &nbsp; Hear Him again “ who hath enabled me, for that he counted me faithful, putting me into the ministry;</p><p>&nbsp;</p><p>God’s “ enablement “ means God’s “empowerment “ and this “empowerment” comes through the gifts that He freely bestows.&nbsp;</p><p>&nbsp;</p><p>In his letter to the church at Corinth, he made this known to them, how that not many distinguished men by worldly ratings were called, instead He chose the lowly, the unrecognised, the unadorned etc&nbsp;</p><p>&nbsp;</p><p>Read it</p><p>1 Corinthians 1</p><p>KJV</p><p>26+ For ye see your calling, brethren, how that not many wise men after the flesh, not many mighty, not many noble, are called:</p><p>&nbsp;</p><p>Lest we misread what he said, please note he said “ not many wise etc ” which means some wise, mighty men etc were also called except that they were fewer in number.&nbsp;</p><p>&nbsp;</p><p>To say “ even me” is to say “ I am not worthy “. “ I do not deserve” etc. who among us can beat his chest and say he was worthy of his salvation? None, not even the Apostle Paul.&nbsp;</p><p>&nbsp;</p><p>As has been said “ every Saint was once a sinner, and every sinner is a potential saint “ It is with this mindset that the hymn writer describes his unworthiness in these words ;&nbsp;</p><p>&nbsp;</p><p>“Christ receiveth sinful men,&nbsp;</p><p>Even me with all my sin;&nbsp;</p><p>Purged from ev’ry spot and stain,&nbsp;</p><p>Heav’n with Him I enter in”&nbsp;</p><p>(Sinners Jesus Will Receive)&nbsp;</p><p>&nbsp;</p><p>Yes, even me, even you with all our pasts have been counted worthy to be part of&nbsp; His chosen and redeemed ones!&nbsp;</p><p>&nbsp;</p><p>Read Paul wrote to the Corinthians ;</p><p>1 Corinthians 6</p><p>KJV</p><p>9 Know ye not that the unrighteous shall not inherit the kingdom of God? Be not deceived: neither fornicators, nor idolaters, nor adulterers, nor effeminate, nor abusers of themselves with mankind,</p><p>&nbsp;</p><p>11+ And such were some of you: but ye are washed, but ye are sanctified, but ye are justified in the name of the Lord Jesus, and by the Spirit of our God.</p><p>&nbsp;</p><p>Yes, “And such were some of you: but ye are washed, but ye are sanctified, but ye are justified”! There is no sin that He can not forgive if we admit and forsake it.&nbsp;</p><p>&nbsp;</p><p>Notice three (3) significant things that were done to us when we came to Christ. We are “washed” “ sanctified “ and “ justified”.&nbsp;</p><p>&nbsp;</p><p>Washed of our sins an act a hymn writer painted with these words ;</p><p>“My sin, not in part but the whole, Is nailed to the cross, and I bear it no more, Praise the Lord, praise the Lord, O my soul! “&nbsp;</p><p>&nbsp;</p><p>To be sanctified is to be set apart! We were once dirty and useless to Him but when we came to Him He first washed us and made us useful! He set us apart from the useless. He put on us a white garment! So strive to keep your garment white!</p><p>&nbsp;</p><p>And lastly he “ justified “ us which means He declared us innocent! He dropped all the charges that Satan brought against us! He declared them foolish and no case.&nbsp;</p><p>&nbsp;</p><p>Read how the Apostle John puts it;</p><p>1 John 3</p><p>KJV</p><p>1+ Behold, what manner of love the Father hath bestowed upon us, that we should be called the sons of God: therefore the world knoweth us not, because it knew him not.</p><p>&nbsp;</p><p>Yes, the world we left behind does not believe that we can be what they now see us to be &nbsp; They find it difficult to accept that a sinner like you has now become a saint.&nbsp;</p><p>&nbsp;</p><p>This is God’s doing and because they don’t know God and His transformative power they can not believe what they see about you.&nbsp;</p><p>&nbsp;</p><p>Yes, even I with all my negative past have been counted worthy to serve. Not because I am worthy but because He chose me! This is what Paul is saying to us.&nbsp;</p><p>&nbsp;</p><p>We serve because of His grace, not by merit!&nbsp;</p><p>&nbsp;</p><p>My reflections&nbsp;</p><p>.</p><p>&nbsp;</p><p>.</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-07-08T23:25:48.157Z",
    "updatedAt": "2025-07-08T23:25:48.157Z",
    "publishedAt": "2025-07-08T23:25:48.145Z",
    "slug": "even-me"
  },
  {
    "id": 235,
    "documentId": "zslagz3r9ybsgytes5uui5a0",
    "title": "The Triumph Of Faith",
    "text": "<p>Why Suffering And Hardship?: How To Overcome</p><p>Job 5:6-8&nbsp;</p><p>NIV</p><p>[6] For hardship does not spring from the soil, nor does trouble sprout from the ground. [7] Yet man is born to trouble as surely as sparks fly upward. [8] “But if I were you, I would appeal to God; I would lay my cause before him.</p><p>&nbsp;</p><p>There is a signpost near a washing bay in Tema Community 9 which reads “ trouble no get horns!” ( pidgin English) &nbsp; Any time I drive past I read it and praise the writer. It is a warning to the wise and discerning. It is written on a huge truck tire and has been there for many years&nbsp;&nbsp;</p><p>&nbsp;</p><p>The challenges, uncertainties, pains, sufferings, losses etc we face daily in life have made many to question the claim that God’s children are immune to the vicissitudes of life.&nbsp;</p><p>&nbsp;</p><p>Though it is a genuine claim it needs to be qualified to be understood by all.&nbsp;</p><p>&nbsp;</p><p>Yes, we are immune, no we are not! In the face of the realities of life we are not immune, no one can deny the fact that he/she have not experienced disappointments in life. We are flesh and blood! &nbsp;</p><p>&nbsp;</p><p>Yes, we are immune because of the faith that lives in us. We are immune by virtue of the trust we have in God.&nbsp;</p><p>&nbsp;</p><p>It is faith that immunizes us, the heavier the dose the better our chances are of withstanding the shocks of life.&nbsp;</p><p>&nbsp;</p><p>This is where many are found lacking, Beloved any time you are sinking below the pressures and cares of life, please check your dosage of faith level it may be that they’ve gone low or down completely!&nbsp;</p><p>&nbsp;</p><p>To overcome, you’ll need to increase the dosage. You must maintain a level that will sustain and support you, always take a booster dose from time to time.&nbsp;</p><p>&nbsp;</p><p>This you do by setting aside a day to fast, pray and read the Bible not for anything but to boost your spiritual immune system.&nbsp;</p><p>&nbsp;</p><p>Read John said,</p><p>1 John 5</p><p>KJV</p><p>4+ For whatsoever is born of God overcometh the world: and this is the victory that overcometh the world, even our faith</p><p>&nbsp;</p><p>5 Who is he that overcometh the world, but he that believeth that Jesus is the Son of God?</p><p>&nbsp;</p><p>. 1 John 4</p><p>KJV</p><p>4+ Ye are of God, little children, and have overcome them: because greater is he that is in you, than he that is in the world</p><p>&nbsp;</p><p>Yes, Faith is the victory we know that overcomes the world! So always check your faith level lest it fail you at the time you most need it.&nbsp;</p><p>&nbsp;</p><p>Beloved,&nbsp; there are two tools God gave us which we have, in our armoury; these are ‘reason’ and ‘faith’! Human effort is based and grounded in reasoning, the application of the mind, the intellect, experience etc to solve a problem Reason therefore is the first tool to apply when you encounter any challenge.&nbsp;</p><p>&nbsp;</p><p>The second tool is faith. This comes into play where and when reason has failed. This is because human reasoning has its limits.&nbsp;</p><p>&nbsp;</p><p>Read what Paul said;&nbsp;</p><p>2 Corinthians 5</p><p>KJV</p><p>7+ (For we walk by faith, not by sight:)</p><p>&nbsp;</p><p>Did you read that “ we walk by faith “ ? Yes, when walking by “sight” (reason) fails that is when we walk by “ faith “. There is a limitation to human reasoning, but there is no limitation to faith in God. The greater the faith the greater the victory. So, grow your faith not forgetting to grow your reasoning ability also.&nbsp;</p><p>&nbsp;</p><p>So yes, troubles will come our way because we are human but we are equipped to overcome them through faith and reason. Reason on our part and faith in God. Remember these two tools learn when, where and how to use them.&nbsp;</p><p>&nbsp;</p><p>Thoughts to share&nbsp;&nbsp;</p>",
    "createdAt": "2025-07-09T09:53:17.128Z",
    "updatedAt": "2025-07-09T09:53:17.128Z",
    "publishedAt": "2025-07-09T09:53:17.039Z",
    "slug": "the-triumph-of-faith"
  },
  {
    "id": 236,
    "documentId": "jvpm4t7witmudpzm0vmjqm0v",
    "title": "Israel’s Wilderness Experience: Lessons To Learn ",
    "text": "<p>Israel’s Wilderness Journey: What It Means To Us Today</p><p>Exodus 13</p><p>KJV</p><p>17 And it came to pass, when Pharaoh had let the people go, that God led them not through the way of the land of the Philistines, although that was near; for God said, Lest peradventure the people repent when they see war, and they return to Egypt:</p><p>&nbsp;</p><p>Yes, the promised land was a few miles away, just a stone’s throw as we would say it in today’s language, and yet Israel was taken through a different route.&nbsp;</p><p>&nbsp;</p><p>The reason was given as “ Lest peradventure the people repent when they see war, and they return to Egypt:”</p><p>&nbsp;</p><p>Oh, God’s intention or reason for taking them the other way was to teach them lessons! Lessons they’ll need as they settle in the land.&nbsp;</p><p>&nbsp;</p><p>Perhaps you may not understand God's intention. Look at it this way: Historically, Israel ( Jacob) came to Egypt at Joseph's invitation!&nbsp;</p><p>&nbsp;</p><p>History gives us the number that came with him. There were in total seventy.&nbsp;</p><p>Genesis 46</p><p>KJV</p><p>26 All the souls that came with Jacob into Egypt, which came out of his loins, besides Jacob's sons' wives, all the souls were threescore and six;</p><p>&nbsp;</p><p>27+ And the sons of Joseph, which were born him in Egypt, were two souls: all the souls of the house of Jacob, which came into Egypt, were threescore and ten.</p><p>&nbsp;</p><p>But after many years when they were leaving Egypt scriptures state&nbsp; the following;&nbsp;</p><p>Deuteronomy 10</p><p>KJV</p><p>22+ Thy fathers went down into Egypt with threescore and ten persons; and now the Lord thy God hath made thee as the stars of heaven for multitude.</p><p>&nbsp;</p><p>Exodus 12</p><p>KJV</p><p>37+ And the children of Israel journeyed from Rameses to Succoth, about six hundred thousand on foot that were men, beside children.</p><p>&nbsp;</p><p>Seventy (70) went in, six hundred thousand (600,000) came out excluding children. A nation was born.&nbsp;</p><p>&nbsp;</p><p>A nation was born, organization was needed. Laws ( a constitution) to regulate and hold the nation were needed. Structures and institutional arrangements are needed.&nbsp;</p><p>&nbsp;</p><p>These were the reasons why they were taken through the long route to enable them to learn the lessons of nationhood! Hitherto they were a disorganized clan groupings with no cohesion.&nbsp;</p><p>&nbsp;</p><p>What do we stand to learn from these experiences? A lot.&nbsp;</p><p>&nbsp;</p><p>Individually we need to know that though God has plans for our lives these will not materialise if He does not first take us through some rigorous training.&nbsp;</p><p>&nbsp;</p><p>Ask anybody who is “ well to do “today and he/she will tell you how far he/she has come. The ups and downs, the rise and fall, the pains and the sufferings. The disappointments and regrets.&nbsp;</p><p>&nbsp;</p><p>Beloved, God will not give you precious things if you fail His training. If you’ve not learn how to handle GHC10, He will not give you GHC 100&nbsp;</p><p>&nbsp;</p><p>Is this not what Jesus meant when He said;&nbsp;</p><p>Luke 16:10-12</p><p>NIV</p><p>[10] “Whoever can be trusted with very little can also be trusted with much, and whoever is dishonest with very little will also be dishonest with much.&nbsp;</p><p>&nbsp;</p><p>[11] So if you have not been trustworthy in handling worldly wealth, who will trust you with true riches? [12] And if you have not been trustworthy with someone else's property, who will give you property of your own?</p><p>&nbsp;</p><p>Many a child of God has asked why they are going through difficulties in life when they ought to be enjoying! What you’ve just read is the answer. You are simply not faithful in the little blessings He bestowed on you. Yes, the truth is painful but that is it.&nbsp;</p><p>&nbsp;</p><p>Just look at how employees handle the properties of their employers. Just watch how people entrusted with little authority exercise it.&nbsp;</p><p>&nbsp;</p><p>Just look at how some tenants handle the rooms they rent. Just watch how some taxi drivers handle the taxis they are given to drive. You’ll often hear them say “ oh if I buy my own you’ll see how I’ll handle it” which wish never comes because they are dishonest with someone else’s. Yes.&nbsp;</p><p>&nbsp;</p><p>Do you now see why some are unable to make progress in life? Because they fail the training lessons of God. The little blessings God blessed them with were either misapplied or misused.&nbsp;</p><p>&nbsp;</p><p>The subject paper in which most believers had zero was that of benevolence. They passed papers in church attendance, taking the Lord's Supper, not giving tithes, not using instruments in singing, you name it!&nbsp;</p><p>&nbsp;</p><p>They failed miserably in the benevolence papers. They failed in both papers one and two. &nbsp; Paper one they had -selfishness, paper two -selfishness These were written across their answer sheets.&nbsp;</p><p>&nbsp;</p><p>Here is what was written boldly underneath their papers as the answers expected; read it.&nbsp;</p><p>Proverbs 11</p><p>KJV</p><p>24+ There is that scattereth, and yet increaseth; and there is that withholdeth more than is meet, but it tendeth to poverty.</p><p>&nbsp;</p><p>25 The liberal soul shall be made fat: and he that watereth shall be watered also himself.</p><p>&nbsp;</p><p>26+ He that withholdeth corn, the people shall curse him: but blessing shall be upon the head of him that selleth it.</p><p>&nbsp;</p><p>Some gave up on the training. To them, the envisaged training is too tough so they did not attempt it at all. The one talented man was their role model so they had nothing to their credit.&nbsp;</p><p>&nbsp;</p><p>Others attempted but failed because they misused their first credit (blessing) through selfishness! Remember what Jesus said&nbsp;</p><p>Luke 16:10</p><p>NIV</p><p>[10] “Whoever can be trusted with very little can also be trusted with much, and whoever is dishonest with very little will also be dishonest with much.</p><p>&nbsp;</p><p>So, the lesson is this God takes us through the “ wilderness “ of pain/suffering etc to see how we would use whatever He will bestow on us.&nbsp;</p><p>&nbsp;</p><p>Not many were born with silver spoons in their mouths; you may be one but today look at the type of spoon that is in your mouth! Is it silver,&nbsp; wooden or none&nbsp;</p><p>&nbsp;</p><p>Those born without silver spoons in their mouths but now have them are those who passed the test of honesty, faithfulness. Etc. &nbsp;They were faithful in little hence they were blessed with more.&nbsp;</p><p>&nbsp;</p><p>Always remember that when God takes you through the “wilderness” it was to prepare you for a better future! So do not be afraid to go through the wilderness. Let me conclude with this promise!&nbsp;</p><p>Jeremiah 29</p><p>KJV</p><p>11+ For I know the thoughts that I think toward you, saith the Lord, thoughts of peace, and not of evil, to give you an expected end.</p><p>&nbsp;</p><p>Trust God to take you through the wilderness safely till you set foot in the promised land of greatness and glory.&nbsp;</p><p>&nbsp;</p><p>My take.&nbsp;</p>",
    "createdAt": "2025-07-10T10:27:00.176Z",
    "updatedAt": "2025-07-10T10:27:00.176Z",
    "publishedAt": "2025-07-10T10:27:00.159Z",
    "slug": "israels-wilderness-experience-lessons-to-learn"
  },
  {
    "id": 237,
    "documentId": "kbqrrvuod4c7aabhfu3ym11a",
    "title": "Many Rivers To Cross! ",
    "text": "<p>Many Rivers To Cross, The Uncertainties Of Life.</p><p>John 16</p><p>KJV</p><p>33+ These things I have spoken unto you, that in me ye might have peace. In the world ye shall have tribulation: but be of good cheer; I have overcome the world.</p><p>&nbsp;</p><p>Trials and tribulations we can not rule out that they are inherent and part of life’s architecture! What is assuring is the fact that we are told what to do “ but be of good cheer; I have overcome the world”</p><p>&nbsp;</p><p>Thus saith the Captain of our Salvation who himself experienced what we go through today. Yet did not give up&nbsp;</p><p>&nbsp;</p><p>Truly there are many rivers to cross before we reach our final destination! There is the river of failure, of betrayal, of grief, of poverty, of losses, of loneliness etc.&nbsp;</p><p>&nbsp;</p><p>Each day presents us with several challenges and uncertainties! Life, indeed is a battlefield, every joy we experience is only momentary and short-lived. Nothing lasts long.&nbsp;</p><p>&nbsp;</p><p>In the list presented to us as the heroes of the faith in Hebrews, the eleventh chapter one name was missing, Job. ( I believe he is covered by “ time will fail me to mention etc phrase !!&nbsp;</p><p>&nbsp;</p><p>The experiences of Job summarise what it means to face and cross the many rivers. He lost his children, properties,&nbsp; health etc; yet he cheered up and withstood the challenges! He crossed these rivers with distinction.&nbsp;</p><p>&nbsp;</p><p>Many today have crossed similar rivers as they’ve also lost their jobs, families, friends, properties and their peace.&nbsp;</p><p>&nbsp;</p><p>Each day of our lives we stand at the banks of rivers not knowing how deep or shallow, how swift or slow flowing they are and yet we must cross them before the close of the day.&nbsp;</p><p>&nbsp;</p><p>It is these that create in us fears and uncertainties for we know not what each river holds!&nbsp; And here is where the assurances of the Lord come in.&nbsp;</p><p>&nbsp;</p><p>John 14</p><p>KJV</p><p>27+ Peace I leave with you, my peace I give unto you: not as the world giveth, give I unto you. Let not your heart be troubled, neither let it be afraid.</p><p>&nbsp;</p><p>To which Paul added;</p><p>Philippians 4</p><p>KJV</p><p>7+ And the peace of God, which passeth all understanding, shall keep your hearts and minds through Christ Jesus.</p><p>&nbsp;</p><p>With Isaiah concluding&nbsp;</p><p>Isaiah 43</p><p>KJV</p><p>2+ When thou passest through the waters, I will be with thee; and through the rivers, they shall not overflow thee: when thou walkest through the fire, thou shalt not be burned; neither shall the flame kindle upon thee.</p><p>&nbsp;</p><p>Which River are you standing by? I stand at the banks of “River Grief” today waiting for the strength to cross it. River Grief has overflowed its banks and is threatening to wash me away. Throw me a lifeline by praying for me&nbsp;</p><p>&nbsp;</p><p>Yes, there are many rivers to cross and as we stand by their banks let us take and draw courage and strength from He who crossed all rivers. Let His words continue to echo in our hearts and minds “ I have overcome”. And so shall we!&nbsp;</p><p>&nbsp;</p><p>Be determined to cross your river(s) today. Trust in the strength that He provides. He stands ready to hold your hands stretch them out to Him.&nbsp;</p><p>&nbsp;</p><p>A thought to share&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-07-11T08:53:13.361Z",
    "updatedAt": "2025-07-11T08:53:13.361Z",
    "publishedAt": "2025-07-11T08:53:13.346Z",
    "slug": "many-rivers-to-cross"
  },
  {
    "id": 238,
    "documentId": "uw3xl1tka3mbgaq9qgxai91c",
    "title": "But For You",
    "text": "<p>&nbsp;</p><p>“But For You”</p><p>&nbsp;</p><p>But for You,&nbsp;</p><p>I’ll not be Who&nbsp;</p><p>I Am today&nbsp;</p><p>Therefore I Thank You&nbsp;</p><p>&nbsp;</p><p>But for You,</p><p>I’ll not be Where</p><p>I am Today ;</p><p>My Heart therefore rejoices!</p><p>&nbsp;</p><p>But for You,</p><p>My Enemies would</p><p>Have crushed Me,</p><p>You Gave Me Hope Which Sustained Me!</p><p>&nbsp;</p><p>But for You,</p><p>My Path would&nbsp;</p><p>Have been Dark;</p><p>You shone as a Light to Direct Me!</p><p>&nbsp;</p><p>But for You,</p><p>When my Friends&nbsp;</p><p>Deserted Me, and All was lost</p><p>You stood firmly behind Me! &nbsp;</p><p>&nbsp;</p><p>But for You,&nbsp;</p><p>The Impossible became Possible,&nbsp;</p><p>Hope and Vision were revived,&nbsp;</p><p>Victory was won!&nbsp;</p><p>&nbsp;</p><p>Yes, but for You</p><p>Life would have&nbsp;</p><p>Been miserable, and meaningless,&nbsp;</p><p>But You stood to cheer Me On&nbsp;</p><p>&nbsp;</p><p>My Gratitude To All,</p><p>Who has Helped bring Me this Far;</p><p>Both the Known and Unknown!!&nbsp;</p><p>Which Include You!&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-07-13T07:26:23.436Z",
    "updatedAt": "2025-07-13T07:47:39.987Z",
    "publishedAt": "2025-07-13T07:47:39.968Z",
    "slug": "but-for-you"
  },
  {
    "id": 239,
    "documentId": "jb2sovo2t2rmk9437if7n391",
    "title": "Matters Of Concern ",
    "text": "<p>A Matter Of Concern: The Lamentations Of An Old School Boy! &nbsp;</p><p>Luke 16:15</p><p>NIV</p><p>[15] He said to them, “You are the ones who justify yourselves in the eyes of others, but God knows your hearts. What people value highly is detestable in God's sight.</p><p>&nbsp;</p><p>(And he said unto them, Ye are they which justify yourselves before men; but God knoweth your hearts: for that which is highly esteemed among men is abomination in the sight of God.)</p><p>(KJV)</p><p>&nbsp;</p><p>It was many decades ago, in fact in my youthful days that these words were drummed into my ears; to the intent that I should not seek fame or popularity the wrong way. &nbsp;Human endorsement through the wrong means/reasons.&nbsp;</p><p>&nbsp;</p><p>Those were the days, just like it is today that everybody wants to be somebody! Everybody wants to be seen, and be regarded as “somebody” and to achieve this one has to do something weird and unusual!&nbsp;</p><p>&nbsp;</p><p>Just like today, morality was turned upside down through the wearing of special hairstyles, indecent clothing, and vulgar appearances with earrings tucked in men’s ears. Men plaiting their hair just like women.&nbsp;</p><p>&nbsp;</p><p>At that time it was on a minimal scale not full-blown as today. Surely this way you’ll attract attention and be seen as different. This was an era we called the “ justify your inclusion” era “be in or be left out.”</p><p>&nbsp;</p><p>A few drifted and joined the “immoral revolution” instead of upholding the “ moral revolutionary principles “ bequeathed This was how we got to where we are today. A generation failed to uphold, protect and defend values that was bequeathed to them.&nbsp;</p><p>&nbsp;</p><p>Today the unacceptable of the past has become acceptable. Men wearing earrings were unknown then, and men with unkempt beards and hair were unknown then. What we now know as “Rasta hairstyle” was the preserve of the mentally challenged.&nbsp;</p><p>&nbsp;</p><p>Wearing trousers with cuts/holes all over was also the preserve of the mentally challenged! Wearing and exposing undergarments as outer covering, even the bras of women were concealed. Not anymore.&nbsp;</p><p>&nbsp;</p><p>Today you must expose the “not to be exposed” in public, “do the not to be done “ in public “ behave unbehavingly (sic) ” in public etc; all in the name of seeking attention, popularity and recognition! Validation is the word.&nbsp;</p><p>&nbsp;</p><p>What made many uncomfortable then, makes the majority comfortable today. The apologists of these would say “ society is dynamic, social change is inevitable”&nbsp; which is true; but social values are non-negotiable, they are the basis of social cohesion.&nbsp;</p><p>&nbsp;</p><p>In the sixties/seventies, there was this moral upheaval in the form of a lifestyle known as the hippie lifestyle. It was characterised by drug abuse, open confrontations with the law etc. It was a “ protest culture “ which is what every negative moral revolution is.&nbsp;</p><p>&nbsp;</p><p>Beloved in the midst of all these may we remember at all times and in all generations that “ What people value highly is detestable in God's sight.”</p><p>&nbsp;</p><p>May we also note and observe these cautionary warnings ;</p><p>Romans 12</p><p>KJV</p><p>2+ And be not conformed to this world: but be ye transformed by the renewing of your mind, that ye may prove what is that good, and acceptable, and perfect, will of God.</p><p>&nbsp;</p><p>1 Peter 1</p><p>KJV</p><p>14+ As obedient children, not fashioning yourselves according to the former lusts in your ignorance:</p><p>15 But as he which hath called you is holy, so be ye holy in all manner of conversation;</p><p>16+ Because it is written, Be ye holy; for I am holy.</p><p>&nbsp;</p><p>1 John 2</p><p>KJV</p><p>15+ Love not the world, neither the things that are in the world. If any man love the world, the love of the Father is not in him.</p><p>&nbsp;</p><p>16 For all that is in the world, the lust of the flesh, and the lust of the eyes, and the pride of life, is not of the Father, but is of the world.</p><p>&nbsp;</p><p>Like the psalmist, let us pray this prayer always ;</p><p>Psalms 51</p><p>KJV</p><p>10+ Create in me a clean heart, O God; and renew a right spirit within me.</p><p>&nbsp;</p><p>I hope you’ll bear with the “lamentations” of the “old school boy”! He is not a “Mr Kill Joy” but a realist and a Christian pragmatist!</p><p>&nbsp;</p><p>A word to the wise.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createdAt": "2025-07-14T09:26:12.808Z",
    "updatedAt": "2025-07-14T09:26:12.808Z",
    "publishedAt": "2025-07-14T09:26:12.764Z",
    "slug": "matters-of-concern"
  }
]