{
  "data": [
    {
      "id": 197,
      "documentId": "mqkaxd7invrfpaqzimmakwgp",
      "title": "A Cautionary Advice To A Young Friend",
      "text": "\u003Cp\u003EA Cautionary Advice To A Young Friend\u003C/p\u003E\u003Cp\u003EProverbs 30\u003C/p\u003E\u003Cp\u003EKJV\u003C/p\u003E\u003Cp\u003E17+ The eye that mocketh at his father, and despiseth to obey his mother, the ravens of the valley shall pick it out, and the young eagles shall eat it.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EMany of us the aged have for friends some young men and women. Occasionally we meet and interact, and we tell one another “What was and &nbsp;what is!”\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EGenerations differ no one doubts this, however, some principles don’t change with generational change.&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EThe rate at which societal values are changing has been a source of worry and concern to the older generation! In a conversation with a young friend, this issue came up.&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EThe conclusion we both came up with was “ somebody ( a generation) went to sleep” A generation failed to uphold and pass on to the other what it received. It is this failure that has brought us to where we are today! The question was How do we then reset the clock?&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EWe see and experience these in every sphere of life be it social, church, family or national. Had the failed generation followed the principle of transferring to others what it received we would have maintain high moral and ethical standards and sanity.&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EJust like the Church we have kept and observe the Lord’s Supper because, as Paul said ;&nbsp;\u003C/p\u003E\u003Cp\u003ECorinthians 11\u003C/p\u003E\u003Cp\u003EKJV\u003C/p\u003E\u003Cp\u003E23+ For I have received of the Lord that which also I delivered unto you, That the Lord Jesus the same night in which he was betrayed took bread:\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EWe have passed on to us values that have kept past generations sound, united, responsive and respectful. Today all these have crumbled before our very eyes. This is a laissez-faire generation!&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EThe sages of old have always held as sacrosanct this commandment;\u003C/p\u003E\u003Cp\u003EProverbs 23\u003C/p\u003E\u003Cp\u003EKJV\u003C/p\u003E\u003Cp\u003E22+ Hearken unto thy father that begat thee, and despise not thy mother when she is old.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EProverbs 1\u003C/p\u003E\u003Cp\u003EKJV\u003C/p\u003E\u003Cp\u003E8+ My son, hear the instruction of thy father, and forsake not the law of thy mother:\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EEphesians 6\u003C/p\u003E\u003Cp\u003EKJV\u003C/p\u003E\u003Cp\u003E1+ Children, obey your parents in the Lord: for this is right.\u003C/p\u003E\u003Cp\u003E2+ Honour thy father and mother; (which is the first commandment with promise;)\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EWhat do we see today?&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EProverbs 30\u003C/p\u003E\u003Cp\u003EKJV\u003C/p\u003E\u003Cp\u003E11+ There is a generation that curseth their father, and doth not bless their mother.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EProverbs 30\u003C/p\u003E\u003Cp\u003EKJV\u003C/p\u003E\u003Cp\u003E12+ There is a generation that are pure in their own eyes, and yet is not washed from their filthiness.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EYes, the “old order changeth”, but eternal laws/principles, truths etc remain the same. These are what is called the “ eternal non-negotiable principles and laws”\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EOne of which is respect for the elderly, in whom reside refined quality thought, wisdom and common sense as a result of experience gathered through life!\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EIf only we could all pay attention to this warning, our journey would be smooth and end well! &nbsp;\u003C/p\u003E\u003Cp\u003EProverbs 20\u003C/p\u003E\u003Cp\u003EKJV\u003C/p\u003E\u003Cp\u003E20+ Whoso curseth his father or his mother, his lamp shall be put out in obscure darkness.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EEvery generation was once a youthful generation, blessed are those who recognize that progress and success lie in the degree and extent to which they treat those who were before them.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EEverything is an inheritance, a transference from one generation to the other. What have you inherited? And from whom? Your deeds etc will reveal what you inherited and from whom!&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EEyes are watching l!&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EJohn Franklin Tamakloe&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E",
      "createdAt": "2025-06-13T16:27:27.876Z",
      "updatedAt": "2025-06-13T18:57:02.998Z",
      "publishedAt": "2025-06-13T18:57:02.987Z",
      "slug": "a-cautionary-advice-to-a-young-friend"
    },
    {
      "id": 196,
      "documentId": "nou147v4byyvoeoy5dha8t0y",
      "title": "A Wicked Heart",
      "text": "\u003Cp\u003E\u003Cstrong\u003EA Wicked Heart\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EProverbs 24\u003C/p\u003E\u003Cp\u003EKJV\u003C/p\u003E\u003Cp\u003E29+ Say not, I will do so to him as he hath done to me: I will render to the man according to his work.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EProverbs 3\u003C/p\u003E\u003Cp\u003EKJV\u003C/p\u003E\u003Cp\u003E28+ Say not unto thy neighbour, Go, and come again, and to morrow I will give; when thou hast it by thee.\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EA wicked heart is difficult to define but is noted ( identified ) by some of the characteristics indicated in the above scripture passages. The contents of a wicked heart are seen through deeds.&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EIt is a heart that conceives, plans and executes evil as if it were for fun! A wicked heart is a heart that rejoices and stands aloof when others suffer. It is self-centred.&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EIt is also a heart full of vengeance, that knows no forgiveness unless he has paid back evil with evil. It is a vindictive heart! It is a hypocritical, pretentious heart that laughs /smiles but will stab at the first opportunity it gets&nbsp;&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003ERead the psalmist’s experience which he captured in these vivid words;&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EPsalm 41:6,9\u003C/p\u003E\u003Cp\u003ENIV\u003C/p\u003E\u003Cp\u003E[6] When one of them comes to see me, he speaks falsely, while his heart gathers slander; then he goes out and spreads it around. [9] Even my close friend, someone I trusted, one who shared my bread, has turned against me.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EA wicked heart is that heart that shops and bargains ready to sell when the price offered is right.&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EThough we live, work and walk with people with wicked hearts, there is not much that we can do except to watch, pray and hide under the protective canopy of God.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EMay we continuously search and know the type of heart we have as we are told the heart can be deceptive.&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EJeremiah 17\u003C/p\u003E\u003Cp\u003EKJV\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E9&nbsp;\u003C/strong\u003EThe heart is deceitful above all things, and desperately wicked: who can know it?\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EJohn Franklin Tamakloe&nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E",
      "createdAt": "2025-06-13T12:57:41.548Z",
      "updatedAt": "2025-06-13T19:58:53.574Z",
      "publishedAt": "2025-06-13T19:58:53.568Z",
      "slug": "a-wicked-heart"
    },
    {
      "id": 195,
      "documentId": "wxsp432g21hqe33xxb24fj5e",
      "title": "When The Tongue Is A Pen",
      "text": "\u003Cp\u003EPsalms 45\u003Cbr\u003EKJV\u003Cbr\u003E1+ My heart is inditing a good matter: I speak of the things which I have made touching the king: my tongue is the pen of a ready writer.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EPsalm 45:1&nbsp;\u003Cbr\u003ENIV\u003Cbr\u003E[1] My heart is stirred by a noble theme as I recite my verses for the king; my tongue is the pen of a skillful writer.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003ELike me, I am sure &nbsp;you don’t know, nor has it ever occurred to you that the “ &nbsp;tongue is a pen!”\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EI found this verse very interesting especially as it described the “tongue” as a pen! &nbsp;“My tongue is the pen of a skillful writer”!\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EIndeed some speak just as they write; this is a gift. Very skillful in their choices of words either spoken or written. It is always a delight to hear them speak or read what they write\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003ETo speak therefore is the same as to write with a pen, &nbsp;one is audible the other silent, they all have the same audience!\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EWords spoken or written can be classified into two categories: wise and unwise. They can make or break the spirit of their hearers or readers.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003ETherefore heed this admonition;&nbsp;\u003Cbr\u003EProverbs 25\u003Cbr\u003EKJV\u003Cbr\u003E11+ A word fitly spoken is like apples of gold in pictures of silver.\u003C/p\u003E\u003Cp\u003EProverbs 15:23&nbsp;\u003Cbr\u003ENIV\u003Cbr\u003E[23] A person finds joy in giving an apt reply---and how good is a \u003Cstrong\u003Etimely word\u003C/strong\u003E!\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETimely words \u003C/strong\u003Eare very important, read how Isaiah puts it ; &nbsp;\u003C/p\u003E\u003Cp\u003EIsaiah 50\u003Cbr\u003EKJV\u003Cbr\u003E4+ The Lord God hath given me the \u003Cstrong\u003Etongue of the learned, that I should know how to speak a word in season\u003C/strong\u003E to him that is weary: he wakeneth morning by morning, he wakeneth mine ear to hear as the learned.\u003Cbr\u003E\u003Cbr\u003EWords whether spoken or written live forever in the minds of both hearers and readers. Their effects may be forgiven or forgotten but not the words.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EOn a practical note, I’ve had many referring me to things I’ve said or written before. Some in context others taken out of context!\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EIt is also important to note that the words we speak or write will be recalled on the Day of Judgment as testimonies for or against us.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EMatthew 12\u003Cbr\u003EKJV\u003Cbr\u003E36 But I say unto you, That every idle word that men shall speak, they shall give account thereof in the day of judgment.\u003C/p\u003E\u003Cp\u003E37+ For by thy words thou shalt be justified, and by thy words thou shalt be condemned.\u003C/p\u003E\u003Cp\u003EJames also warned ;&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr\u003EJames 3:1-2&nbsp;\u003Cbr\u003ENIV\u003Cbr\u003E[1] Not many of you should become teachers, my fellow believers, because you know that we who teach will be judged more strictly.\u003C/p\u003E\u003Cp\u003E[2] We all stumble in many ways. Anyone who is never at fault in what they say is perfect, able to keep their whole body in check.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003ESo, beloved choose your words, do your best to let them be appropriate and relevant to the occasion. Be measured and economical in the use of words; either spoken or written.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EThe tongue is a pen, use it wisely! In writing we think through before we put any word on paper, in like manner train your tongue to weigh words before they are uttered.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EThe careless use of words has caused many a relationship, either friendship or marriage.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EJohn Franklin Tamakloe\u003C/p\u003E",
      "createdAt": "2025-06-13T10:25:36.325Z",
      "updatedAt": "2025-06-13T10:26:42.892Z",
      "publishedAt": "2025-06-13T10:26:42.871Z",
      "slug": "when-the-tongue-is-a-pen"
    },
    {
      "id": 194,
      "documentId": "t9t6o8jk0f0vz1jmvygc2r7r",
      "title": "The World Shall Hear Of Me Again",
      "text": "\u003Cp\u003E\u003Cbr\u003EActs 1\u003Cbr\u003EKJV\u003Cbr\u003E11+ Which also said, Ye men of Galilee, why stand ye gazing up into heaven? this same Jesus, which is taken up from you into heaven, shall so come in like manner as ye have seen him go into heaven.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EThis was said many centuries ago and has remained the main hope and expectation of all believers!&nbsp;\u003Cbr\u003ECan it truly be said that we await with preparation and expectation, &nbsp;His second coming? &nbsp;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EWhen was the last time you heard a sermon on The Second Coming? It has been assumed and therefore pushed to the back burner. This explains why the faith of many has grown cold because they’ve lost appetite for heaven. Hmmm\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003ERereading these scriptures brought to mind the famous statement often heard at the end of every Fu Manchu film series from the lips of popular actor Christopher Lee, aka Fu Manchu!\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EIn our youth (1960/70) we watched a series of films depicting a notorious underworld figure called Fu Manchu. Though at the end of every series he would be caught, yet before the film is brought to a close he would appear and utter the words “ the world shall hear of me again”\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EAs naive as we then were, this statement from Fu Manchu frightens us because we see him appear in another episode; we often wonder how he could reappear after his death! Truly, It is great to be young!\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EReading what the angel told the disciples should remind us that &nbsp;“&nbsp;\u003Cbr\u003Ethis same Jesus, which is taken up from you into heaven, shall so come in like manner as ye have seen him go into heaven.”\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EThis means Jesus will return in a physical form and not as a spirit as some claim and will be seen by all! What is unknown is the when! The ‘how’ we know, the ‘where He will come from’ &nbsp;we know.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EHave you thought about this? On that day a great mystery shall be solved as we shall see Him as He is! Whether white, black, yellow-skinned etc we don’t know. That day and hour shall declare! Truly we look forward to that day and His appearance.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EBeloved, since we don’t know the “when” let each be always ready so His return does not take him/her unaware. The question that should be of great concern &nbsp;is where will He find us? In what state or condition? Peaceful or angry, loving or hating? Etc. Think about this.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EThis question worried Fanny J Crosby (1820-1915) &nbsp;a blind songwriter which led her to write this hymn ;\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003E1.&nbsp;&nbsp;&nbsp;&nbsp;When Jesus comes to reward His servants,\u003Cbr\u003EWhether it be noon or night,\u003Cbr\u003EFaithful to Him will He find us watching,\u003Cbr\u003EWith our lamps all trimmed and bright?\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003E(Oh, can we say we are ready, brother?\u003Cbr\u003EReady for the soul’s bright home?\u003Cbr\u003ESay, will He find you and me still watching,\u003Cbr\u003EWaiting, waiting when the Lord shall come?)\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003E2\u003Cbr\u003EIf at the dawn of the early morning,\u003Cbr\u003EHe shall call us one by one,\u003Cbr\u003EWhen to the Lord we restore our talents,\u003Cbr\u003EWill He answer thee—Well done?\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003E3\u003Cbr\u003EHave we been true to the trust He left us?\u003Cbr\u003EDo we seek to do our best?\u003Cbr\u003EIf in our hearts there is naught condemns us,\u003Cbr\u003EWe shall have a glorious rest.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003E4\u003Cbr\u003EBlessed are those whom the Lord finds watching,\u003Cbr\u003EIn His glory they shall share;\u003Cbr\u003EIf He shall come at the dawn or midnight,\u003Cbr\u003EWill He find us watching there?\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EHow do we answer these questions? Yes, the world shall hear of Him again?\u003C/p\u003E\u003Cp\u003EJohn Franklin Tamakloe\u003C/p\u003E",
      "createdAt": "2025-06-11T08:18:00.474Z",
      "updatedAt": "2025-06-12T04:05:37.377Z",
      "publishedAt": "2025-06-12T04:05:37.358Z",
      "slug": "the-world-shall-hear-of-me-again"
    },
    {
      "id": 191,
      "documentId": "b1ggu4y2ryfj3tdy6nmp21nz",
      "title": "Teach Yourself How To Walk In The Truth",
      "text": "(series 5) \u003Cbr\u003E3 John 1\u003Cbr\u003EKJV\u003Cbr\u003E3 For I rejoiced greatly, when the brethren came and testified of the truth that is in thee, even as thou \u003Cb\u003Ewalkest in the truth\u003C/b\u003E.\u003Cbr\u003E4+ I have no greater joy than to hear that my children \u003Cb\u003Ewalk in truth.\u003C/b\u003E\u003Cbr\u003E\u003Cbr\u003ELife’s lessons are taught by following a systematically arranged curriculum or through experience. There is “ systematic truth “ and “ experiential Truth”. \u003Cbr\u003E\u003Cbr\u003EThe pursuit of both is recommended and desirable, but the experiential is the most preferred. An effective, useful, and successful person possesses the combination of both classroom and street ( experiential) sense! \u003Cbr\u003E\u003Cbr\u003EAs the psalmist requested, truth must be taught ; \u003Cbr\u003EPsalms 86\u003Cbr\u003EKJV\u003Cbr\u003E11+ Teach me thy way, O Lord; I will walk in thy truth: unite my heart to fear thy name.\u003Cbr\u003E\u003Cbr\u003EIn the case of Christianity, an effective useful child of God is the one who not only knows the scriptures ( theoretical) but can apply them in the real world   It is not about “ quotation “ it is about “ application”. \u003Cbr\u003E\u003Cbr\u003ETwo things are highlighted in the above scripture passages, “to walk in the truth” and “to walk in truth”. The two statements are not the same. \u003Cbr\u003E\u003Cbr\u003EThe first presupposes that there is a body of knowledge called “ the truth “  which one must uphold and apply to be described as “ walking in the truth”\u003Cbr\u003E\u003Cbr\u003ETo live and do things as stated in the scriptures is to “ walk in \u003Cb\u003Ethe\u003C/b\u003E truth as scripture is the Truth \u003Cbr\u003EJohn 17\u003Cbr\u003EKJV\u003Cbr\u003E17+ Sanctify them through thy truth: thy word is truth.\u003Cbr\u003E\u003Cbr\u003EThe question we  must ask ourselves daily is “Are we walking in \u003Cb\u003Ethe truth\u003C/b\u003E?”  Are we living lives that are consistent and in conformity with \u003Cb\u003Ethe Truth\u003C/b\u003E?” The Word.   \u003Cbr\u003E\u003Cbr\u003EThe second thought conveyed in the verses above is “ walking \u003Cb\u003Ein truth\u003C/b\u003E” To walk In Truth is simply to be sincere, honest, to be a promise keeper, reliable, trustworthy, your word is your bond. One word sums it up “ principled”. \u003Cbr\u003E\u003Cbr\u003ETo walk in the teeth gladdens the heart of God and fellow man. The Apostle John could not hide his joy when he saw and experienced the life of the children of a Christian sister. \u003Cbr\u003E\u003Cbr\u003E2 John 1\u003Cbr\u003EKJV\u003Cbr\u003E4+ I rejoiced greatly that I found of thy children walking in truth, as we have received a commandment from the Father.\u003Cbr\u003E\u003Cbr\u003EWhen the knowledge of the Word of God influences us it makes us walk in truth. We deal sincerely and honestly with people as we live principled lives. \u003Cbr\u003E\u003Cbr\u003EInterestingly, it is only fellow principled people who see this and admire the principled. The unprincipled finds it difficult to understand let alone accept them! \u003Cbr\u003E\u003Cbr\u003EYes, darkness and light can not coexist. The vulgar, rude, uncouth etc can not coexist with the disciplined, decent-minded, orderly etc. We see these every day as we relate to people. \u003Cbr\u003E\u003Cbr\u003EEver wondered why some disliked, speak evil of you, why your presence in their midst disturbs them etc? It is because you Walk In Truth. You call a spade a spade and not a shovel  You are principled! \u003Cbr\u003E\u003Cbr\u003ERead God’s promise to the principled, those who walk in truth ; \u003Cbr\u003E1 Kings 2\u003Cbr\u003EKJV\u003Cbr\u003E4+ That the Lord may continue his word which he spake concerning me, saying, \u003Cb\u003EIf thy children take heed to their way, to walk before me in truth\u003C/b\u003E with all their \u003Cb\u003Eheart\u003C/b\u003E and with all their \u003Cb\u003Esoul\u003C/b\u003E, there shall not fail thee (said he) a man on the throne of Israel.\u003Cbr\u003E\u003Cbr\u003EBeloved, teach yourself how to walk not only in \u003Cb\u003Ethe\u003C/b\u003E truth but also \u003Cb\u003Ein\u003C/b\u003E truth!\u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe",
      "createdAt": "2025-06-10T01:06:09.102Z",
      "updatedAt": "2025-06-10T01:06:09.102Z",
      "publishedAt": "2025-06-10T01:06:09.109Z",
      "slug": "teach-yourself-how-to-walk-in-the-truth"
    },
    {
      "id": 189,
      "documentId": "jx7kmjxwqxvgabsymrmg0wpu",
      "title": "Don’t Let The Green Grass Fool You!",
      "text": "Genesis 13\u003Cbr\u003EKJV\u003Cbr\u003E10+ And Lot lifted up his eyes, and beheld all the plain of Jordan, that it was well watered every where, before the Lord destroyed Sodom and Gomorrah, even as the garden of the Lord, like the land of Egypt, as thou comest unto Zoar.\u003Cbr\u003E\u003Cbr\u003EA few reading the heading to this article will recall it is the title of a popular song sang by the late legendary “soul icon “ Wilson Pickett; in our time we had singers whose songs meant  a lot their words were full of wisdom. \u003Cbr\u003E\u003Cbr\u003EWilson Pickett visited Ghana in the company of the Jackson Five ( Michael Jackson and his brothers), Staple Singers, and several other top-flight soul groups, If my memory serves me right I think Ike and Tina Turner were part to entertain Ghanaians at the Independence Square. It was a night to remember! \u003Cbr\u003E\u003Cbr\u003EThe program was arranged such that Wilson Pickett was to appear on stage exactly at midnight; which he did wearing a black slack with silver buttons that flashed dazzlingly. Guess what, he came on stage as the hour struck midnight with his evergreen song “ Midnight Hour!“ \u003Cbr\u003E\u003Cbr\u003EThe crowd yelled and surged forward  as he spoke the first words of the song “ Am gonna wait till the midnight hour”. And he did! It was a scene best seen/experienced rather than told/described. That was Ghana then! \u003Cbr\u003E\u003Cbr\u003EBeloved, the mistakes many have made ( and are still making) in life can be attributed to the exercise of poor judgment. Like Lot, many have allowed the “ green grass “to fool them. As the scriptures said,\u003Cbr\u003E “And Lot lifted up his eyes, and beheld all the plain of Jordan, that it was well watered every where,”. Lot was undiscerning! He did what is described today as “ failure to read between the lines”. \u003Cbr\u003E\u003Cbr\u003EOh, how many an undiscerning youth have lifted their eyes and beheld all the fake, pretentious lives  of glamour that celebrities portray  on tv and other social media handles ,  and thought they are real. Only to be disappointed with the passage of time. \u003Cbr\u003E\u003Cbr\u003EYes, do not let the fake green grass fool you. In use in Ghana today is an imitated synthetic made  “green grass” used mostly to decorate event grounds.  \u003Cbr\u003E\u003Cbr\u003EFor a natural “green grass” to last long and not die/dry easily the soil must be well prepared, which activity takes time. It also requires regular maintenance . Beloved, for a success to last long, it would require  a deliberate, conscious effort and  preparation .  One must be willing to invest, work hard  and wait patiently. \u003Cbr\u003E\u003Cbr\u003EThere are many today who are in life’s scrap yard , gnashing their teeth because they were fooled by the “ green grass” ! \u003Cbr\u003E\u003Cbr\u003EScripture is true, read a few ; \u003Cbr\u003EProverbs 13\u003Cbr\u003EKJV\u003Cbr\u003E11+ Wealth gotten by vanity shall be diminished: but he that gathereth by labour shall increase.\u003Cbr\u003E\u003Cbr\u003EProverbs 20\u003Cbr\u003EKJV\u003Cbr\u003E21+ An inheritance may be gotten hastily at the beginning; but the end thereof shall not be blessed.\u003Cbr\u003E\u003Cbr\u003EProverbs 28\u003Cbr\u003EKJV\u003Cbr\u003E20+ A faithful man shall abound with blessings: but he that maketh haste to be rich shall not be innocent.\u003Cbr\u003E\u003Cbr\u003EProverbs 28\u003Cbr\u003EKJV\u003Cbr\u003E22+ He that hasteth to be rich hath an evil eye, and considereth not that poverty shall come upon him.\u003Cbr\u003E\u003Cbr\u003EThe grass is not green everywhere, therefore be discerning ! Like , Lot don’t let the green grass fool you. \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:08.922Z",
      "updatedAt": "2025-06-10T01:06:08.922Z",
      "publishedAt": "2025-06-10T01:06:08.931Z",
      "slug": "don-t-let-the-green-grass-fool-you"
    },
    {
      "id": 187,
      "documentId": "moij8rn37mmwfoiiy9sc74k6",
      "title": "He Said It, And He Did It",
      "text": "Luke 24\u003Cbr\u003EKJV\u003Cbr\u003E7+ Saying, The Son of man must be delivered into the hands of sinful men, and be crucified, and the third day rise again.\u003Cbr\u003E\u003Cbr\u003EUnlike political candidates who say many things but are unable to fulfil them, all that Jesus said about himself, and what He will do or be done to Him were all fulfilled. He was an amazing Man of His Words who must be taken seriously. \u003Cbr\u003E\u003Cbr\u003EOne such prediction is what you’ve read;  that He will be betrayed, condemned and crucified and on the third day shall rise again. \u003Cbr\u003E\u003Cbr\u003EWhen He first said these many were those who doubted Him, made mockery and ridiculed  Him, but it came to pass. \u003Cbr\u003E\u003Cbr\u003EIn the early hours of the First Day of the week, the city of Jerusalem woke up to “ breaking news ! ”. \u003Cbr\u003E\u003Cbr\u003EThree women on a fact-finding mission to the cemetery where He was buried met with an empty tomb. They hurried back to town to gossip their findings to a few. They gossiped because they were afraid. \u003Cbr\u003E\u003Cbr\u003EBut as is normal with gossip no sooner had they whispered this to a few than it became news that went viral. \u003Cbr\u003E\u003Cbr\u003EReporters and stringers from the Jerusalem Chronicle, Jerusalem FM John 3:16,  Pilate FM, Matthew 27:24 and sister stations within and outside the city met with these women and interviewed them live on air. \u003Cbr\u003E\u003Cbr\u003EThey described vividly what they saw, the rolled stone, the empty tomb, and the man dressed in white who spoke to them. \u003Cbr\u003E\u003Cbr\u003EThey even repeated word for word what the white-clothed man said “Why seek ye the living among the dead? He has risen “\u003Cbr\u003E\u003Cbr\u003EYes, this is the Man Jesus. One newspaper headlined the morning’s publication with the words  “ He said it, and He did It!” The curious nature of the headline made the paper sold fast that by noon it has sold over several thousands. \u003Cbr\u003E\u003Cbr\u003EYes without a doubt , that Jesus died , was buried and on the third day rose again from the dead is an undeniable historical fact \u003Cbr\u003E\u003Cbr\u003EWe worship a risen Saviour. Upon the first day of the week as we assemble to break bread and drink of the cup let our voices and hearts rejoice   And may we do it from sincere , pure and honest hearts. \u003Cbr\u003E\u003Cbr\u003EAnd., remember he who eat and drink in an unworthy manner, ( wicked , evil , unrepentant heart) eats and drinks damnation unto himself. \u003Cbr\u003E\u003Cbr\u003EMaranatha \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:08.758Z",
      "updatedAt": "2025-06-10T01:06:08.758Z",
      "publishedAt": "2025-06-10T01:06:08.765Z",
      "slug": "he-said-it-and-he-did-it"
    },
    {
      "id": 185,
      "documentId": "nx1jsov4yw80al0s3r5pktsi",
      "title": "”Low In The Grave He Lay: For So It Is Written”",
      "text": "Psalms 16\u003Cbr\u003EKJV\u003Cbr\u003E10+ For thou wilt not leave my soul in hell; neither wilt thou suffer thine Holy One to see corruption.\u003Cbr\u003E\u003Cbr\u003EThis was said many centuries before it found its fulfilment in Christ! Before then many have lived in anticipation of when this prophecy will come to pass. \u003Cbr\u003E\u003Cbr\u003EYes, “ thou will not leave my soul in Hell; neither wilt thou suffer Thine Holy One To see corruption “. \u003Cbr\u003EThe final contest between the forces of Good and Evil, between Jesus and the Devil was that which began from His condemnation through his trial,  the crucifixion on the Cross, his burial and finally ended with His resurrection! \u003Cbr\u003E\u003Cbr\u003EYes, by His resurrection He put to shame the nay-sayers, those who out of envy condemned and crucified Him thinking they had finished Him!  \u003Cbr\u003E\u003Cbr\u003EYes, the same will be done to us who have pledged our loyalty to Him, our enemies, our doubters and naysayers shall humiliate and make a mockery of us! \u003Cbr\u003E\u003Cbr\u003EYes, beloved our enemies will bury us in disgrace, humiliation and dishonour! They will make our names a byword by soiling our image and reputation, but we shall rise to conquer in the end. \u003Cbr\u003E\u003Cbr\u003EJust like how He rose from the dead even so shall we also rise from the depth of humiliation, disgrace and dishonor that our foes have buried us. We shall rise to fame and glory in the name of Jesus. Impossibilities shall become possible. \u003Cbr\u003E\u003Cbr\u003EYes, he who laughs last laughs best! It is the doings of the Lord, disgrace and dishonor can not keep us down;  in the Name of Jesus we shall pull down the “ bars of shame “. \u003Cbr\u003E\u003Cbr\u003EA hymn writer put it this way “Death can not keep its prey, he tore the bars away, up from the grave he arose with a mighty triumph over his foes, he arose a Victor from the dark domain and for forever with His saints to reign! \u003Cbr\u003E\u003Cbr\u003EYes, Low in the grave He lay Jesus, my Savior! Waiting the coming day Jesus my Lord!\u003Cbr\u003E\u003Cbr\u003EUp from the grave He arose With a mighty triumph o'er His foes, He arose a Victor from the dark domain And He lives forever with His saints to reign \u003Cbr\u003E\u003Cbr\u003EHe arose! (He arose) He arose! (He arose) Hallelujah! Christ arose!\u003Cbr\u003E\u003Cbr\u003EVainly they watch His bed—\u003Cbr\u003E  Jesus, my Savior!\u003Cbr\u003EVainly they seal the dead—\u003Cbr\u003E  Jesus my Lord!\u003Cbr\u003E\u003Cbr\u003EDeath cannot keep his prey—\u003Cbr\u003E  Jesus, my Savior!\u003Cbr\u003EHe tore the bars away—\u003Cbr\u003E  Jesus my Lord!\u003Cbr\u003E\u003Cbr\u003EBeloved, trust in the Risen Jesus in the face of challenges, He overcame and so will you. “Enemies are not God” is an inscription I saw written on a trotro bus. Only exercise patience! Jesus overcame, and you also will overcome! \u003Cbr\u003E\u003Cbr\u003ELessons I learnt from the death, burial and the resurrection of Jesus. These I share with you. He who laughs last laughs the best! \u003Cbr\u003E\u003Cbr\u003EHave a blessed holiday \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:08.594Z",
      "updatedAt": "2025-06-10T01:06:08.594Z",
      "publishedAt": "2025-06-10T01:06:08.603Z",
      "slug": "low-in-the-grave-he-lay-for-so-it-is-written"
    },
    {
      "id": 183,
      "documentId": "htc2lqvny9sx03uja01crrjf",
      "title": "”This Our Journey Of No Return”",
      "text": "Ecclesiastes 3\u003Cbr\u003EKJV\u003Cbr\u003E22+ Wherefore I perceive that there is nothing better, than that a man should rejoice in his own works; for that is his portion: for who shall bring him to see what shall be after him?\u003Cbr\u003E\u003Cbr\u003EAsk again! “for who shall bring him to see what shall be after him?” \u003Cbr\u003E\u003Cbr\u003EIt is easy to forget that this journey that we’ve embarked on here on Earth is a one-way journey. We came with only a one-way return ticket. We can not return to our homes once we leave. \u003Cbr\u003E\u003Cbr\u003EOur visas are one-way visas and are not renewable when they expire though under certain circumstances they can be extended but not renewed. Visa extension is discretionary and is subject to conditions set by the Issuer! \u003Cbr\u003E\u003Cbr\u003EWhat is of great worry and concern to all travellers here is the undisclosed nature of the visas, especially their expiry date. No one knows when, where and how his visa will expire. How long we stay is undisclosed! \u003Cbr\u003E\u003Cbr\u003EThough many have tried to inquire,  investigate, speculate, propound theories etc; none has come out with any credible way of knowing when his/her visa will expire. \u003Cbr\u003E\u003Cbr\u003EA hymn writer once said “Though men may search they can not find, for God alone does understand” Indeed the Issuer had stamped on the front page of our passport the following; \u003Cbr\u003E\u003Cbr\u003EDeuteronomy 29:29 \u003Cbr\u003ENIV\u003Cbr\u003E[29] The secret things belong to the Lord our God, but the things revealed belong to us and to our children forever, that we may follow all the words of this law.\u003Cbr\u003E\u003Cbr\u003EThis was intended to warn us to desist from undertaking such inquiries and investigations! \u003Cbr\u003E\u003Cbr\u003EThis being the case how should we then spend our days/year’s etc.? \u003Cbr\u003E\u003Cbr\u003EFor the answers, we are privileged to have the memoirs of one person who knew this “one-way ticket “ phenomenon and spent his stay in a certain way so we shall consult him to know how we ought to spend ours! \u003Cbr\u003E\u003Cbr\u003EThere is a warning however, it is not everything he said he did that is recommended so read with care, caution and discernment! Readers are warned! \u003Cbr\u003E\u003Cbr\u003EBefore his visa expired he gave a brief expose of how he saw his stay, a frustrating and disappointing picture. Read it;\u003Cbr\u003E\u003Cbr\u003EEcclesiastes 2:18-24 \u003Cbr\u003ENIV\u003Cbr\u003E[18] I hated all the things I had toiled for under the sun because I must leave them to the one who comes after me. \u003Cbr\u003E\u003Cbr\u003E[19] And who knows whether that person will be wise or foolish? Yet they will have control over all the fruit of my toil into which I have poured my effort and skill under the sun. This too is meaningless. \u003Cbr\u003E\u003Cbr\u003E[20] So my heart began to despair over all my toilsome labor under the sun. [21] For a person may labor with wisdom, knowledge and skill, and then they must leave all they own to another who has not toiled for it. This too is meaningless and a great misfortune.\u003Cbr\u003E\u003Cbr\u003E [22] What do people get for all the toil and anxious striving with which they labor under the sun? [23] All their days their work is grief and pain; even at night their minds do not rest. This too is meaningless.\u003Cbr\u003E\u003Cbr\u003EHope was not lost to him, read what he did and hence his advice;  \u003Cbr\u003E\u003Cbr\u003E[24] \u003Cb\u003EA person can do nothing better than to eat and drink and find satisfaction in their own toil. This too, I see, is from the hand of God\u003C/b\u003E\u003Cbr\u003E\u003Cbr\u003ETo conclude take note of the following; we came with a one-way return ticket. We shall not come back again. Our visas are non-renewable, even if extended they shall surely expire. As to when we are unaware. We wish we could know how many years remain on our visas!  \u003Cbr\u003E\u003Cbr\u003EKnowing this take his advice ; \u003Cbr\u003EEcclesiastes 2:24 \u003Cbr\u003ENIV\u003Cbr\u003E[24] A person can do nothing better than to eat and drink and find satisfaction in their own toil. This too, I see, is from the hand of God,\u003Cbr\u003E\u003Cbr\u003E( Please do not “misread” or misinterpret  the word “drink” to mean go and “ chill” you are a Ghanaian I know you 🤣)\u003Cbr\u003E\u003Cbr\u003EBut on a more serious note be guided by his final advice \u003Cbr\u003E\u003Cbr\u003EEcclesiastes 11\u003Cbr\u003EKJV\u003Cbr\u003E9+ Rejoice, O young man, in thy youth; and let thy heart cheer thee in the days of thy youth, and walk in the ways of thine heart, and in the sight of thine eyes: but know thou, that for all these things God will bring thee into judgment\u003Cbr\u003E\u003Cbr\u003EEcclesiastes 12\u003Cbr\u003EKJV\u003Cbr\u003E13 Let us hear the conclusion of the whole matter: Fear God, and keep his commandments: for this is the whole duty of man.\u003Cbr\u003E\u003Cbr\u003E14+ For God shall bring every work into judgment, with every secret thing, whether it be good, or whether it be evil.\u003Cbr\u003E\u003Cbr\u003EA holiday reading I share with you! \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:08.426Z",
      "updatedAt": "2025-06-10T01:06:08.426Z",
      "publishedAt": "2025-06-10T01:06:08.438Z",
      "slug": "this-our-journey-of-no-return"
    },
    {
      "id": 181,
      "documentId": "lwd8lg5ncby5dqmqtjvbs5h7",
      "title": "”Each Day”",
      "text": "Each Day is Unique \u003Cbr\u003EIt is a Gift;\u003Cbr\u003EAppreciate, and Thank  the Giver.\u003Cbr\u003E\u003Cbr\u003EEach Day comes \u003Cbr\u003EWith its  challenges, Walk And\u003Cbr\u003EWait Patiently On the Lord! \u003Cbr\u003E\u003Cbr\u003EEach Day is an Offer Of God’s Grace, accept it Wholeheartedly And,  be Gracious to Others also! \u003Cbr\u003E\u003Cbr\u003EEach Day Is A Promise\u003Cbr\u003EFulfilled, endeavour to Fulfil \u003Cbr\u003EYours to Everyone you owe! \u003Cbr\u003E\u003Cbr\u003EEach Day is A Day of \u003Cbr\u003ERefreshment and Renewal,  \u003Cbr\u003ECreate time For Yourself! \u003Cbr\u003E\u003Cbr\u003E\u003Cb\u003EEach Day, Each Day, Each Day\u003C/b\u003E!\u003Cbr\u003E\u003Cb\u003ETreat each Day, With Care\u003C/b\u003E \u003Cbr\u003E\u003Cb\u003EWhen It passes, It will Never Come Again!\u003C/b\u003E! \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:08.260Z",
      "updatedAt": "2025-06-10T01:06:08.260Z",
      "publishedAt": "2025-06-10T01:06:08.266Z",
      "slug": "each-day"
    },
    {
      "id": 179,
      "documentId": "ndb1o5kf4lqi36utmkvj1pze",
      "title": "Long Forgotten",
      "text": "Ecclesiastes 9\u003Cbr\u003EKJV\u003Cbr\u003E5+ For the living know that they shall die: but the dead know not any thing, neither have they any more a reward; for the memory of them is forgotten.\u003Cbr\u003E\u003Cbr\u003EI have waited the whole day expecting to read from any tabloid what this day is noted for but to no avail. \u003Cbr\u003E\u003Cbr\u003EToday 17th April 1967 was the day Lt. Gen. E.K. Kotoka died as a result of the abortive coup attempt by some junior officers of the military led by Lt. S. B. Arthur. \u003Cbr\u003E\u003Cbr\u003EThis took place some fifty -eight years ago! As the Bible says this event, its initiators and victims are all long forgotten! \u003Cbr\u003E\u003Cbr\u003EBeloved, even so, shall we all be forgotten fifty-eight years from now. The majority living at that time will not remember us. \u003Cbr\u003E\u003Cbr\u003ELife will go on as it is today with no one remembering who we were! People’s interest and attention would be as it is today on the economy, the fuel price, the exchange rate etc, and how to put food on the table. \u003Cbr\u003E\u003Cbr\u003ESo, enjoy and make yourself happy while you are alive today! I am going to get myself some light -soup to drink! For we brought nothing into the world and we shall certainly carry nothing away. \u003Cbr\u003E\u003Cbr\u003ENobody will remember us fifty years from now. Gen. Kotoka died on 17th April 1967 exactly 58 years today life goes on as it was before! \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:08.059Z",
      "updatedAt": "2025-06-10T01:06:08.059Z",
      "publishedAt": "2025-06-10T01:06:08.072Z",
      "slug": "long-forgotten"
    },
    {
      "id": 177,
      "documentId": "y2h1sbojt01a3rv5qn99iqz5",
      "title": "The Low Side Of Our Profession: An Observation",
      "text": "Ephesians 4\u003Cbr\u003EKJV\u003Cbr\u003E25+ Wherefore putting away lying, speak every man truth with his neighbour: for we are members one of another.\u003Cbr\u003E\u003Cbr\u003EZechariah 8\u003Cbr\u003EKJV\u003Cbr\u003E16+ These are the things that ye shall do; Speak ye every man the truth to his neighbour; execute the judgment of truth and peace in your gates:\u003Cbr\u003E\u003Cbr\u003EOne negative practice that appears to be gaining ground among professing believers is the art of lying. Yes, you read it. \u003Cbr\u003ELike you, I’ve also asked were we born liars or we learnt them? \u003Cbr\u003E\u003Cbr\u003EThe ease at which lies are told with a straight face makes one wonder if lying is part of our nature. Some say it is part of our “fallen nature” which is true! \u003Cbr\u003E\u003Cbr\u003EBut, surely we were not born liars we learnt them, it is a habit we acquire through association. If you grew up in a lying environment the chances of you becoming one is very high! . \u003Cbr\u003E\u003Cbr\u003EIf you work or associate yourself with liars the chances of you becoming one is very high. It is also evidentially clear that certain professions thrive on lies to succeed so if you should work in such environments/professions the chances of you becoming a liar are high. \u003Cbr\u003E\u003Cbr\u003EPlease note, that I am not implying one is automatically a liar, but the chances of becoming one are high! A conscious deliberate self-restraint is what one needs to stay true to oneself in such environments /professions \u003Cbr\u003E\u003Cbr\u003EIt is therefore a “disease” that we contract through association, so let us therefore watch our associations and walk away from any that have the potential of influencing us to become liars\u003Cbr\u003E\u003Cbr\u003E“Researchers”  have found that Lie has sisters, these are “ sister rumour-monger”, “sister gossiper” “sister, hatred” and a younger “sister jealousy”  Some have given their mother’s name as “Madam Envy”! \u003Cbr\u003E\u003Cbr\u003EThey described her as a ferocious woman who does not take kindly to truth, hard work and progress anywhere by anyone,  she is feared worldwide. Read it;\u003Cbr\u003E\u003Cbr\u003EProverbs 27\u003Cbr\u003EKJV\u003Cbr\u003E4+ Wrath is cruel, and anger is outrageous; but who is able to stand before envy?\u003Cbr\u003E\u003Cbr\u003EWho is able to stand before Mrs ( Mr) Envy? \u003Cbr\u003E\u003Cbr\u003EBeloved, of great worry and concern, is how some have perfected this act of lying such that they are believed by even the wise! They know what to put together, how to present and say things, etc. \u003Cbr\u003E\u003Cbr\u003EBut why must someone lie? The reasons are many but the most important ones are,  fear, insecurity, low self-esteem, inadequacy, and the  craving for social acceptance and glorification   (You can add yours)\u003Cbr\u003E\u003Cbr\u003EBeloved,  lies do not build, it rather destroy. It has been known to be the cause of breakdowns, and divisions among hitherto peaceful and loving relationships! \u003Cbr\u003E\u003Cbr\u003EDearly beloved if we can go by what the scriptures teach, we should not experience any such unpleasant situations; which is \u003Cbr\u003E\u003Cbr\u003EEphesians 4\u003Cbr\u003EKJV\u003Cbr\u003E25+ Wherefore putting away lying, speak every man truth with his neighbour: for we are members one of another.\u003Cbr\u003E\u003Cbr\u003ETo lie is to betray a trust, and trust is the foundation on which relationships are built once betrayed everything crumbles! Many a once-strong relationship has crumbled as a result Of this act. \u003Cbr\u003E\u003Cbr\u003ETo put back the pieces ( trust ) is a Herculean task even if done it never looks the same as the original. So let us be careful about things we say to and about one another. \u003Cbr\u003E\u003Cbr\u003EMay we heed Paul’s admonition \u003Cbr\u003EColossians 4\u003Cbr\u003EKJV\u003Cbr\u003E6+ Let your speech be alway with grace, seasoned with salt, that ye may know how ye ought to answer every man.\u003Cbr\u003E\u003Cbr\u003EMay peace and truth be with and among us forever. Let us work towards achieving this! I desire to live in peace with you based on shared love and the truth we speak to each other. \u003Cbr\u003E\u003Cbr\u003EMy thoughts to share \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:07.892Z",
      "updatedAt": "2025-06-10T01:06:07.892Z",
      "publishedAt": "2025-06-10T01:06:07.898Z",
      "slug": "the-low-side-of-our-profession-an-observation"
    },
    {
      "id": 173,
      "documentId": "t08nqyfdmx254f3oi9gjrgkp",
      "title": "How Will We Be Assessed?",
      "text": "Matthew 5\u003Cbr\u003EKJV\u003Cbr\u003E20+ For I say unto you, That except your righteousness shall exceed the righteousness of the scribes and Pharisees, ye shall in no case enter into the kingdom of heaven.\u003Cbr\u003E\u003Cbr\u003EIn a recent conversation with a friend, this issue of how are we going to be assessed came up! I tried to avoid, evade, and abort it but to no avail !! I kept saying “Can we change the topic, conversation etc but he kept asking! So we sat down to discuss it in an informal manner \u003Cbr\u003E\u003Cbr\u003EMy attempt to avoid it is simple I don’t know. Though I said this several times it was such that I had to yield. So what you are about to read are views we both expressed and shared. \u003Cbr\u003E\u003Cbr\u003EWe began by asking is it possible that there would be a pass mark. A range! A cut-off point, etc? We both concluded that yes it is likely. We based our conclusion on the above passage. \u003Cbr\u003E\u003Cbr\u003EIt is a comparative passage “Except your righteousness shall exceed the righteousness of the scribes and Pharisees,”   The word “ except “ is the operative word suggesting that there is a baseline which must be crossed. \u003Cbr\u003E\u003Cbr\u003EThe “righteousness “ of the Scribes and Pharisees  was set as the baseline which must be crossed before one can “enter into the kingdom of heaven.” \u003Cbr\u003E\u003Cbr\u003EIndeed the entire context in which this verse was placed indicates that the bar is higher for Christians.\u003Cbr\u003E\u003Cbr\u003E I told some young men that the examination I wrote and passed to qualify me for a scholarship to study in the UK if it were today I’d have failed to qualify! Each generation or dispensation has its own threshold and standard of assessing who qualifies and who does not. \u003Cbr\u003E\u003Cbr\u003EIf this is so, then it follows that yes there is a criterion, a pass mark that one must attain to enter the Kingdom of Heaven. \u003Cbr\u003E\u003Cbr\u003ESo strive to attain this pass mark. The how is what follows in the second instalment. \u003Cbr\u003E\u003Cbr\u003EWhat is important is to note that living recklessly, haphazardly, carelessly thinking o God is merciful, forgiving etc and will surely grant one a place regardless is to deceive oneself. \u003Cbr\u003E\u003Cbr\u003ETo excel in school we all know what it takes;  ask to be told in case you don’t! Ask Azumah Nelson what it took him to become an undefeated champion\u003Cbr\u003E\u003Cbr\u003EEven the great apostle Paul said this about himself and his quest to make the grade.  Read it ; \u003Cbr\u003E1 Corinthians 9\u003Cbr\u003EKJV\u003Cbr\u003E27+ But I keep under my body, and bring it into subjection: lest that by any means, when I have preached to others, I myself should be a castaway.\u003Cbr\u003E\u003Cbr\u003EMy dear, there is a pass mark to be attained. Strive to make it. Before we parted company we both agreed on how difficult it would be. But we also agreed that God has given us a bonus mark; the righteousness of Christ! This has been credited to us. All that is left for us is to  “top it up”. \u003Cbr\u003E\u003Cbr\u003EGod through Christ gave us 70% look for 30% to top up! \u003Cbr\u003E\u003Cbr\u003EMatthew 5:20 \u003Cbr\u003ENIV\u003Cbr\u003E[20] For I tell you that \u003Cb\u003Eunless your righteousness qsurpasses that of the Pharisees and the teachers of the law, you will certainly not enter the kingdom of heaven\u003C/b\u003E.\u003Cbr\u003E\u003Cbr\u003EPlease this is not a doctrinal teaching or belief, it is a friendly hypothesis just to warn us of the need to be prepared! Surely we must cross a pass mark. \u003Cbr\u003EPhilippians 2:12 NIV\u003Cbr\u003E[12] Therefore, my dear friends, as you have always obeyed---not only in my presence, but now much more in my absence---continue to work out your salvation with fear and trembling,\u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:07.374Z",
      "updatedAt": "2025-06-10T01:06:07.374Z",
      "publishedAt": "2025-06-10T01:06:07.398Z",
      "slug": "how-will-we-be-assessed"
    },
    {
      "id": 171,
      "documentId": "jiqetg4h929qnholzr8om0iw",
      "title": "The Death, Burial and The Resurrection Of Jesus: Matters Arising",
      "text": "\u003Cbr\u003EMatthew 28\u003Cbr\u003EKJV\u003Cbr\u003E12 And when they were assembled with the elders and had taken counsel, they gave large money unto the soldiers,\u003Cbr\u003E\u003Cbr\u003E13+ Saying, Say ye, His disciples came by night, and stole him away while we slept.\u003Cbr\u003E\u003Cbr\u003EIn a few days, the entire World will soon lay down its tools, industries will shut down, and in some places, massive processions through principal streets will take place with palm branches being carried, signifying the triumphant entry of this man into Jerusalem  \u003Cbr\u003E\u003Cbr\u003EOthers will attempt to reenact an event that shocked the world -the death burial and resurrection of a young man who died thousands of years ago by carrying wooden crosses through the streets \u003Cbr\u003E\u003Cbr\u003EThis young man’s name is Jesus, and the event took place in a remote corner of the world, Jerusalem to be precise. \u003Cbr\u003E\u003Cbr\u003EBut why is this event regarded as significant? Why would the resurrection from the dead of this Man bring to a stop all activities of life? This is an incomprehensible global phenomenon! \u003Cbr\u003E\u003Cbr\u003ESince the beginning of time no man’s death, not presidents, monarchs etc has ever been marked worldwide than this Man. \u003Cbr\u003E\u003Cbr\u003EWhy is this man’s death observed, it is because it was by this event that Humanity gained its freedom from Death. \u003Cb\u003EThe resurrection of Jesus from the dead gave hope to a hitherto hopeless world that has until then been living in the fear of death\u003C/b\u003E. \u003Cbr\u003E\u003Cbr\u003ERead how the Hebrew writer described man’s hopeless state before the resurrection; \u003Cbr\u003E\u003Cbr\u003EHebrews 2:14-15 \u003Cbr\u003ENIV\u003Cbr\u003E[14] Since the children have flesh and blood, he too shared in their humanity so that by his death he might break the power of him who holds the power of death---that is, the devil--- \u003Cbr\u003E\u003Cbr\u003E[15] \u003Cb\u003Eand free those who all their lives were held in slavery by their fear of death\u003C/b\u003E\u003Cbr\u003E.\u003Cbr\u003EBy His resurrection, He *destroyed both the Power and Fear of  Death! \u003Cb\u003EHe brought to life immortality\u003C/b\u003E. A truth He stated while alive and confirmed by his coming out of the Grave. Read it;\u003Cbr\u003E\u003Cbr\u003EJohn 11:25-26\u003Cbr\u003E NIV\u003Cbr\u003E[25] Jesus said to her, “I am the resurrection and the life. The one who believes in me will live, even though they die; [26] and whoever lives by believing in me will never die. Do you believe this?”\u003Cbr\u003E\u003Cbr\u003EBeloved, if there is no resurrection free from the dead then we’ve been deceived and doomed forever. Because it is the resurrection that gives us hope that there is life beyond the Grave. \u003Cbr\u003E\u003Cbr\u003EIt is the resurrection of Jesus that gave us hope that we shall be given an incorruptible body with which we shall live forever. As we can all attest to  “ change and decay in all around we see”for we can not inherit the Kingdom of God while clothed in this corruptible body. \u003Cbr\u003E\u003Cbr\u003ERead all that there is about this phenomenon; \u003Cbr\u003E\u003Cbr\u003E1 Corinthians 15:42-44,50-55 \u003Cbr\u003ENIV\u003Cbr\u003E[42] So will it be with the resurrection of the dead. The body that is sown is perishable, it is raised imperishable; [43] it is sown in dishonor, it is raised in glory; it is sown in weakness, it is raised in power;\u003Cbr\u003E\u003Cbr\u003E [44] it is sown a natural body, it is raised a spiritual body. If there is a natural body, there is also a spiritual body. \u003Cbr\u003E\u003Cbr\u003E[50] I declare to you, brothers and sisters, that flesh and blood cannot inherit the kingdom of God, nor does the perishable inherit the imperishable. \u003Cbr\u003E\u003Cbr\u003E[51] Listen, I tell you a mystery: We will not all sleep, but we will all be changed--- [52] in a flash, in the twinkling of an eye, at the last trumpet. For the trumpet will sound, the dead will be raised imperishable, and we will be changed. \u003Cbr\u003E\u003Cbr\u003E[53] For the perishable must clothe itself with the imperishable, and the mortal with immortality. \u003Cbr\u003E\u003Cbr\u003E[54] When the perishable has been clothed with the imperishable, and the mortal with immortality, then the saying that is written will come true: “Death has been swallowed up in victory.”\u003Cbr\u003E\u003Cbr\u003E [55] “Where, O death, is your victory? Where, O death, is your sting?”\u003Cbr\u003E.\u003Cbr\u003EYes, the resurrection of Jesus Christ from the Grave is a breakthrough for us who have placed our faith and hope in Him. \u003Cbr\u003EThat we shall live forever is confirmed by this event that took place several centuries ago \u003Cbr\u003E\u003Cbr\u003E\u003Cb\u003EBeloved, live your life in a manner as to benefit from this event at the end of your life's journey. Do not wait till it becomes late. Act now\u003C/b\u003E! \u003Cbr\u003E\u003Cbr\u003EMaranatha! \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:07.150Z",
      "updatedAt": "2025-06-10T01:06:07.150Z",
      "publishedAt": "2025-06-10T01:06:07.165Z",
      "slug": "the-death-burial-and-the-resurrection-of-jesus-matters-arising"
    },
    {
      "id": 169,
      "documentId": "gepjw04bv1kr93z7xe59z0k6",
      "title": "Every Road",
      "text": "Every  road leads, \u003Cbr\u003ETo a Destination.\u003Cbr\u003EPleasant or Painful \u003Cbr\u003EThe Choice Is Yours!\u003Cbr\u003EAsk before you Begin!\u003Cbr\u003E\u003Cbr\u003EEvery road leads \u003Cbr\u003ETo a Destination, \u003Cbr\u003EThere is No Endless Road \u003Cbr\u003ESo be prepared, plan\u003Cbr\u003EAlways, Carry a Road Map. \u003Cbr\u003E\u003Cbr\u003EEvery Road leads \u003Cbr\u003ETo a Destination ; \u003Cbr\u003EEven if you Don’t Know \u003Cbr\u003EWhere You're Going \u003Cbr\u003EAny Road you take will lead you there. \u003Cbr\u003E\u003Cbr\u003EEvery road leads \u003Cbr\u003ETo a destination \u003Cbr\u003ELife is a Road, so Choose wisely \u003Cbr\u003EAlways remember Decisions, \u003Cbr\u003EDetermine Destinies! \u003Cbr\u003EWhere will Your Road lead you? \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:06.984Z",
      "updatedAt": "2025-06-10T01:06:06.984Z",
      "publishedAt": "2025-06-10T01:06:06.993Z",
      "slug": "every-road"
    },
    {
      "id": 167,
      "documentId": "vs6je4a73pulwcs45fki3c4h",
      "title": "”Timeless”",
      "text": "Timeless \u003Cb\u003EWords\u003C/b\u003E, remain\u003Cbr\u003EWith us even when \u003Cbr\u003EThose who Uttered \u003Cbr\u003EThem are Dead and Gone,\u003Cbr\u003EThey give Us Hope and Inspiration \u003Cbr\u003E\u003Cbr\u003ETimeless \u003Cb\u003EThoughts\u003C/b\u003E,  \u003Cbr\u003EAre thoughts that Re-appear \u003Cbr\u003EIn our Quiet Moments \u003Cbr\u003ETo put us In Remembrance of Love Ones. Cherish Them!\u003Cbr\u003E\u003Cbr\u003ETimeless \u003Cb\u003EJoys\u003C/b\u003E,\u003Cbr\u003EAre joys that Refresh, \u003Cbr\u003EAnd rekindle Spirits;\u003Cbr\u003ESo Treasure them. \u003Cbr\u003E\u003Cbr\u003E\u003Cb\u003ETimeless Words\u003C/b\u003E,\u003Cbr\u003E\u003Cb\u003ETimeless Thoughts\u003C/b\u003E, \u003Cbr\u003E\u003Cb\u003ETimeless Joys\u003C/b\u003E,\u003Cbr\u003E\u003Cb\u003EThese are Divine Medications\u003C/b\u003E;\u003Cbr\u003E\u003Cb\u003ETake them as Often as you Can\u003C/b\u003E!\u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:06.813Z",
      "updatedAt": "2025-06-10T01:06:06.813Z",
      "publishedAt": "2025-06-10T01:06:06.819Z",
      "slug": "timeless"
    },
    {
      "id": 165,
      "documentId": "eeju7qlebnf12v5bjs21x3gb",
      "title": "Footsteps",
      "text": "Psalms 17\u003Cbr\u003EKJV\u003Cbr\u003E5+ Hold up my goings in thy paths, that my footsteps slip not.\u003Cbr\u003E\u003Cbr\u003EAnytime I read this verse it reminds me of mined fields that were found in Angola during their civil war where bombs and other bobby traps are hidden in the ground waiting for the innocent to step on them and be killed. \u003Cbr\u003E\u003Cbr\u003EThe effects of these traps were very harrowing and disturbing, they left people with amputated legs, deformed bodies etc. These are the “ fortunate “ ones for the majority of those who stepped on these bombs died. \u003Cbr\u003E\u003Cbr\u003EAfter the war efforts were made to discover and demobilize these bombs. Another risky venture. Here is where the need to follow in the footsteps of others comes in. \u003Cbr\u003E\u003Cbr\u003EThose undertaking the exercise carried with them probes, types of equipment that will buzz when they detect a mined field. After these have been removed others follow in their footsteps one foot at a time.\u003Cbr\u003E\u003Cbr\u003EBeloved, this world is not a safe place it has been mined; the evil one through his agents has planted bombs in our paths to blow us off. Many are casualties because they did not follow in the steps of those who have gone before them. \u003Cbr\u003E\u003Cbr\u003EWe therefore need to follow in the footsteps of those who have gone ahead of us   Those who have detected and demobilised these hidden bombs and traps of the evil one. \u003Cbr\u003E\u003Cbr\u003ERead how some have described and recommended this practice to us ; \u003Cbr\u003E\u003Cbr\u003E 1 Corinthians 4\u003Cbr\u003EKJV\u003Cbr\u003E14 I write not these things to shame you, but as my beloved sons I warn you.\u003Cbr\u003E\u003Cbr\u003E15+ For though ye have ten thousand instructers in Christ, yet have ye, not many fathers: for in Christ Jesus I have begotten you through the gospel.\u003Cbr\u003E\u003Cbr\u003E16+ Wherefore I beseech you, be ye followers of me.\u003Cbr\u003E\u003Cbr\u003E1 Corinthians 11\u003Cbr\u003EKJV\u003Cbr\u003E1+ Be ye followers of me, even as I also am of Christ.\u003Cbr\u003E\u003Cbr\u003EPhilippians 3\u003Cbr\u003EKJV\u003Cbr\u003E17+ Brethren, be followers together of me and mark them which walk so as ye have us for an ensample.\u003Cbr\u003E\u003Cbr\u003EPhilippians 4\u003Cbr\u003EKJV\u003Cbr\u003E9+ Those things, which ye have both learned, and received, and heard, and seen in me, do: and the God of peace shall be with you.\u003Cbr\u003E\u003Cbr\u003E1 Peter 2\u003Cbr\u003EKJV\u003Cbr\u003E21+ For even hereunto were ye called: because Christ also suffered for us, leaving us an example, that ye should follow his steps:\u003Cbr\u003E\u003Cbr\u003EBeloved, to avoid stepping on any satanic bomb or bobby-trap it is highly recommended that we follow in the footsteps of Christ, the apostles and any other person whose faith and example we greatly admire.  \u003Cbr\u003E\u003Cbr\u003ELike the psalmist may we pray as he did that the Lord holds and keeps our feet steady in his paths so our feet do not slip. \u003Cbr\u003E\u003Cbr\u003EPsalms 17\u003Cbr\u003EKJV\u003Cbr\u003E5+ Hold up my goings in thy paths, that my footsteps slip not.\u003Cbr\u003E\u003Cbr\u003EA word to the wise \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:06.635Z",
      "updatedAt": "2025-06-10T01:06:06.635Z",
      "publishedAt": "2025-06-10T01:06:06.648Z",
      "slug": "footsteps"
    },
    {
      "id": 162,
      "documentId": "kvqi2jgea06ta0oj6haavokq",
      "title": "Have You Ever Asked, Why?",
      "text": "Matthew 9\u003Cbr\u003EKJV\u003Cbr\u003E30+ And their eyes were opened; and Jesus straitly charged them, saying, See that no man know it.\u003Cbr\u003E\u003Cbr\u003E31 But they, when they were departed, spread abroad his fame in all that country.\u003Cbr\u003E\u003Cbr\u003EI’ve come across a few things that Jesus said which I don’t get! One of which is what you’ve just read. You healed some people and placed a restraining order on them that they should not let anyone know! Aba! \u003Cbr\u003E\u003Cbr\u003EWho lights a candle and places it under a table? For someone to put a lit candle under a table and not on top must have a serious reason or purpose! Why? \u003Cbr\u003E\u003Cbr\u003EOn another occasion ( the transfiguration on the mountain) he placed a limited embargo on the news going out public! Limited because He set a time frame. Read it \u003Cbr\u003E\u003Cbr\u003EMatthew 17\u003Cbr\u003EKJV\u003Cbr\u003E9+ And as they came down from the mountain, Jesus charged them, saying, \u003Cb\u003ETell the vision to no man, until the Son of man be risen again from the dead\u003C/b\u003E\u003Cbr\u003E\u003Cbr\u003EAgain to another; \u003Cbr\u003EMatthew 8\u003Cbr\u003EKJV\u003Cbr\u003E4+ And Jesus saith unto him, See thou tell no man; but go thy way, shew thyself to the priest, and offer the gift that Moses commanded, for a testimony unto them.\u003Cbr\u003E\u003Cbr\u003EThe incidents recorded above and His cautions beat the mind, the fact is the news of his healing would surely give speed to his message as many will take to him; which was the very reason why he came.  And yet He forbade it. \u003Cbr\u003E\u003Cbr\u003EWho would not like to advertise his success? Surely Jesus has reasons for stopping these recipients of His blessing. Though He did not state clearly the why, observing His actions does give us a clue. \u003Cbr\u003E\u003Cbr\u003EThe truth is the more his acts of mercy spread the more enemies he made for himself.   Read this ; \u003Cbr\u003E\u003Cbr\u003EMatthew 12:13,15 \u003Cbr\u003ENIV\u003Cbr\u003E[13] Then he said to the man, “Stretch out your hand.” So he stretched it out and it was completely restored, just as sound as the other\u003Cbr\u003E\u003Cbr\u003E[14] But the Pharisees went out and plotted how they might kill Jesus.\u003Cbr\u003E\u003Cbr\u003E. [15] Aware of this, Jesus withdrew from that place. \u003Cbr\u003E\u003Cbr\u003EEven alliances of people who once were enemies, who do not see eye to eye  were formed to harm him; read it \u003Cbr\u003E\u003Cbr\u003EMark 3\u003Cbr\u003EKJV\u003Cbr\u003E6+ And the Pharisees went forth, and straightway took counsel with the Herodians against him, how they might destroy him.\u003Cbr\u003E\u003Cbr\u003EIn real life, this happens! People who disagree among themselves will unite to fight you because you are their common enemy. Hmm, life! \u003Cbr\u003E\u003Cbr\u003EI’ve heard a few try to explain the reason for Jesus’ restraint; but “me too” having considered and thought through the events/incidents have come to agree with some who think otherwise. \u003Cbr\u003E\u003Cbr\u003EThese say  “It is not everyone who should know or hear of your success”. Your failures they can be told! . \u003Cbr\u003E\u003Cbr\u003EOthers also say “do not show your wounds to everyone, not everybody has a plaster. Some will put in salt to increase your pain! “\u003Cbr\u003E\u003Cbr\u003EBeloved on a personal note as I travel through life I’ve found these sayings or admonishments to be true. Perhaps you’ve experienced it yourself except that you did not take note nor care about it! \u003Cbr\u003E\u003Cbr\u003EIt was through experience that many understood why Jesus restrained these men not to tell everybody but was specific in one case regarding those they should tell! Read it ;\u003Cbr\u003E\u003Cbr\u003EMatthew 8\u003Cbr\u003EKJV\u003Cbr\u003E4+ And Jesus saith unto him, See thou tell no man; but go thy way, \u003Cb\u003Eshew thyself to the priest\u003C/b\u003E, and offer the gift that Moses commanded, for a testimony unto them.\u003Cbr\u003E\u003Cbr\u003EHis success story brought him enemies It got to a point that He could not walk in the open, the same has happened to some in real life; they kept themselves away from the company of others. Read it ;\u003Cbr\u003EJohn 7\u003Cbr\u003EKJV\u003Cbr\u003E1+ After these things Jesus walked in Galilee: for he would not walk in Jewry, because the Jews sought to kill him.\u003Cbr\u003E\u003Cbr\u003EI’ve heard some give this same restraining order to some people they helped. They told them not to tell anyone. But good deeds can not be hidden they’ll come out just as those Jesus restrained did!! \u003Cbr\u003E\u003Cbr\u003EWell, all said and done the advice is out there and it is a choice. Not everyone should hear of your success. Not everyone should see your wounds! Be wise! Not everyone who smiles with you loves you. \u003Cbr\u003E\u003Cbr\u003EMy thoughts after thinking through why Jesus restrained some from telling people of His deeds! These are my personal opinions! \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:06.300Z",
      "updatedAt": "2025-06-10T01:06:06.300Z",
      "publishedAt": "2025-06-10T01:06:06.307Z",
      "slug": "have-you-ever-asked-why"
    },
    {
      "id": 160,
      "documentId": "bisuyofoc6y312vw5on3gdp8",
      "title": "A Worthy Advice To  Keep",
      "text": "Proverbs 3\u003Cbr\u003EKJV\u003Cbr\u003E3+ Let not mercy and truth forsake thee: bind them about thy neck; write them upon the table of thine heart:\u003Cbr\u003E4 So shalt thou find favour and good understanding in the sight of God and man.\u003Cbr\u003E\u003Cbr\u003EThe life that pleases both God and Man according to the proverbs writer rests on two pillars, mercy and truth. To show or have mercy and to speak the truth at all times. \u003Cbr\u003E\u003Cbr\u003EIs it not true that people who show mercy and speak the truth are loved, admired and appreciated by the majority except a few? \u003Cbr\u003E\u003Cbr\u003ETo understand what mercy means in practical terms read these ; \u003Cbr\u003EMatthew 25\u003Cbr\u003EKJV\u003Cbr\u003E35+ For I was an hungred, and ye gave me meat: I was thirsty, and ye gave me drink: I was a stranger, and ye took me in:\u003Cbr\u003E36+ Naked, and ye clothed me: I was sick, and ye visited me: I was in prison, and ye came unto me.\u003Cbr\u003E\u003Cbr\u003E(also read the  Parable of the Good Samaritan; that Of the Unjust Steward etc and many others ) \u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EWhat about Truth? We are to speak truth to all just as we are to show mercy to all. Here is where the difficulty lies. Whereas those who show mercy are loved those who speak truth are hated. \u003Cbr\u003E\u003Cbr\u003EIs this not a contradiction? The very person you love because he showed you mercy, the same person you hated because he told you the truth. \u003Cbr\u003E\u003Cbr\u003EBut what is truth? (You remembered Pilate!)\u003Cbr\u003E\u003Cbr\u003ELet’s begin with what truth is not, truth is not an allegation, it is not an assumption, I think, not perception, not a conjecture! Truth is a fact, even if it is hearsay you have investigated it and can confirm it with (empirical) evidence! \u003Cbr\u003E\u003Cbr\u003ERead how the Apostle John defined truth regarding the humanity of Christ when it came under dispute by the Docetists. John’s writing (1john) was a response to the philosophy called “ Docetism” derived from the Greek word “ dokea “ which translates “ to seem, look like”. \u003Cbr\u003E( More about this another time)\u003Cbr\u003E\u003Cbr\u003EJohn introduced his letter by stating who Jesus was, \u003Cbr\u003E\u003Cbr\u003E1 John 1:1-4 \u003Cbr\u003ENIV\u003Cbr\u003E[1] \u003Cb\u003EThat which was from the beginning, which we have heard, which we have seen with our eyes, which we have looked at and our hands have touched\u003C/b\u003E---this we proclaim concerning the Word of life\u003Cbr\u003E\u003Cbr\u003E. [2] The life appeared; \u003Cb\u003Ewe have seen it and testify to it\u003C/b\u003E, and we proclaim to you the eternal life, which was with the Father and \u003Cb\u003Ehas appeared to us\u003C/b\u003E. \u003Cbr\u003E\u003Cbr\u003E[3] \u003Cb\u003EWe proclaim to you what we have seen and heard\u003C/b\u003E, so that you also may have fellowship with us. And our fellowship is with the Father and with his Son, Jesus Christ. [4] We write this to make our joy complete.\u003Cbr\u003E\u003Cbr\u003ESo now you know what qualifies to be called truth. Facts. To speak truth is to say for sure and with certainty what one knows (substantiate with evidence when demanded or requested)  \u003Cbr\u003E\u003Cbr\u003E When Nathan confronted David concerning Bathsheba, he did not state a hearsay or an allegation but undeniable facts. \u003Cbr\u003E\u003Cbr\u003EThis is what the proverb writer is advising us to observe, \u003Cbr\u003EProverbs 3:1-2\u003Cbr\u003E NIV\u003Cbr\u003E[1] My son, do not forget my teaching, but keep my commands in your heart, [2] for they will prolong your life many years and bring you peace and prosperity.\u003Cbr\u003E\u003Cbr\u003E*Mercy and Truth” should not depart from you. Show mercy , yes but also be truthful! \u003Cbr\u003E\u003Cbr\u003EThese are hard, difficult and expensive but they are doable if one commits himself to doing them. There is always a price to pay for everything but the rewards surpass and are worth it. \u003Cbr\u003E\u003Cbr\u003EA thought to share \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:06.128Z",
      "updatedAt": "2025-06-10T01:06:06.128Z",
      "publishedAt": "2025-06-10T01:06:06.136Z",
      "slug": "a-worthy-advice-to-keep"
    },
    {
      "id": 158,
      "documentId": "oe16ow454rko1an4y83ghy0r",
      "title": "When Words Mean Something",
      "text": "John 1\u003Cbr\u003EKJV\u003Cbr\u003E14+ And the Word was made flesh, and dwelt among us, (and we beheld his glory, the glory as of the only begotten of the Father,) full of grace and truth.\u003Cbr\u003E\u003Cbr\u003EIn my earlier article, I made the case against inaction and the mere uttering of words! In this follow up l intend to demonstrate the example God showed us so we emulate Him. \u003Cbr\u003E\u003Cbr\u003EBefore Jesus came everything men knew about God was theoretical, hypothetical, etc.  When they hear “ God is love “ it does not make sense it sounds ok in the ears but it can not and is not comprehended in real terms. \u003Cbr\u003E\u003Cbr\u003EEverything taught to the Jews was theoretical; you’ll remember at the funeral of Lazarus Jesus engaged his sisters in a conversation.\u003Cbr\u003E\u003Cbr\u003EWell let’s replay parts of that conversation to help you understand what I mean by before Jesus came everything about God was theoretical concepts \u003Cbr\u003E\u003Cbr\u003EJohn 11:21-26 \u003Cbr\u003ENIV\u003Cbr\u003E[21] “Lord,” Martha said to Jesus, “if you had been here, my brother would not have died. [22] But I know that even now God will give you whatever you ask.”\u003Cbr\u003E\u003Cbr\u003E [23] Jesus said to her, “Your brother will rise again.” [24] Martha answered, “I know he will rise again in the resurrection at the last day.”\u003Cbr\u003E\u003Cbr\u003E [25] Jesus said to her, “I am the resurrection and the life. The one who believes in me will live, even though they die; [26] and whoever lives by believing in me will never die. Do you believe this?”\u003Cbr\u003E\u003Cbr\u003EHere the subject matter was the “ resurrection “ and from what Martha said she has heard, and been taught all about this subject but she was made to understand that it was “ futuristic”. \u003Cbr\u003E\u003Cbr\u003ENo one can fault her she was right for that was what it was! Many things they were taught at their “rabbinical school” ( makaranta! Is the Muslim version) were theoretical \u003Cbr\u003E\u003Cbr\u003ENow hear what Jesus said to her \u003Cbr\u003EJohn 11:25\u003Cbr\u003E NIV\u003Cbr\u003E[25] Jesus said to her, “\u003Cb\u003EI am the resurrection\u003C/b\u003E and the life. The one who believes in me will live, even though they die;\u003Cbr\u003E\u003Cbr\u003EJesus said “My dear in times past the resurrection was a concept, but standing right before you is the real thing -I AM THE RESURRECTION” In other words “ the word ( theory, concept) has become real! \u003Cbr\u003E\u003Cbr\u003EThis is what John meant when he said \u003Cbr\u003EJohn 1:14\u003Cbr\u003E NIV\u003Cbr\u003E[14] \u003Cb\u003EThe Word became flesh and made his dwelling among us\u003C/b\u003E. We have seen his glory, the glory of the one and only Son, who came from the Father, full of grace and truth.\u003Cbr\u003E\u003Cbr\u003EGod who in the past was a concept, imaginary thought etc took upon himself flesh so He can be seen and known, no more a theory. Fili fili! \u003Cbr\u003E\u003Cbr\u003EThis is what John said, they experienced Him, walked and ate with Him. He was real \u003Cbr\u003E\u003Cbr\u003E1 John 1:1 NIV\u003Cbr\u003E[1] That which was from the beginning, which we have heard, which we have seen with our eyes, which we have looked at and our hands have touched---this we proclaim concerning the Word of life.\u003Cbr\u003E\u003Cbr\u003ETo John, their preaching was not theoretical but experiential. This truly is what effective, powerful preaching/teaching is about. Experiential not theoretical! \u003Cbr\u003E\u003Cbr\u003EBy the coming of Jesus, the Word became flesh. God who was hitherto mere words became a reality everything said and taught about Him was made manifest and demonstrated;  made real. \u003Cbr\u003E\u003Cbr\u003EIn Christ, God backed His love for us in real terms! Beloved, God’s love for you is not a concept or theory ( mere words ) but real. \u003Cbr\u003E\u003Cbr\u003EMay we learn to practicalize our words through deeds so men will know what we mean when we say something! God showed us how to do it. \u003Cbr\u003E\u003Cbr\u003EMy thoughts to share \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:05.828Z",
      "updatedAt": "2025-06-10T01:06:05.828Z",
      "publishedAt": "2025-06-10T01:06:05.850Z",
      "slug": "when-words-mean-something"
    },
    {
      "id": 156,
      "documentId": "pvl53iy22th7sbuq0zhylpmg",
      "title": "When Words Mean Nothing, But Sounds",
      "text": "James 2\u003Cbr\u003EKJV\u003Cbr\u003E15+ If a brother or sister be naked, and destitute of daily food,\u003Cbr\u003E\u003Cbr\u003E16+ And one of you say unto them, Depart in peace, be ye warmed and filled; notwithstanding ye give them not those things which are needful to the body; what doth it profit?\u003Cbr\u003E\u003Cbr\u003EThe greatest challenge we face as Believers is our inability to translate words into deeds. If you’ve lived as long as some have you’ll understand what this means. \u003Cbr\u003E\u003Cbr\u003EJames saw firsthand how members of the congregation he attended were responding to an appeal made on behalf of a destitute hence his inspired rhetorical question. He wrote from practical experience and observation. \u003Cbr\u003E\u003Cbr\u003EIn effect, he is saying words are meaningless if not backed by deeds. We see this daily in our fellowship where some stand in the midst of the assembly and pours out their needs! In our case, beloved what do we do? We are simply asked to stand and “ commit the sister/brother to the Lord’s care”. \u003Cbr\u003E\u003Cbr\u003EA long twenty to thirty-minute prayer is said citing and quoting copious verses of scriptures to remind God (as if He has forgotten)  that he must meet the needs of the one with the request. \u003Cbr\u003E\u003Cbr\u003EWe even issue as it were a “ veiled threat “ in our prayers by asking  Him to act to avoid disgrace before unbelievers. Who will ask “Where is our God?” \u003Cbr\u003E\u003Cbr\u003EAfter the prayer as usual we walk to the needy to shake his/her hands and console and comfort him/her with more words; not a hint or personal assurance of help from us. \u003Cbr\u003E\u003Cbr\u003EThis is what James was alluding to; read it \u003Cbr\u003EJames 2:16 \u003Cbr\u003ENIV\u003Cbr\u003E[16] \u003Cb\u003EIf one of you says to them, “Go in peace; keep warm and well fed\u003C/b\u003E,” \u003Cbr\u003E\u003Cbr\u003ENyamè wô hô ôbè yè! Fama Nyame! Ôtsèsô Nyamè wô tsè à aboà entetià sô nyà bî ( forgive my poor twi!) \u003Cbr\u003E\u003Cbr\u003EThere have been instances where some have refused to tell their congregation the sufferings they are going through   When asked why, they replied  “ I know them they hear but do nothing! So I am better off not telling them”. O! \u003Cbr\u003E\u003Cbr\u003EYes,  beloved this is what happens when words mean nothing but sounds to some, and because they would not want their ears to be disturbed they prefer not to open up! \u003Cbr\u003E\u003Cbr\u003EThere is a need for us individually and collectively to examine ourselves concerning these ! Words without acts mean nothing but mere sounds to a sufferer. This trend of behaviour is very high among us. \u003Cbr\u003E\u003Cbr\u003EThe Apostle John also saw what James experienced; read how he put it; \u003Cbr\u003E\u003Cbr\u003E1 John 3:18\u003Cbr\u003E NIV\u003Cbr\u003E[18] Dear children, let us not love with words or speech but with actions and in truth.\u003Cbr\u003E\u003Cbr\u003EI, John (the minister) have also seen and continue to experience this hence what you’ve just read. My testimony and experience are shared by many! \u003Cbr\u003E\u003Cbr\u003EA word to the wise!\u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:05.611Z",
      "updatedAt": "2025-06-10T01:06:05.611Z",
      "publishedAt": "2025-06-10T01:06:05.618Z",
      "slug": "when-words-mean-nothing-but-sounds"
    },
    {
      "id": 154,
      "documentId": "mrm2ffth5odki7f3f65gxpwg",
      "title": "Concerning Registers: Which Is Which ?",
      "text": "Revelation 20\u003Cbr\u003EKJV\u003Cbr\u003E15+ And whosoever was not found written in the book of life was cast into the lake of fire.\u003Cbr\u003E\u003Cbr\u003ELocal Church records on individuals are relevant for several reasons and purposes but it should be noted that these are limited to our stay here   They’ll not be used in Heaven. Why? \u003Cbr\u003E\u003Cbr\u003EHave you asked why? Well, the question is who will carry it there? If two people are the last to remain on earth then one dies and is buried by the other what happens when the last one dies?   \u003Cbr\u003E\u003Cbr\u003EWho will bury him, and assuming the church register was in his custody who carries it to Heaven? \u003Cbr\u003E\u003Cbr\u003EI’ve said these to make the point that some think once they have their names on a church’s register that is.it; they pay no attention to anything not even their lifestyle and doings! Once they are regular at church so be it. They’ll be mentioned in Heaven! \u003Cbr\u003E\u003Cbr\u003EYou know this is not the case yet many by their actions believe it to be so. \u003Cbr\u003E\u003Cbr\u003EAs you’ve just read God or Heaven has its own register. From which qualified candidates shall be admitted. Names in  this register are not categorized or placed under the congregation's names or where they are located\u003Cbr\u003E\u003Cbr\u003EThey are individual names with no country, tribe, etc listed against them. No bond or free, no poor or rich, no black or fair complexioned, no literate or illiterate, no fool or wise! No Laborer or CEO, \u003Cbr\u003E\u003Cbr\u003EThey are simply names of people who believed that Jesus Christ is the Son of God and by believing they gave themselves to be baptized and lived their lives in line with what pleases God. \u003Cbr\u003E\u003Cbr\u003EBeloved this is all that there is to be admitted into Heaven. If you can do this you’ll be guaranteed a place! When Paul said to work out your salvation this is what he meant. \u003Cbr\u003E\u003Cbr\u003EPhilippians 2\u003Cbr\u003EKJV\u003Cbr\u003E12+ Wherefore, my beloved, as ye have always obeyed, not as in my presence only, but now much more in my absence, work out your own salvation with fear and trembling.\u003Cbr\u003E\u003Cbr\u003EChurch register good as it is for local administration purposes, is no guarantee of admission to Heaven. Heaven has its own, make sure your name is in that one. How to do that is what you’ve just read. \u003Cbr\u003E\u003Cbr\u003EAssure yourself that your name is there. I am sure you know this hymn; it is the way someone summed up what you’ve just read. \u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EMy faith has found a resting place,\u003Cbr\u003E  Not in device nor creed;\u003Cbr\u003EI trust the Ever-living One,\u003Cbr\u003E  His wounds for me shall plead.\u003Cbr\u003E \u003Cbr\u003EI need no other argument,\u003Cbr\u003E  I need no other plea;\u003Cbr\u003EIt is enough that Jesus died,\u003Cbr\u003E    And that He died for me.\u003Cbr\u003E2\u003Cbr\u003EEnough for me that Jesus saves,\u003Cbr\u003E  This ends my fear and doubt;\u003Cbr\u003EA sinful soul I come to Him,\u003Cbr\u003E  He’ll never cast me out.\u003Cbr\u003E3\u003Cbr\u003EMy heart is leaning on the Word,\u003Cbr\u003E  The written Word of God,\u003Cbr\u003ESalvation by my Savior’s name,\u003Cbr\u003E  Salvation through His blood.\u003Cbr\u003E4\u003Cbr\u003EMy great Physician heals the sick,\u003Cbr\u003E  The lost He came to save;\u003Cbr\u003EFor me His precious blood He shed,\u003Cbr\u003E  For me His life He gave.\u003Cbr\u003E\u003Cbr\u003EThoughts to share. Salvation is a personal, not a corporate endeavour \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:05.198Z",
      "updatedAt": "2025-06-10T01:06:05.198Z",
      "publishedAt": "2025-06-10T01:06:05.231Z",
      "slug": "concerning-registers-which-is-which"
    },
    {
      "id": 152,
      "documentId": "vrxmwlhlka715hsv7yr0pvq7",
      "title": "Waiting List",
      "text": "Matthew 25\u003Cbr\u003EKJV\u003Cbr\u003E41+ Then shall he say also unto them on the left hand, Depart from me, ye cursed, into everlasting fire, prepared for the devil and his angels:\u003Cbr\u003E\u003Cbr\u003EWaiting lists of any type or kind can be very frustrating. It requires patience which on many occasions is difficult to practice. \u003Cbr\u003E\u003Cbr\u003EWaiting list for interview. A waiting list for employment. A waiting list for admission into a college/university.  Waiting list to board a flight. Waiting list at Telcos office just for SIM card etc. \u003Cbr\u003E\u003Cbr\u003EIn general, let us admit that “ waiting “ is a tough time, only a few can endure it. \u003Cbr\u003E\u003Cbr\u003EIn an article I posted recently I made mention of the fact that all who believe in Jesus are on a waiting list regarding their mansion above! Do you know that in like manner all unbelievers alive today are on the waiting list of the Devil? \u003Cbr\u003E\u003Cbr\u003EEver since he fell, he has also been busy building “cubicles” not mansions for his followers. It appears he has more on his waiting list and with limited space available to him the best he can afford is a cubicle. \u003Cbr\u003E\u003Cbr\u003EIf you want to know the size of a typical cubicle the devil is putting up for his followers, beloved ask an ex-prisoner or visit a prison to see for yourself. \u003Cbr\u003E\u003Cbr\u003EYou can apply to stay in one for a night for free l am sure the Warders will be glad to grant you the request. There you’ll get a foretaste of what it means to live in the heat. \u003Cbr\u003E\u003Cbr\u003EWith this in mind let us do whatever it takes to help those who are on his waiting list to remove  their names and  place them on that of Heaven \u003Cbr\u003E\u003Cbr\u003EThe majority of these don’t know the type of housing the devil is preparing for them. It is not a mansion but a cubicle. What we would call today an oven or furnace. \u003Cbr\u003E\u003Cbr\u003ETo those whose names are on Heaven’s waiting list please do your best every day to keep your name there! It is not automatic keep checking regularly by way of how you live! \u003Cbr\u003E\u003Cbr\u003EMy thoughts to share! Please help someone today! \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:04.997Z",
      "updatedAt": "2025-06-10T01:06:04.997Z",
      "publishedAt": "2025-06-10T01:06:05.009Z",
      "slug": "waiting-list"
    },
    {
      "id": 150,
      "documentId": "ur1qslroxwulrf1mus5dsrvj",
      "title": "Ask To Be Told",
      "text": "\u003Cp\u003EAsk to be told&nbsp;\u003Cbr\u003EIs an advice&nbsp;\u003Cbr\u003EThe wise accept, the unwise ignore&nbsp;\u003Cbr\u003ETo their destruction&nbsp;\u003Cbr\u003E\u003Cbr\u003EAsk to be told&nbsp;\u003Cbr\u003EIf accepted and&nbsp;\u003Cbr\u003EFollowed, turns a Fool&nbsp;\u003Cbr\u003EInto a Wise person&nbsp;\u003Cbr\u003E\u003Cbr\u003EAsk to be told&nbsp;\u003Cbr\u003EIf obeyed and practised&nbsp;\u003Cbr\u003ETurns the ignorant\u003Cbr\u003EInto a knowledgeable&nbsp;\u003Cbr\u003E\u003Cbr\u003EAsk to be told,&nbsp;\u003Cbr\u003EAs a piece of advice Becomes handy&nbsp;\u003Cbr\u003EWhen you are at the Crossroads ;&nbsp;\u003Cbr\u003ENot knowing which way to turn\u003Cbr\u003E\u003Cbr\u003EAsk to be told,&nbsp;\u003Cbr\u003EAnd you’ll never;\u003Cbr\u003EMiss the way!&nbsp;\u003Cbr\u003ENor your blessings.&nbsp;\u003Cbr\u003E\u003Cbr\u003EAsk to be told&nbsp;\u003Cbr\u003EAlways remember&nbsp;\u003Cbr\u003EIt’s a four-word sentence&nbsp;\u003Cbr\u003ECarry it with you every day.\u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe\u003Cbr\u003E&nbsp;\u003C/p\u003E",
      "createdAt": "2025-06-10T01:06:04.833Z",
      "updatedAt": "2025-06-13T12:15:37.321Z",
      "publishedAt": "2025-06-13T12:15:37.303Z",
      "slug": "ask-to-be-told"
    },
    {
      "id": 148,
      "documentId": "mzk71m8dh3e4ub8jw0b3ovmd",
      "title": "My Gratitude To You!",
      "text": "Hebrews 6\u003Cbr\u003EKJV\u003Cbr\u003E10+ For God is not unrighteous to forget your work and labour of love, which ye have shewed toward his name, in that ye have ministered to the saints, and do minister.\u003Cbr\u003E\u003Cbr\u003EMark 9\u003Cbr\u003EKJV\u003Cbr\u003E41+ For whosoever shall give you a cup of water to drink in my name, because ye belong to Christ, verily I say unto you, he shall not lose his reward.\u003Cbr\u003E\u003Cbr\u003EThe above is my prayer for you, that God would honour His Word and promise and bring it to pass in your life. \u003Cbr\u003E\u003Cbr\u003EI received so much from you today ( Sunday ) and can not thank you individually but I’d like you to know that I appreciate everything you gave to me. \u003Cbr\u003E\u003Cbr\u003EOn behalf of my family, I say thank you. May the love that binds us together in Christ grow from strength to strength. \u003Cbr\u003E\u003Cbr\u003EJohn Franklin Tamakloe \u003Cbr\u003EMinister ( retired)\u003Cbr\u003E",
      "createdAt": "2025-06-10T01:06:04.665Z",
      "updatedAt": "2025-06-10T01:06:04.665Z",
      "publishedAt": "2025-06-10T01:06:04.672Z",
      "slug": "my-gratitude-to-you"
    }
  ],
  "meta": {
    "pagination": {
      "page": 1,
      "pageSize": 25,
      "pageCount": 2,
      "total": 33
    }
  }
}