[
  {
    "timestamp": "2025-05-28T10:10:01.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "There Is Always A Master",
    "text": "Mark 9\nKJV\n28+ And when he was come into the house, his disciples asked him privately, Why could not we cast him out? 29 And he said unto them, This kind can come forth by nothing, but by prayer and fasting.\n\nI brought a mechanic home to work on a fault in my car. He did a lot and spent a lot of time, but he could not solve the problem. \n\nHe then called for reinforcement, and in response to his call, a tall, lanky guy came. He asked that the car be turned on. He stood still for a while, listening to the sound of the engine after which He took a spanner undid a bolt, adjusted it, placed it back, and presto, everything was over. Within a few minutes! \n\nYes, in every sphere of human endeavors, there is a genius! \n\nThe same applies in the spiritual, the disciples could not heal a sick person brought to them, but Jesus did to their surprise. \n\nIn private they asked why couldn’t they do it  It was then that He revealed to them the how! . \n\n Beloved, what problems, challenges, difficulties etc are you going through? Is it spiritual, physical, material etc? There is an answer, it is with someone!  The mechanic confirmed this to me. Someone knows it better than you! \n\nThe twi proverb always holds “ wô toñ wö yarèeà, wô nyà hû adurô” to wit “ if you make known (market)  your ailment/predicament etc; you’ll get its remedy”. \n\nThere is always an answer /solution to every problem be It spiritual or physical.  This  I learnt from watching the mechanics working on my car. Someone has the solution to your problem!! Look for or go to him/her. \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-05-29T10:18:22.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "A Burdened Heart",
    "text": "1 Samuel 1\nKJV\n15+ And Hannah answered and said, No, my lord, I am a woman of a sorrowful spirit: I have drunk neither wine nor strong drink, but have poured out my soul before the Lord.\n\nLamentations 2\nKJV\n19+ Arise, cry out in the night: in the beginning of the watches pour out thine heart like water before the face of the Lord: lift up thy hands toward him for the life of thy young children, that faint for hunger in the top of every street.\n\nWe all go through life with burdened hearts! No one is exempt for we all experience pain, failure, sufferings of all kinds and disappointment! \n\nWhen our hopes and expectations are dashed it places an enormous stress and burden on our minds and hearts! As was the case of Hanna it is so with most today. \n\nMany a heart is bowed down by the weight of sorrow; pain and suffering. A line of a hymn puts it like this \n\n“ O heart bowed down with sorrow!\nO eyes that long for sight!\nThere's gladness in believing,\nIn Jesus there is light.” \n\nI share these thoughts, o heart that is bowed down with sorrow and any eyes that long for sight, recognize that there is gladness in believing! And also in Jesus, there is light. \n\nA thought to share with you! For now, the path may be cloudy; but there is light beyond. Hold on and press forward! \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-05-29T16:41:51.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "A Grateful Heart",
    "text": "Luke 17\nKJV\n17+ And Jesus answering said, Were there not ten cleansed? but where are the nine?\n18 There are not found that returned to give glory to God, save this stranger.\n19+ And he said unto him, Arise, go thy way: thy faith hath made thee whole.\n\nA well-known incident that teaches both gratitude and ingratitude! Like the missing nine, many after benefiting from the toil and sweat of benefactors often vanished into thin air! \n\nEven when they reappear,  they walk,  behave and act like they owe no one anything. Even their benefactors become their enemies, against whom they speak evil! \n\nNot so with a grateful heart, a grateful heart remembers where it came from, those whose shoulders he stood to reach whatever height he has attained! A grateful heart remembers. It is a remembering heart cultivate and nurture it. \n\n A grateful heart is a humble and not a proud heart! He acknowledges the sacrifices others made to enrich his life. \n\nA grateful heart is a heart that is indebted to all, appreciates all, and is a blessing to all. A grateful heart out of gratitude praises and does not condemn!  Do you have a grateful heart? Let it be seen through how you walk, talk and act.! \n\n1 Corinthians 4:7 \nNIV\n[7] For who makes you different from anyone else? What do you have that you did not receive? And if you did receive it, why do you boast as though you did not?\n\nA grateful thought from a grateful heart\n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-05-29T19:48:36.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "A Wicked Heart",
    "text": "Proverbs 24\nKJV\n29+ Say not, I will do so to him as he hath done to me: I will render to the man according to his work.\n\nProverbs 3\nKJV\n28+ Say not unto thy neighbour, Go, and come again, and to morrow I will give; when thou hast it by thee.\n\nA wicked heart is difficult to define but is noted ( identified ) by some of the characteristics indicated in the above scripture passages. The contents of a wicked heart are seen through Acts. \n\nIt is a heart that conceives, plans and executes evil as if it was for fun! A wicked heart is a heart that rejoices and stands aloof when others suffer. It is self-centred. \n\nIt is also a heart full of vengeance, knows no forgiveness unless he has paid back evil with evil. It is a vindictive heart! \n\nIt is a hypocritical heart that laughs /smiles with you but will stab you In the back the least opportunity it gets \n\nPsalm 41:6,9\n NIV\n[6] When one of them comes to see me, he speaks falsely, while his heart gathers slander; then he goes out and spreads it around. [9] Even my close friend, someone I trusted, one who shared my bread, has turned against me.\n\nA wicked heart is that heart that will sell you when the price offered is right. \n\nThough we live, work and walk with people with wicked hearts, there is not much that we can do except to watch, pray and hide under the protective canopy of God.\n! \nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-05-30T08:21:17.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "A Content Heart",
    "text": "1 Timothy 6\nKJV\n6+ But godliness with contentment is great gain.\n\nProverbs 16\nKJV\n8+ Better is a little with righteousness than great revenues without right.\n( The OT version) \n\nOne of the greatest challenges we face is what some have described as the “ rat race,” the chasing after an illusion! Another is “ keeping up with the Joneses.” \n\nWhile the rat race indicates chasing after what seems to us as necessary and ultimate, keeping up with the Joneses involves trying to look like, be like, or have what everybody has, measuring ourselves by ourselves. \n\nAs a result of the above, many have become breathless, tired, frustrated if not disillusioned in life! But why all this? What is it that pushes us into this state of living? \n\nThe answer is simple, *validation*. We want to be seen and recognized! And we think the only way to get this is through acquisitions! \n\nThe answer to all these is contentment! To be satisfied with what one has, I bet you is not easy with many. Why? Because they feel left out, they want to be included. \n\nSo, even though we are godly, the contentment part is missing in our lives. Godliness and contentment is a package you can but pursue without the other. \n\nGodliness with contentment is a great gain, the opposite;  contentment without godliness is a great loss. For what shall it profit a man if he gains the whole world but loses his soul? \n\nA hymn writer confessed it this way “Were the whole realm of nature mine, that were a present far too small “. \n\nContentment is one of the advices John the Baptist gave to some who came to him \n\n\nPaul lived a life of contentment, read it \nPhilippians 4\nKJV\n11+ Not that I speak in respect of want: for I have learned, in whatsoever state I am, therewith to be content.\n\nThe writer of the Hebrew letter also admonished; \nHebrews 13\nKJV\n5+ Let your conversation be without covetousness; and be content with such things as ye have: for he hath said, I will never leave thee, nor forsake thee.\n\nWe have been advised severally by many; read these, \nProverbs 15\nKJV\n16+ Better is little with the fear of the Lord than great treasure and trouble therewith.\n\nPsalms 37\nKJV\n16+ A little that a righteous man hath is better than the riches of many wicked.\n\nSo yes, pursue godliness not leaving out contentment, both go hand in hand. \n\nTo conclude on a practical note, contentment is grounded in developing and keeping a *maintenance culture*! If we can maintain whatever we have it will serve us for long. This is the secret of how to be content. \n\nMy take \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-05-31T09:29:55.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "The World Shall Hear Of Me Again",
    "text": "Acts 1\nKJV\n11+ Which also said, Ye men of Galilee, why stand ye gazing up into heaven? this same Jesus, which is taken up from you into heaven, shall so come in like manner as ye have seen him go into heaven.\n\nThis was said many centuries ago and has remained the main hope and expectation of all believers! \nCan it truly be said that we await with preparation and expectation,  His second coming?  \n\nWhen was the last time you heard a sermon on The Second Coming? It has been assumed and therefore pushed to the back burner. This explains why the faith of many has grown cold because they’ve lost appetite for heaven. Hmmm \n\nRereading these scriptures brought to mind the famous statement often heard at the end of every Fu Manchu film series from the lips of popular actor Christopher Lee, aka Fu Manchu!\n\nIn our youth (1960/70) we watched a series of films depicting a notorious underworld figure called Fu Manchu. Though at the end of every series he would be caught, yet before the film is brought to a close he would appear and utter the words “ the world shall hear of me again” \n\nAs naive as we then were, this statement from Fu Manchu frightens us because we see him appear in another episode; we often wonder how he could reappear after his death! Truly, It is great to be young! \n\nReading what the angel told the disciples should remind us that  “ \nthis same Jesus, which is taken up from you into heaven, shall so come in like manner as ye have seen him go into heaven.”\n\nThis means Jesus will return in a physical form and not as a spirit as some claim and will be seen by all! What is unknown is the when! The ‘how’ we know, the ‘where He will come from’  we know. \n\nHave you thought about this? On that day a great mystery shall be solved as we shall see Him as He is! Whether white, black, yellow-skinned etc we don’t know. That day and hour shall declare! Truly we look forward to that day and His appearance. \n\nBeloved, since we don’t know the “when” let each be always ready so His return does not take him/her unaware. The question that should be of great concern  is where will He find us? In what state or condition? Peaceful or angry, loving or hating? Etc. Think about this. \n\nThis question worried Fanny J Crosby (1820-1915)  a blind songwriter which led her to write this hymn ; \n\n1.\tWhen Jesus comes to reward His servants,\nWhether it be noon or night,\nFaithful to Him will He find us watching,\nWith our lamps all trimmed and bright?\n\n(Oh, can we say we are ready, brother?\nReady for the soul’s bright home?\nSay, will He find you and me still watching,\nWaiting, waiting when the Lord shall come?)\n\n2\nIf at the dawn of the early morning,\nHe shall call us one by one,\nWhen to the Lord we restore our talents,\nWill He answer thee—Well done?\n\n3\nHave we been true to the trust He left us?\nDo we seek to do our best?\nIf in our hearts there is naught condemns us,\nWe shall have a glorious rest.\n\n4\nBlessed are those whom the Lord finds watching,\nIn His glory they shall share;\nIf He shall come at the dawn or midnight,\nWill He find us watching there?\n\nHow do we answer these questions? Yes, the world shall hear of Him  again? \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-05-31T22:07:39.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Admission Requirements: The Case Of Heaven",
    "text": "John 3\nKJV\n3+ Jesus answered and said unto him, Verily, verily, I say unto thee, Except a man be born again, he cannot *see* the kingdom of God.\n\n5 Jesus answered, Verily, verily, I say unto thee, Except a man be born of water and of the Spirit, he cannot *enter* into the kingdom of God.\n\n7 Marvel not that I said unto thee, Ye must be born again.\n\nEvery human institution requires entry qualifications, these are the words of the Spiritual Chief Registrar stating in unambiguous terms the requirement one must possess if he/she wants to be admitted into Heaven. \n\nJust as we have Physical Registrars, even so do we have the Spiritual whose requirements must be satisfied to gain admission \n\nThe Spiritual Chief Registrar emphasized the need to be born again as a precondition, a new birth which is different and distinct from what all went through to be admitted into the physical world. \n\nHear him ;\n“Verily, verily, I say unto thee, Except a man be born of water and of the Spirit”\n\nTo show the difference between the physical and spiritual, hear Him \n“That which is born of the flesh is flesh, and that which is born of the Spirit is spirit”\n\nThrough physical birth, we were all admitted into the physical world. But to be admitted into the spiritual we must be born anew this time by water and spirit.\n\nAll who desire to gain admission to Heaven must meet these conditions; which everyone who has obeyed the words of the Spiritual Chief Registrar here done!\n\n1 Corinthians 12\nKJV\n13+ For by one Spirit are we all baptized into one body, whether we be Jews or Gentiles, whether we be bond or free; and have been all made to drink into one Spirit.\n\n1 Corinthians 12:13 \nNIV\n[13] For we were all baptized by one Spirit so as to form one body---whether Jews or Gentiles, slave or free---and we were all given the one Spirit to drink.\n\nWhen did this take place? The day you willingly surrendered to be immersed and die to the flesh and its desires. That was the day you were born anew. \n\n Admission therefore is granted to all who have met this requirement! There is no protocol admission, nothing like fee-paying, or whom you know. \n\n“Except a man be born again, he cannot *see* the kingdom of God.\n\n“Except a man be born of water and of the Spirit, he cannot *enter* into the kingdom of God”.\n\nTo “see” is one thing;  to “enter” is another. Some may “see” but will not enter! But who are these one may ask? \n\nO these are “sympathizers”.  These are those who have nothing against Christianity but will not be part of it. They do good, and live upright moral lives but are not committed to Jesus. \n\nIt is like a political party, there are members and there are sympathizers. The members are those who are registered, have party cards and pay dues. Mostly they are few. \n\nThe sympathizers are those who love, follow and vote for the party, they are unknown to the party! \n\nThe difference is when the party wins only the registered, card-bearing, dues-paying members who are rewarded.  Sympathizers “see the kingdom “ but are denied any share in it. \n\nThere are many today who are “ Christian sympathizers “who are yet to be “ born of water and the spirit” so they can enter as full members. \n\nThink again, are you a “sympathizer” or a “member? “\n\nMaranatha \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-06-02T08:12:28.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "A Question Of Religious Priorities",
    "text": "Proverbs 21\nKJV\n3 To do justice and judgment is more acceptable to the Lord than sacrifice.\n\nLike humans, God also has His priorities! It is not everything we do that pleases Him, though they do not offend Him. He takes delight in some more than others.  An example is what you’ve read above. Reread it;\n\nProverbs 21:3 \nNIV\n[3] To do what is right and just is *more acceptable* to the Lord than sacrifice.\n\nRead a few;  \n1 Samuel 15\nKJV\n22+ And Samuel said, Hath the Lord as great delight in burnt offerings and sacrifices, as in obeying the voice of the Lord? Behold, to obey is *better than* sacrifice, and to hearken than the fat of rams.\n\nMicah 6\nKJV\n7+ Will the Lord be pleased with thousands of rams, or with ten thousands of rivers of oil? shall I give my firstborn for my transgression, the fruit of my body for the sin of my soul?\n\n8+ He hath shewed thee, O man, what is good; and what doth the Lord require of thee, *but to do justly, and to love mercy, and to walk humbly with thy God*?\n\nEvery godly act pleases God, but some more than others; knowing which is the greatest challenge we face as believers. Pray for wisdom and discernment so you know which! \n\nWhen it comes to gifts, there is a proverbial statement which has stuck with me “What is a comb to a bald headed?” though he will receive,  thank and bless you for it. It is a gift, yet it is of little or no value to him!\n\nHow does God rate the services we render to Him? Keep this in mind,  some bring Him greater joy than others. Let’s do those that bring Him greater joy! \n\nA thought \n\nJohn Franklin Tamakloe\n"
  }
]