[
  {
    "timestamp": "2025-04-01T09:51:10.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Another Day Has Dawned",
    "text": "\n*Another Day has dawned,  \nAnd,  another Month has begun, \nOur hearts are filled \nWith gratitude, as we behold \nYour love, mercy and grace*. \n\nAnother Day has dawned, \nAnd, another Month has begun\nWe the living, appreciate ;\nThe gift of life you \nContinue to bless us with. \n\nAnother Day has dawned \nAnd, another Month has begun \nThrough the eyes of sinful Men;  \nThy glory may not see \nWe Your children will Adore Thee!\n\nAnother Day has dawned; \nAnd, another Month has begun, \nOur prayer and plea is,\nFather, continue to guide; \nAnd lead Us not into Temptation \nFor, Thine Is the Glory, Power and Majesty! Forever. \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-01T09:51:11.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Nothing Lasts Forever",
    "text": "Nothing in life \nIs meant to last,\nForever, not even our \nVery lives. Therefore, \nEnjoy every Moment! \n\nNothing in life,\nIs meant to last\nForever, not even Friendship\nTherefore know this, And prepare  \n\nNothing in life \nIs meant to last \nForever, everything \nIs in Transition, For \nTime and Tide wait for No Man! \n\nNothing in life,\nIs meant to last,\nForever, so make \nThe Most out of Every Opportunity \nThat comes your way \n\nNothing in Life \nIs meant to last\nForever, today We are \nTomorrow we will be more \nSo, spend every minute wisely \n\nNothing in Life \nIs meant to last \nForever, today I am “is”\nTomorrow, l will be “ was “ \nSo, boast not thyself!\n\nNothing in Life \nIs meant to last \nForever, positions are \nNot possessions Visit the Cemetery and Read \nThe Inscriptions on Tombstones!  \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-01T09:51:11.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Who Will Roll  Away The Stone?",
    "text": "Mark 16\nKJV\n3+ And they said among themselves, Who shall roll us away the stone from the door of the sepulchre?\n\nThese women faced a challenge,  which was beyond them, the question is did they not know that the tomb was sealed? Surely they’ll know since it is a tradition common among them \n\nWhat is not mentioned is the driving force behind what they tried to do. Faith. They believed that whatever it was they would get help so they went to the tomb \n\nJust as they saw, the stone has been rolled  away \n\n4 And when they looked, they saw that the stone was rolled away: for it was very great.\n\nThese women took a step of faith and as is known of God, He rewards faith.   The Hebrew writer puts it this way \n\nHebrews 11\nKJV\n6+ But without faith it is impossible to please him: for he that cometh to God must believe that he is, and that he is a *rewarder of them that diligently seek him*\n\nAre you also asking   “Who will roll away the stones?” Like these women take a step of faith, walk to the “ stone “ and you’ll be surprised as they were that the stone has been rolled away! \n\nWith faith, the impossible becomes possible, give it a try today. Here is a personal testimony last two weeks  I was faced with a great challenge “Who will roll away my stones?” was my headache. \n\nBefore the week ended, all the  “stones” were rolled away! What was impossible became possible in ways that surprised me! . \n\nYes! God rewards faith, activate your Faith. My testimony to share. \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-01T14:52:05.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "The Problem Of Filth",
    "text": "2 Corinthians 7\nKJV\n1+ Having therefore these promises, dearly beloved, let us cleanse ourselves from all filthiness of the flesh and spirit, perfecting holiness in the fear of God.\n\nThis appeal by Paul continues to be valid and of great relevance today. He made mention of two types of “ filth “ the filthiness of the flesh “ and that of the “ spirit “ ! \n\nIndeed as our cities and surroundings are engulfed by material ( physical )  filth even so are some fellowships engulfed with spiritual filth. \n\nWhat is worrying is just like how we can live the filth in our community without raising a voice; even so, we can live with the spiritual filth that surrounds us in the fellowship without raising a voice. \n\nLike society, dare to raise a voice and you’ll be shot down even so it is in some fellowships.  \n\nBut what is  “filthiness of the flesh ?” Simply put anything that contaminates and works against the natural purpose and use of the flesh. This definition is broad so you can fill in the specifics. \n\nAny moral conduct, behavior etc that contradicts the normal, acceptable standard is a filthiness Of the flesh. \n\nPaul gives a clue, read it \nRomans 1\nKJV\n26+ For this cause God gave them up unto vile affections: for even their women did change the natural use into that which is against nature:\n\n27 And likewise also the men, leaving the natural use of the woman, burned in their lust one toward another; men with men working that which is unseemly, and receiving in themselves that recompence of their error which was meet.\n\nAny abuse ( two words put together; abnormal and use =abuse, abnormal usage ) of nature results in “filthiness of the flesh” such as “gratifications” \n\nPaul is saying, dear believer now that you have switched sides by your conversion do away with any form of abuse that will make you fleshly filthy. \n\nFilthiness of the flesh therefore has to do with moral and ethical failure. \n\nDo not forget, He has said ;\n2 Corinthians 5\nKJV\n17+ Therefore if any man be in Christ, he is a new creature: old things are passed away; behold, all things have become new.\n\nWhat about “ filthiness of spirit?” This has to do with spiritual contamination, some things contaminate the spirit, negative things that take place inside us. \n\nOur evil thoughts and minds about someone or something etc. A contaminated spirit can not pray to God and expect to be heard. A contaminated spirit (heart)  can not offer an acceptable sacrifice ( worship ) to God\n\nRead what Jesus said about the filthiness of the spirit and what it can not do.  \n\n Matthew 6\nKJV\n14+ For if ye forgive men their trespasses, your heavenly Father will also forgive you:\n\n15 But if ye forgive not men their trespasses, neither will your Father forgive your trespasses.\n\nEver wondered why your prayers are not answered? Well, among other reasons it is the spiritual filth ( hatred, envy, jealousy, evil speaking etc) that is in your heart against someone which is the reason. Your spirit is contaminated, it is filthy \n\nAnother example of spiritual filth; \nMatthew 5\nKJV\n23+ Therefore if thou bring thy gift to the altar, and there rememberest that thy brother hath ought against thee;\n\n24 Leave there thy gift before the altar, and go thy way; first be reconciled to thy brother, and then come and offer thy gift.\n\nWith a spiritually filthy heart, how can one’s sacrifice be accepted? \n\nFinally, spiritual filth includes dabbling in spiritism and consulting with spiritualists, to invoke curses on perceived enemies. \n\nBeloved, this is what Paul meant by his appeal ; \n\n2 Corinthians 7:1 \nNIV\n[1] Therefore, since we have these promises, dear friends, let us purify ourselves from everything that contaminates body and spirit, perfecting holiness out of reverence for God\n\nLet us rid ourselves of any filth be it fleshly or spiritual. \n\nThoughts to share. \n\nJohn Franklin Tamakloe.\n"
  },
  {
    "timestamp": "2025-04-02T09:33:27.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Who Is A True Christian?",
    "text": "Romans 2\nKJV\n28+ For he is not a Jew, which is one outwardly; neither is that circumcision, which is outward in the flesh:\n\n29 But he is a Jew, which is one inwardly; and circumcision is that of the heart, in the spirit, and not in the letter; whose praise is not of men, but of God.\n\nI’ve been looking closely at  Paul’s observations regarding religious professions.  For example the designation, Christian is applied to anyone who attends a Church. But is this what it should be? \n\nIn interviews when one is asked what religion he professes the answer is Christianity   Meanwhile he does not live by what his faith teaches. His is an outward profession \n\nThis is what Paul was concerned about in the case of the Jew. He prides himself on being a Jew but in reality, his “ Jewishness “ is not seen through his deeds. It is only a tag or badge that he wears. \n\nBeloved, Can’t this be said of many who profess to be Christians? Isn’t our profession just a tag or a badge we wear outwardly? \n\nFrom what Paul is saying, One is not a Christian outwardly but rather inwardly. Christianity is not a badge to be worn but a life to lead. True Christianity is the outward expression of what is in the heart! \n\nIn other words, one is not a Christian by words but by deeds. Now, the question is do our deeds confirm what we profess to be? \n\nRead what Paul said is the real   definition of a Jew; \nRomans 2:29 \nNIV\n[29] No, *a person is a Jew who is one inwardly*; and circumcision is circumcision of the heart, by the Spirit, not by the written code. Such a person's praise is not from other people, but from God.\n\nApply this to our modern time, a Christian is one inward,  on whose heart is written the laws/rules of Christ. It is *deeds that define who is a Christian*!  \n\nLet as many as profess to be Christians be seen and defined by their deeds and not by the outward expression of mere words! \n\nA thought to share as it challenges me daily. A true Christian is one in deed. \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-03T10:55:25.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "What Are We After: Who Would Want To Be Homeless?",
    "text": "John 14\nKJV\n2+ In my Father's house are many mansions: if it were not so, I would have told you. I go to prepare a place for you.\n\nMy dear, it is very easy to forget why we are followers of Jesus,  this comes when we get ourselves involved in fighting over irrelevant unrelated things! \n\nThings like arguing about who is who in the church, who commands and who must obey, who smiles with me and who does not, preferring one over another,  forming and upholding alliances etc. \n\nThese are irrelevant yet they are top on the agenda of some as a result they focus on how to either undo or overdo the other. \n\nThe disciples at a point in time engaged themselves in similar irrelevant arguments in the time of Christ. Read one; \n\nMark 9\nKJV\n33+ And he came to Capernaum: and being in the house he asked them, What was it that ye disputed among yourselves by the way?\n34+ But they held their peace: for by the way they had disputed among themselves, who should be the greatest. \n\nLuke 22\nKJV\n24+ And there was also a strife among them, which of them should be accounted the greatest.\n\nEven two of them engaged their mother to lobby on their behalf. Read it; \n\nMatthew 20\nKJV\n20 Then came to him the mother of Zebedee's children with her sons, worshipping him, and desiring a certain thing of him.\n\n21+ And he said unto her, What wilt thou? She saith unto him, Grant that these my two sons may sit, the one on thy right hand, and the other on the left, in thy kingdom.\n\nBeloved,  what should engage our thoughts and minds is how to be a recipient of one of the promised mansions! What must I do to inherit one, should be our greatest concern! \n\nDear reader, be careful you don’t become a “ homeless “ person in heaven by pursuing the irrelevant to the neglecting of the relevant! \nIn actual fact, there will be none there! Which means you will not be there. Sad. \n\nRead what Paul said should occupy our thoughts and minds;\n\nPhilippians 4:8 \nNIV\n[8] Finally, brothers and sisters, whatever is true, whatever is noble, whatever is right, whatever is pure, whatever is lovely, whatever is admirable---if anything is excellent or praiseworthy---think about such things.\n\nA free *mansion*  in Heaven is to be preferred to what pertains here so think these thoughts, and concern yourself with what will get you one! \n\nWhile here, beloved let us do whatever will put our names on the “waiting- list!”\n\nMy thoughts as I relook at the words of Jesus. Is your name on the waiting -list? \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-03T13:50:05.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Gethsemane, A Visit",
    "text": "John 18\nKJV\n1+ When Jesus had spoken these words, he went forth with his disciples over the brook Cedron, where was a garden, into the which he entered, and his disciples.\n\n2+ And Judas also, which betrayed him, knew the place: for Jesus ofttimes resorted thither with his disciples.\n\nThat  Jesus loved nature,  its beauty and its therapeutic values is what you’ve read. The verse says “for Jesus ofttimes resorted thither with his disciples” \n\nTo do what? If not relax! \n\nProbably what Gethsemane was to Jesus in His time that is what Kakum, Aburi etc gardens are to us today! A place of relaxation, reflection and contemplation. \n\nI get the impression that it was a well-designed and well-kept garden with sections devoted for quiet times! A popular place \n\nIt would seem the idea of having gardens has a long history. Solomon said he  had several of them ; \nEcclesiastes 2\nKJV\n5+ I made me gardens and orchards, and I planted trees in them of all kind of fruits:\n\n6 I made me pools of water, to water therewith the wood that bringeth forth trees:\n\nSong of Solomon 4\nKJV\n16+ Awake, O north wind; and come, thou south; blow upon my garden, that the spices thereof may flow out. Let my beloved come into his garden, and eat his pleasant fruits.\n\nA Refreshing place to be! \n\nSo what is the essence of this article? To let you know that Jesus loved nature, visited and relaxed his mind and spirit! You too find time to do the same.  \n\nHere is one that will not cost you anything; take a trip to Mamfe, drive down through the forest to Tinkong, onward to Koforidua and back. You’ll be refreshed! \n\nI patronized these routes on several occasions on my way to Kumasi and can attest. \n\nOr drive through Shai towards Asutuare junction pause along the route to take in fresh air and enjoy the sight and breeze. I experienced these many years ago to Akosombo  and can attest \n\nYes, identify and patronize your “Gethsemane” but do not forget your Judas knows there and will one day give you away! It happened to Jesus, it can and will happen to you.  So be on guard. A word to the wise!! \n\nThoughts to share. \nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-06T19:02:12.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Out Of The Mouth Of Babes",
    "text": "Matthew 21\nKJV\n16+ And said unto him, Hearest thou what these say? And Jesus saith unto them, Yea; have ye never read, Out of the mouth of babes and sucklings thou hast perfected praise?\n\nPsalms 8\nKJV\n2+ Out of the mouth of babes and sucklings hast thou ordained strength because of thine enemies, that thou mightest still the enemy and the avenger.\n\nAn interesting thing happened today that I believe confirms what the above scriptures say to us. \n\nI had come out from a church service this morning and was getting ready to move away; a brother engaged me in a brief chat and while doing so a young girl of twelve; walked to me asking to talk to me! \n\nI therefore excused the brother so I could listen to this little girl. Read what she said” I have been reading your articles and do share them with friends at school, now that you are leaving us I’d like you to continue posting so I can benefit from them and share them with my friends “\n\nI was dumbfounded, with a deep surprise in my eyes! I asked myself how such a little girl like this showed a keen interest in what I write and post. \n\nShe told me how beneficial they are to her! I instantly hugged and encouraged her to continue reading and assured her I’d not stop posting to whichever platform she reads them. \n\nShe mentioned my poems, and how they sound rhythmic and easy to understand; tears welled up in my eyes. Indeed out of the mouth of babes, God has ordained His glory. \n\nWhat some adults delete, ignore, refuse to read, regard as useless, unnecessary etc is rather a material of worth and importance to a little child. \n\nYes, many are called but few shall be saved. Many are invited but only a few shall respond! Many see these articles but only a few read them. My heart was made glad by this little girl’s appreciation and appeal to me. \n\nOh God, Thy Word is true.! \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-06T19:02:13.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "My Gratitude To You!",
    "text": "Hebrews 6\nKJV\n10+ For God is not unrighteous to forget your work and labour of love, which ye have shewed toward his name, in that ye have ministered to the saints, and do minister.\n\nMark 9\nKJV\n41+ For whosoever shall give you a cup of water to drink in my name, because ye belong to Christ, verily I say unto you, he shall not lose his reward.\n\nThe above is my prayer for you, that God would honour His Word and promise and bring it to pass in your life. \n\nI received so much from you today ( Sunday ) and can not thank you individually but I’d like you to know that I appreciate everything you gave to me. \n\nOn behalf of my family, I say thank you. May the love that binds us together in Christ grow from strength to strength. \n\nJohn Franklin Tamakloe \nMinister ( retired)\n"
  },
  {
    "timestamp": "2025-04-07T11:37:25.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Ask To Be Told",
    "text": "Ask to be told \nIs an advice \nThe wise accept, the unwise ignore \nTo their destruction \n\nAsk to be told \nIf accepted and \nFollowed, turns a Fool \nInto a Wise person \n\nAsk to be told \nIf obeyed and practised \nTurns the ignorant\nInto a knowledgeable \n\nAsk to be told,  \nAs a piece of advice Becomes handy \nWhen you are at the Crossroads ; \nNot knowing which way to turn\n\nAsk to be told, \nAnd you’ll never;\nMiss the way! \nNor your blessings. \n\nAsk to be told \nAlways remember \nIt’s a four-word sentence \nCarry it with you every day \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-07T11:37:25.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Waiting List",
    "text": "Matthew 25\nKJV\n41+ Then shall he say also unto them on the left hand, Depart from me, ye cursed, into everlasting fire, prepared for the devil and his angels:\n\nWaiting lists of any type or kind can be very frustrating. It requires patience which on many occasions is difficult to practice. \n\nWaiting list for interview. A waiting list for employment. A waiting list for admission into a college/university.  Waiting list to board a flight. Waiting list at Telcos office just for SIM card etc. \n\nIn general, let us admit that “ waiting “ is a tough time, only a few can endure it. \n\nIn an article I posted recently I made mention of the fact that all who believe in Jesus are on a waiting list regarding their mansion above! Do you know that in like manner all unbelievers alive today are on the waiting list of the Devil? \n\nEver since he fell, he has also been busy building “cubicles” not mansions for his followers. It appears he has more on his waiting list and with limited space available to him the best he can afford is a cubicle. \n\nIf you want to know the size of a typical cubicle the devil is putting up for his followers, beloved ask an ex-prisoner or visit a prison to see for yourself. \n\nYou can apply to stay in one for a night for free l am sure the Warders will be glad to grant you the request. There you’ll get a foretaste of what it means to live in the heat. \n\nWith this in mind let us do whatever it takes to help those who are on his waiting list to remove  their names and  place them on that of Heaven \n\nThe majority of these don’t know the type of housing the devil is preparing for them. It is not a mansion but a cubicle. What we would call today an oven or furnace. \n\nTo those whose names are on Heaven’s waiting list please do your best every day to keep your name there! It is not automatic keep checking regularly by way of how you live! \n\nMy thoughts to share! Please help someone today! \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-07T12:26:14.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Concerning Registers: Which Is Which ?",
    "text": "Revelation 20\nKJV\n15+ And whosoever was not found written in the book of life was cast into the lake of fire.\n\nLocal Church records on individuals are relevant for several reasons and purposes but it should be noted that these are limited to our stay here   They’ll not be used in Heaven. Why? \n\nHave you asked why? Well, the question is who will carry it there? If two people are the last to remain on earth then one dies and is buried by the other what happens when the last one dies?   \n\nWho will bury him, and assuming the church register was in his custody who carries it to Heaven? \n\nI’ve said these to make the point that some think once they have their names on a church’s register that is.it; they pay no attention to anything not even their lifestyle and doings! Once they are regular at church so be it. They’ll be mentioned in Heaven! \n\nYou know this is not the case yet many by their actions believe it to be so. \n\nAs you’ve just read God or Heaven has its own register. From which qualified candidates shall be admitted. Names in  this register are not categorized or placed under the congregation's names or where they are located\n\nThey are individual names with no country, tribe, etc listed against them. No bond or free, no poor or rich, no black or fair complexioned, no literate or illiterate, no fool or wise! No Laborer or CEO, \n\nThey are simply names of people who believed that Jesus Christ is the Son of God and by believing they gave themselves to be baptized and lived their lives in line with what pleases God. \n\nBeloved this is all that there is to be admitted into Heaven. If you can do this you’ll be guaranteed a place! When Paul said to work out your salvation this is what he meant. \n\nPhilippians 2\nKJV\n12+ Wherefore, my beloved, as ye have always obeyed, not as in my presence only, but now much more in my absence, work out your own salvation with fear and trembling.\n\nChurch register good as it is for local administration purposes, is no guarantee of admission to Heaven. Heaven has its own, make sure your name is in that one. How to do that is what you’ve just read. \n\nAssure yourself that your name is there. I am sure you know this hymn; it is the way someone summed up what you’ve just read. \n\n\nMy faith has found a resting place,\n  Not in device nor creed;\nI trust the Ever-living One,\n  His wounds for me shall plead.\n \nI need no other argument,\n  I need no other plea;\nIt is enough that Jesus died,\n    And that He died for me.\n2\nEnough for me that Jesus saves,\n  This ends my fear and doubt;\nA sinful soul I come to Him,\n  He’ll never cast me out.\n3\nMy heart is leaning on the Word,\n  The written Word of God,\nSalvation by my Savior’s name,\n  Salvation through His blood.\n4\nMy great Physician heals the sick,\n  The lost He came to save;\nFor me His precious blood He shed,\n  For me His life He gave.\n\nThoughts to share. Salvation is a personal, not a corporate endeavour \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-09T10:41:14.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "When Words Mean Nothing, But Sounds",
    "text": "James 2\nKJV\n15+ If a brother or sister be naked, and destitute of daily food,\n\n16+ And one of you say unto them, Depart in peace, be ye warmed and filled; notwithstanding ye give them not those things which are needful to the body; what doth it profit?\n\nThe greatest challenge we face as Believers is our inability to translate words into deeds. If you’ve lived as long as some have you’ll understand what this means. \n\nJames saw firsthand how members of the congregation he attended were responding to an appeal made on behalf of a destitute hence his inspired rhetorical question. He wrote from practical experience and observation. \n\nIn effect, he is saying words are meaningless if not backed by deeds. We see this daily in our fellowship where some stand in the midst of the assembly and pours out their needs! In our case, beloved what do we do? We are simply asked to stand and “ commit the sister/brother to the Lord’s care”. \n\nA long twenty to thirty-minute prayer is said citing and quoting copious verses of scriptures to remind God (as if He has forgotten)  that he must meet the needs of the one with the request. \n\nWe even issue as it were a “ veiled threat “ in our prayers by asking  Him to act to avoid disgrace before unbelievers. Who will ask “Where is our God?” \n\nAfter the prayer as usual we walk to the needy to shake his/her hands and console and comfort him/her with more words; not a hint or personal assurance of help from us. \n\nThis is what James was alluding to; read it \nJames 2:16 \nNIV\n[16] *If one of you says to them, “Go in peace; keep warm and well fed*,” \n\nNyamè wô hô ôbè yè! Fama Nyame! Ôtsèsô Nyamè wô tsè à aboà entetià sô nyà bî ( forgive my poor twi!) \n\nThere have been instances where some have refused to tell their congregation the sufferings they are going through   When asked why, they replied  “ I know them they hear but do nothing! So I am better off not telling them”. O! \n\nYes,  beloved this is what happens when words mean nothing but sounds to some, and because they would not want their ears to be disturbed they prefer not to open up! \n\nThere is a need for us individually and collectively to examine ourselves concerning these ! Words without acts mean nothing but mere sounds to a sufferer. This trend of behaviour is very high among us. \n\nThe Apostle John also saw what James experienced; read how he put it; \n\n1 John 3:18\n NIV\n[18] Dear children, let us not love with words or speech but with actions and in truth.\n\nI, John (the minister) have also seen and continue to experience this hence what you’ve just read. My testimony and experience are shared by many! \n\nA word to the wise!\n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-09T12:44:27.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "When Words Mean Something",
    "text": "John 1\nKJV\n14+ And the Word was made flesh, and dwelt among us, (and we beheld his glory, the glory as of the only begotten of the Father,) full of grace and truth.\n\nIn my earlier article, I made the case against inaction and the mere uttering of words! In this follow up l intend to demonstrate the example God showed us so we emulate Him. \n\nBefore Jesus came everything men knew about God was theoretical, hypothetical, etc.  When they hear “ God is love “ it does not make sense it sounds ok in the ears but it can not and is not comprehended in real terms. \n\nEverything taught to the Jews was theoretical; you’ll remember at the funeral of Lazarus Jesus engaged his sisters in a conversation.\n\nWell let’s replay parts of that conversation to help you understand what I mean by before Jesus came everything about God was theoretical concepts \n\nJohn 11:21-26 \nNIV\n[21] “Lord,” Martha said to Jesus, “if you had been here, my brother would not have died. [22] But I know that even now God will give you whatever you ask.”\n\n [23] Jesus said to her, “Your brother will rise again.” [24] Martha answered, “I know he will rise again in the resurrection at the last day.”\n\n [25] Jesus said to her, “I am the resurrection and the life. The one who believes in me will live, even though they die; [26] and whoever lives by believing in me will never die. Do you believe this?”\n\nHere the subject matter was the “ resurrection “ and from what Martha said she has heard, and been taught all about this subject but she was made to understand that it was “ futuristic”. \n\nNo one can fault her she was right for that was what it was! Many things they were taught at their “rabbinical school” ( makaranta! Is the Muslim version) were theoretical \n\nNow hear what Jesus said to her \nJohn 11:25\n NIV\n[25] Jesus said to her, “*I am the resurrection* and the life. The one who believes in me will live, even though they die;\n\nJesus said “My dear in times past the resurrection was a concept, but standing right before you is the real thing -I AM THE RESURRECTION” In other words “ the word ( theory, concept) has become real! \n\nThis is what John meant when he said \nJohn 1:14\n NIV\n[14] *The Word became flesh and made his dwelling among us*. We have seen his glory, the glory of the one and only Son, who came from the Father, full of grace and truth.\n\nGod who in the past was a concept, imaginary thought etc took upon himself flesh so He can be seen and known, no more a theory. Fili fili! \n\nThis is what John said, they experienced Him, walked and ate with Him. He was real \n\n1 John 1:1 NIV\n[1] That which was from the beginning, which we have heard, which we have seen with our eyes, which we have looked at and our hands have touched---this we proclaim concerning the Word of life.\n\nTo John, their preaching was not theoretical but experiential. This truly is what effective, powerful preaching/teaching is about. Experiential not theoretical! \n\nBy the coming of Jesus, the Word became flesh. God who was hitherto mere words became a reality everything said and taught about Him was made manifest and demonstrated;  made real. \n\nIn Christ, God backed His love for us in real terms! Beloved, God’s love for you is not a concept or theory ( mere words ) but real. \n\nMay we learn to practicalize our words through deeds so men will know what we mean when we say something! God showed us how to do it. \n\nMy thoughts to share \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-11T10:39:25.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "A Worthy Advice To  Keep",
    "text": "Proverbs 3\nKJV\n3+ Let not mercy and truth forsake thee: bind them about thy neck; write them upon the table of thine heart:\n4 So shalt thou find favour and good understanding in the sight of God and man.\n\nThe life that pleases both God and Man according to the proverbs writer rests on two pillars, mercy and truth. To show or have mercy and to speak the truth at all times. \n\nIs it not true that people who show mercy and speak the truth are loved, admired and appreciated by the majority except a few? \n\nTo understand what mercy means in practical terms read these ; \nMatthew 25\nKJV\n35+ For I was an hungred, and ye gave me meat: I was thirsty, and ye gave me drink: I was a stranger, and ye took me in:\n36+ Naked, and ye clothed me: I was sick, and ye visited me: I was in prison, and ye came unto me.\n\n(also read the  Parable of the Good Samaritan; that Of the Unjust Steward etc and many others ) \n\n\nWhat about Truth? We are to speak truth to all just as we are to show mercy to all. Here is where the difficulty lies. Whereas those who show mercy are loved those who speak truth are hated. \n\nIs this not a contradiction? The very person you love because he showed you mercy, the same person you hated because he told you the truth. \n\nBut what is truth? (You remembered Pilate!)\n\nLet’s begin with what truth is not, truth is not an allegation, it is not an assumption, I think, not perception, not a conjecture! Truth is a fact, even if it is hearsay you have investigated it and can confirm it with (empirical) evidence! \n\nRead how the Apostle John defined truth regarding the humanity of Christ when it came under dispute by the Docetists. John’s writing (1john) was a response to the philosophy called “ Docetism” derived from the Greek word “ dokea “ which translates “ to seem, look like”. \n( More about this another time)\n\nJohn introduced his letter by stating who Jesus was, \n\n1 John 1:1-4 \nNIV\n[1] *That which was from the beginning, which we have heard, which we have seen with our eyes, which we have looked at and our hands have touched*---this we proclaim concerning the Word of life\n\n. [2] The life appeared; *we have seen it and testify to it*, and we proclaim to you the eternal life, which was with the Father and *has appeared to us*. \n\n[3] *We proclaim to you what we have seen and heard*, so that you also may have fellowship with us. And our fellowship is with the Father and with his Son, Jesus Christ. [4] We write this to make our joy complete.\n\nSo now you know what qualifies to be called truth. Facts. To speak truth is to say for sure and with certainty what one knows (substantiate with evidence when demanded or requested)  \n\n When Nathan confronted David concerning Bathsheba, he did not state a hearsay or an allegation but undeniable facts. \n\nThis is what the proverb writer is advising us to observe, \nProverbs 3:1-2\n NIV\n[1] My son, do not forget my teaching, but keep my commands in your heart, [2] for they will prolong your life many years and bring you peace and prosperity.\n\n*Mercy and Truth” should not depart from you. Show mercy , yes but also be truthful! \n\nThese are hard, difficult and expensive but they are doable if one commits himself to doing them. There is always a price to pay for everything but the rewards surpass and are worth it. \n\nA thought to share \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-11T11:39:33.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Have You Ever Asked, Why?",
    "text": "Matthew 9\nKJV\n30+ And their eyes were opened; and Jesus straitly charged them, saying, See that no man know it.\n\n31 But they, when they were departed, spread abroad his fame in all that country.\n\nI’ve come across a few things that Jesus said which I don’t get! One of which is what you’ve just read. You healed some people and placed a restraining order on them that they should not let anyone know! Aba! \n\nWho lights a candle and places it under a table? For someone to put a lit candle under a table and not on top must have a serious reason or purpose! Why? \n\nOn another occasion ( the transfiguration on the mountain) he placed a limited embargo on the news going out public! Limited because He set a time frame. Read it \n\nMatthew 17\nKJV\n9+ And as they came down from the mountain, Jesus charged them, saying, *Tell the vision to no man, until the Son of man be risen again from the dead*\n\nAgain to another; \nMatthew 8\nKJV\n4+ And Jesus saith unto him, See thou tell no man; but go thy way, shew thyself to the priest, and offer the gift that Moses commanded, for a testimony unto them.\n\nThe incidents recorded above and His cautions beat the mind, the fact is the news of his healing would surely give speed to his message as many will take to him; which was the very reason why he came.  And yet He forbade it. \n\nWho would not like to advertise his success? Surely Jesus has reasons for stopping these recipients of His blessing. Though He did not state clearly the why, observing His actions does give us a clue. \n\nThe truth is the more his acts of mercy spread the more enemies he made for himself.   Read this ; \n\nMatthew 12:13,15 \nNIV\n[13] Then he said to the man, “Stretch out your hand.” So he stretched it out and it was completely restored, just as sound as the other\n\n[14] But the Pharisees went out and plotted how they might kill Jesus.\n\n. [15] Aware of this, Jesus withdrew from that place. \n\nEven alliances of people who once were enemies, who do not see eye to eye  were formed to harm him; read it \n\nMark 3\nKJV\n6+ And the Pharisees went forth, and straightway took counsel with the Herodians against him, how they might destroy him.\n\nIn real life, this happens! People who disagree among themselves will unite to fight you because you are their common enemy. Hmm, life! \n\nI’ve heard a few try to explain the reason for Jesus’ restraint; but “me too” having considered and thought through the events/incidents have come to agree with some who think otherwise. \n\nThese say  “It is not everyone who should know or hear of your success”. Your failures they can be told! . \n\nOthers also say “do not show your wounds to everyone, not everybody has a plaster. Some will put in salt to increase your pain! “\n\nBeloved on a personal note as I travel through life I’ve found these sayings or admonishments to be true. Perhaps you’ve experienced it yourself except that you did not take note nor care about it! \n\nIt was through experience that many understood why Jesus restrained these men not to tell everybody but was specific in one case regarding those they should tell! Read it ;\n\nMatthew 8\nKJV\n4+ And Jesus saith unto him, See thou tell no man; but go thy way, *shew thyself to the priest*, and offer the gift that Moses commanded, for a testimony unto them.\n\nHis success story brought him enemies It got to a point that He could not walk in the open, the same has happened to some in real life; they kept themselves away from the company of others. Read it ;\nJohn 7\nKJV\n1+ After these things Jesus walked in Galilee: for he would not walk in Jewry, because the Jews sought to kill him.\n\nI’ve heard some give this same restraining order to some people they helped. They told them not to tell anyone. But good deeds can not be hidden they’ll come out just as those Jesus restrained did!! \n\nWell, all said and done the advice is out there and it is a choice. Not everyone should hear of your success. Not everyone should see your wounds! Be wise! Not everyone who smiles with you loves you. \n\nMy thoughts after thinking through why Jesus restrained some from telling people of His deeds! These are my personal opinions! \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-12T07:37:02.000Z",
    "sender": "John Franklin Tamakloe",
    "title": null,
    "text": ".            *Each Day*\n*Each day is a New* *Page in Your life, reflect* ;\n*And Write a New  Story* \n\n*Each Day is a New*\n*Opportunity given To correct, Past Mistakes, so take your Time to write; Do not be in a Haste!*\n\n*One Day the Book* \n*Will close And the* \n*Examiner* *will examine* \n*The content*, *What will His Verdict Be*?\n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-12T14:44:25.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Footsteps",
    "text": "Psalms 17\nKJV\n5+ Hold up my goings in thy paths, that my footsteps slip not.\n\nAnytime I read this verse it reminds me of mined fields that were found in Angola during their civil war where bombs and other bobby traps are hidden in the ground waiting for the innocent to step on them and be killed. \n\nThe effects of these traps were very harrowing and disturbing, they left people with amputated legs, deformed bodies etc. These are the “ fortunate “ ones for the majority of those who stepped on these bombs died. \n\nAfter the war efforts were made to discover and demobilize these bombs. Another risky venture. Here is where the need to follow in the footsteps of others comes in. \n\nThose undertaking the exercise carried with them probes, types of equipment that will buzz when they detect a mined field. After these have been removed others follow in their footsteps one foot at a time.\n\nBeloved, this world is not a safe place it has been mined; the evil one through his agents has planted bombs in our paths to blow us off. Many are casualties because they did not follow in the steps of those who have gone before them. \n\nWe therefore need to follow in the footsteps of those who have gone ahead of us   Those who have detected and demobilised these hidden bombs and traps of the evil one. \n\nRead how some have described and recommended this practice to us ; \n\n 1 Corinthians 4\nKJV\n14 I write not these things to shame you, but as my beloved sons I warn you.\n\n15+ For though ye have ten thousand instructers in Christ, yet have ye, not many fathers: for in Christ Jesus I have begotten you through the gospel.\n\n16+ Wherefore I beseech you, be ye followers of me.\n\n1 Corinthians 11\nKJV\n1+ Be ye followers of me, even as I also am of Christ.\n\nPhilippians 3\nKJV\n17+ Brethren, be followers together of me and mark them which walk so as ye have us for an ensample.\n\nPhilippians 4\nKJV\n9+ Those things, which ye have both learned, and received, and heard, and seen in me, do: and the God of peace shall be with you.\n\n1 Peter 2\nKJV\n21+ For even hereunto were ye called: because Christ also suffered for us, leaving us an example, that ye should follow his steps:\n\nBeloved, to avoid stepping on any satanic bomb or bobby-trap it is highly recommended that we follow in the footsteps of Christ, the apostles and any other person whose faith and example we greatly admire.  \n\nLike the psalmist may we pray as he did that the Lord holds and keeps our feet steady in his paths so our feet do not slip. \n\nPsalms 17\nKJV\n5+ Hold up my goings in thy paths, that my footsteps slip not.\n\nA word to the wise \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-15T09:37:48.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "”Timeless”",
    "text": "Timeless *Words*, remain\nWith us even when \nThose who Uttered \nThem are Dead and Gone,\nThey give Us Hope and Inspiration \n\nTimeless *Thoughts*,  \nAre thoughts that Re-appear \nIn our Quiet Moments \nTo put us In Remembrance of Love Ones. Cherish Them!\n\nTimeless *Joys*,\nAre joys that Refresh, \nAnd rekindle Spirits;\nSo Treasure them. \n\n*Timeless Words*,\n*Timeless Thoughts*, \n*Timeless Joys*,\n*These are Divine Medications*;\n*Take them as Often as you Can*!\n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-15T09:37:49.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Every Road",
    "text": "Every  road leads, \nTo a Destination.\nPleasant or Painful \nThe Choice Is Yours!\nAsk before you Begin!\n\nEvery road leads \nTo a Destination, \nThere is No Endless Road \nSo be prepared, plan\nAlways, Carry a Road Map. \n\nEvery Road leads \nTo a Destination ; \nEven if you Don’t Know \nWhere You're Going \nAny Road you take will lead you there. \n\nEvery road leads \nTo a destination \nLife is a Road, so Choose wisely \nAlways remember Decisions, \nDetermine Destinies! \nWhere will Your Road lead you? \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-16T10:14:59.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "The Death, Burial and The Resurrection Of Jesus: Matters Arising",
    "text": "\nMatthew 28\nKJV\n12 And when they were assembled with the elders and had taken counsel, they gave large money unto the soldiers,\n\n13+ Saying, Say ye, His disciples came by night, and stole him away while we slept.\n\nIn a few days, the entire World will soon lay down its tools, industries will shut down, and in some places, massive processions through principal streets will take place with palm branches being carried, signifying the triumphant entry of this man into Jerusalem  \n\nOthers will attempt to reenact an event that shocked the world -the death burial and resurrection of a young man who died thousands of years ago by carrying wooden crosses through the streets \n\nThis young man’s name is Jesus, and the event took place in a remote corner of the world, Jerusalem to be precise. \n\nBut why is this event regarded as significant? Why would the resurrection from the dead of this Man bring to a stop all activities of life? This is an incomprehensible global phenomenon! \n\nSince the beginning of time no man’s death, not presidents, monarchs etc has ever been marked worldwide than this Man. \n\nWhy is this man’s death observed, it is because it was by this event that Humanity gained its freedom from Death. *The resurrection of Jesus from the dead gave hope to a hitherto hopeless world that has until then been living in the fear of death*. \n\nRead how the Hebrew writer described man’s hopeless state before the resurrection; \n\nHebrews 2:14-15 \nNIV\n[14] Since the children have flesh and blood, he too shared in their humanity so that by his death he might break the power of him who holds the power of death---that is, the devil--- \n\n[15] *and free those who all their lives were held in slavery by their fear of death*\n.\nBy His resurrection, He *destroyed both the Power and Fear of  Death! *He brought to life immortality*. A truth He stated while alive and confirmed by his coming out of the Grave. Read it;\n\nJohn 11:25-26\n NIV\n[25] Jesus said to her, “I am the resurrection and the life. The one who believes in me will live, even though they die; [26] and whoever lives by believing in me will never die. Do you believe this?”\n\nBeloved, if there is no resurrection free from the dead then we’ve been deceived and doomed forever. Because it is the resurrection that gives us hope that there is life beyond the Grave. \n\nIt is the resurrection of Jesus that gave us hope that we shall be given an incorruptible body with which we shall live forever. As we can all attest to  “ change and decay in all around we see”for we can not inherit the Kingdom of God while clothed in this corruptible body. \n\nRead all that there is about this phenomenon; \n\n1 Corinthians 15:42-44,50-55 \nNIV\n[42] So will it be with the resurrection of the dead. The body that is sown is perishable, it is raised imperishable; [43] it is sown in dishonor, it is raised in glory; it is sown in weakness, it is raised in power;\n\n [44] it is sown a natural body, it is raised a spiritual body. If there is a natural body, there is also a spiritual body. \n\n[50] I declare to you, brothers and sisters, that flesh and blood cannot inherit the kingdom of God, nor does the perishable inherit the imperishable. \n\n[51] Listen, I tell you a mystery: We will not all sleep, but we will all be changed--- [52] in a flash, in the twinkling of an eye, at the last trumpet. For the trumpet will sound, the dead will be raised imperishable, and we will be changed. \n\n[53] For the perishable must clothe itself with the imperishable, and the mortal with immortality. \n\n[54] When the perishable has been clothed with the imperishable, and the mortal with immortality, then the saying that is written will come true: “Death has been swallowed up in victory.”\n\n [55] “Where, O death, is your victory? Where, O death, is your sting?”\n.\nYes, the resurrection of Jesus Christ from the Grave is a breakthrough for us who have placed our faith and hope in Him. \nThat we shall live forever is confirmed by this event that took place several centuries ago \n\n*Beloved, live your life in a manner as to benefit from this event at the end of your life's journey. Do not wait till it becomes late. Act now*! \n\nMaranatha! \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-16T11:01:05.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "How Will We Be Assessed?",
    "text": "Matthew 5\nKJV\n20+ For I say unto you, That except your righteousness shall exceed the righteousness of the scribes and Pharisees, ye shall in no case enter into the kingdom of heaven.\n\nIn a recent conversation with a friend, this issue of how are we going to be assessed came up! I tried to avoid, evade, and abort it but to no avail !! I kept saying “Can we change the topic, conversation etc but he kept asking! So we sat down to discuss it in an informal manner \n\nMy attempt to avoid it is simple I don’t know. Though I said this several times it was such that I had to yield. So what you are about to read are views we both expressed and shared. \n\nWe began by asking is it possible that there would be a pass mark. A range! A cut-off point, etc? We both concluded that yes it is likely. We based our conclusion on the above passage. \n\nIt is a comparative passage “Except your righteousness shall exceed the righteousness of the scribes and Pharisees,”   The word “ except “ is the operative word suggesting that there is a baseline which must be crossed. \n\nThe “righteousness “ of the Scribes and Pharisees  was set as the baseline which must be crossed before one can “enter into the kingdom of heaven.” \n\nIndeed the entire context in which this verse was placed indicates that the bar is higher for Christians.\n\n I told some young men that the examination I wrote and passed to qualify me for a scholarship to study in the UK if it were today I’d have failed to qualify! Each generation or dispensation has its own threshold and standard of assessing who qualifies and who does not. \n\nIf this is so, then it follows that yes there is a criterion, a pass mark that one must attain to enter the Kingdom of Heaven. \n\nSo strive to attain this pass mark. The how is what follows in the second instalment. \n\nWhat is important is to note that living recklessly, haphazardly, carelessly thinking o God is merciful, forgiving etc and will surely grant one a place regardless is to deceive oneself. \n\nTo excel in school we all know what it takes;  ask to be told in case you don’t! Ask Azumah Nelson what it took him to become an undefeated champion\n\nEven the great apostle Paul said this about himself and his quest to make the grade.  Read it ; \n1 Corinthians 9\nKJV\n27+ But I keep under my body, and bring it into subjection: lest that by any means, when I have preached to others, I myself should be a castaway.\n\nMy dear, there is a pass mark to be attained. Strive to make it. Before we parted company we both agreed on how difficult it would be. But we also agreed that God has given us a bonus mark; the righteousness of Christ! This has been credited to us. All that is left for us is to  “top it up”. \n\nGod through Christ gave us 70% look for 30% to top up! \n\nMatthew 5:20 \nNIV\n[20] For I tell you that *unless your righteousness qsurpasses that of the Pharisees and the teachers of the law, you will certainly not enter the kingdom of heaven*.\n\nPlease this is not a doctrinal teaching or belief, it is a friendly hypothesis just to warn us of the need to be prepared! Surely we must cross a pass mark. \nPhilippians 2:12 NIV\n[12] Therefore, my dear friends, as you have always obeyed---not only in my presence, but now much more in my absence---continue to work out your salvation with fear and trembling,\n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-17T21:34:40.000Z",
    "sender": "John Franklin Tamakloe",
    "title": null,
    "text": "**How Will We Be Assessed: A Guide-list* \n(Part 2 )\nMatthew 5\nKJV\n20+ For I say unto you, That except your righteousness shall exceed the righteousness of the scribes and Pharisees, ye shall in no case enter into the kingdom of heaven.\n\nEvery educational institution or professional body publishes a guide list to help candidates who are preparing for their examinations. These are made up of the syllabus and occasionally some past examination questions and answers all intended to help prospective students. \n\nIn like manner as Believers, we also have the syllabus, some past questions and the form and format the Heavenly qualifying examinations will take! In our case the book containing these rules, guidelines etc is called the Bible. \n\nIt is divided into two distinctive parts, namely OT and NT, candidates are strictly warned to take note of these divisions; mastery and knowledge of all divisions are necessary to help potential candidates answer questions properly. \n\nOf note is the warning to pay closer attention to the section labeled NT as most questions shall be set from this part of the syllabus \n\nRead part of this information for the avoidance of doubt ;\n\nRomans 15:4 \nNIV\n[4] For everything that was written in the past was written to teach us, so that through the endurance taught in the Scriptures and the encouragement they provide we might have hope. \n\n1 Corinthians 10:11 \nNIV\n[11] These things happened to them as examples and were written down as warnings for us, on whom the culmination of the ages has come.\n\nProspective candidates are told to pay closer attention to the contents of the NT sections of the syllabus since questions from that part shall receive high marks.\n\nJames 2\nKJV\n12+ So speak ye, and so do, as they that shall be judged by the law of liberty.\n\nJames 1\nKJV\n25+ But whoso looketh into the perfect law of liberty, and continueth therein, he being not a forgetful hearer, but a doer of the work, this man shall be blessed in his deed.\n\nSo high marks are attached to questions answered from the NT syllabus!\n\nSo we know the section ( NT)  from which our assessment shall be based. Make sure you study this section very well. Acquaint yourself with the stories, narratives, examples etc \n\nPart 3 follows \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-17T21:34:40.000Z",
    "sender": "John Franklin Tamakloe",
    "title": null,
    "text": "*How Will We Be Assessed: A Guide-list* \n(Part 3 )\nMatthew 5\nKJV\n20+ For I say unto you, That except your righteousness shall exceed the righteousness of the scribes and Pharisees, ye shall in no case enter into the kingdom of heaven.\n\nIn this section we proposed to look at some potential questions that are likely to appear in paper (1) one ‘ The papers would be divided into three or more sections depending on the level of the candidate. \n\nThere will be a section for new converts who die early, another for members of long duration, and sections for bible class teachers, men/women/youth leaders of any kind, deacons, preachers and elders. \n\nThis we learn from reading this ;\n Luke 12:47-48 \nNIV\n[47] “The servant who knows the master's will and does not get ready or does not do what the master wants will be beaten with many blows.\n\n [48] But the one who does not know and does things deserving punishment will be beaten with few blows. *From everyone who has been given much, much will be demanded; and from the one who has been entrusted with much, much more will be asked*\n\nWe shall all not be asked the same questions! It shall begin with the lighter to the weightier depending on who, when and what you are in the church. \n\nSo those who think the positions/offices they occupy in the church are for show show, hence lacking in diligence etc;  should take note of the nature of the questions that await them and the sanctions that are attached and be well prepared.\n\nAs you occupy and enjoy the high tables you are offered at public places to the full glare, applause and admiration of the many; be aware of the tough questions that await you! \n\nPart 4 follows \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-17T21:34:41.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "The Low Side Of Our Profession: An Observation",
    "text": "Ephesians 4\nKJV\n25+ Wherefore putting away lying, speak every man truth with his neighbour: for we are members one of another.\n\nZechariah 8\nKJV\n16+ These are the things that ye shall do; Speak ye every man the truth to his neighbour; execute the judgment of truth and peace in your gates:\n\nOne negative practice that appears to be gaining ground among professing believers is the art of lying. Yes, you read it. \nLike you, I’ve also asked were we born liars or we learnt them? \n\nThe ease at which lies are told with a straight face makes one wonder if lying is part of our nature. Some say it is part of our “fallen nature” which is true! \n\nBut, surely we were not born liars we learnt them, it is a habit we acquire through association. If you grew up in a lying environment the chances of you becoming one is very high! . \n\nIf you work or associate yourself with liars the chances of you becoming one is very high. It is also evidentially clear that certain professions thrive on lies to succeed so if you should work in such environments/professions the chances of you becoming a liar are high. \n\nPlease note, that I am not implying one is automatically a liar, but the chances of becoming one are high! A conscious deliberate self-restraint is what one needs to stay true to oneself in such environments /professions \n\nIt is therefore a “disease” that we contract through association, so let us therefore watch our associations and walk away from any that have the potential of influencing us to become liars\n\n“Researchers”  have found that Lie has sisters, these are “ sister rumour-monger”, “sister gossiper” “sister, hatred” and a younger “sister jealousy”  Some have given their mother’s name as “Madam Envy”! \n\nThey described her as a ferocious woman who does not take kindly to truth, hard work and progress anywhere by anyone,  she is feared worldwide. Read it;\n\nProverbs 27\nKJV\n4+ Wrath is cruel, and anger is outrageous; but who is able to stand before envy?\n\nWho is able to stand before Mrs ( Mr) Envy? \n\nBeloved, of great worry and concern, is how some have perfected this act of lying such that they are believed by even the wise! They know what to put together, how to present and say things, etc. \n\nBut why must someone lie? The reasons are many but the most important ones are,  fear, insecurity, low self-esteem, inadequacy, and the  craving for social acceptance and glorification   (You can add yours)\n\nBeloved,  lies do not build, it rather destroy. It has been known to be the cause of breakdowns, and divisions among hitherto peaceful and loving relationships! \n\nDearly beloved if we can go by what the scriptures teach, we should not experience any such unpleasant situations; which is \n\nEphesians 4\nKJV\n25+ Wherefore putting away lying, speak every man truth with his neighbour: for we are members one of another.\n\nTo lie is to betray a trust, and trust is the foundation on which relationships are built once betrayed everything crumbles! Many a once-strong relationship has crumbled as a result Of this act. \n\nTo put back the pieces ( trust ) is a Herculean task even if done it never looks the same as the original. So let us be careful about things we say to and about one another. \n\nMay we heed Paul’s admonition \nColossians 4\nKJV\n6+ Let your speech be alway with grace, seasoned with salt, that ye may know how ye ought to answer every man.\n\nMay peace and truth be with and among us forever. Let us work towards achieving this! I desire to live in peace with you based on shared love and the truth we speak to each other. \n\nMy thoughts to share \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-17T21:34:41.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Long Forgotten",
    "text": "Ecclesiastes 9\nKJV\n5+ For the living know that they shall die: but the dead know not any thing, neither have they any more a reward; for the memory of them is forgotten.\n\nI have waited the whole day expecting to read from any tabloid what this day is noted for but to no avail. \n\nToday 17th April 1967 was the day Lt. Gen. E.K. Kotoka died as a result of the abortive coup attempt by some junior officers of the military led by Lt. S. B. Arthur. \n\nThis took place some fifty -eight years ago! As the Bible says this event, its initiators and victims are all long forgotten! \n\nBeloved, even so, shall we all be forgotten fifty-eight years from now. The majority living at that time will not remember us. \n\nLife will go on as it is today with no one remembering who we were! People’s interest and attention would be as it is today on the economy, the fuel price, the exchange rate etc, and how to put food on the table. \n\nSo, enjoy and make yourself happy while you are alive today! I am going to get myself some light -soup to drink! For we brought nothing into the world and we shall certainly carry nothing away. \n\nNobody will remember us fifty years from now. Gen. Kotoka died on 17th April 1967 exactly 58 years today life goes on as it was before! \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-18T18:05:20.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "”Each Day”",
    "text": "Each Day is Unique \nIt is a Gift;\nAppreciate, and Thank  the Giver.\n\nEach Day comes \nWith its  challenges, Walk And\nWait Patiently On the Lord! \n\nEach Day is an Offer Of God’s Grace, accept it Wholeheartedly And,  be Gracious to Others also! \n\nEach Day Is A Promise\nFulfilled, endeavour to Fulfil \nYours to Everyone you owe! \n\nEach Day is A Day of \nRefreshment and Renewal,  \nCreate time For Yourself! \n\n*Each Day, Each Day, Each Day*!\n*Treat each Day, With Care* \n*When It passes, It will Never Come Again!*! \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-18T18:05:21.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "”This Our Journey Of No Return”",
    "text": "Ecclesiastes 3\nKJV\n22+ Wherefore I perceive that there is nothing better, than that a man should rejoice in his own works; for that is his portion: for who shall bring him to see what shall be after him?\n\nAsk again! “for who shall bring him to see what shall be after him?” \n\nIt is easy to forget that this journey that we’ve embarked on here on Earth is a one-way journey. We came with only a one-way return ticket. We can not return to our homes once we leave. \n\nOur visas are one-way visas and are not renewable when they expire though under certain circumstances they can be extended but not renewed. Visa extension is discretionary and is subject to conditions set by the Issuer! \n\nWhat is of great worry and concern to all travellers here is the undisclosed nature of the visas, especially their expiry date. No one knows when, where and how his visa will expire. How long we stay is undisclosed! \n\nThough many have tried to inquire,  investigate, speculate, propound theories etc; none has come out with any credible way of knowing when his/her visa will expire. \n\nA hymn writer once said “Though men may search they can not find, for God alone does understand” Indeed the Issuer had stamped on the front page of our passport the following; \n\nDeuteronomy 29:29 \nNIV\n[29] The secret things belong to the Lord our God, but the things revealed belong to us and to our children forever, that we may follow all the words of this law.\n\nThis was intended to warn us to desist from undertaking such inquiries and investigations! \n\nThis being the case how should we then spend our days/year’s etc.? \n\nFor the answers, we are privileged to have the memoirs of one person who knew this “one-way ticket “ phenomenon and spent his stay in a certain way so we shall consult him to know how we ought to spend ours! \n\nThere is a warning however, it is not everything he said he did that is recommended so read with care, caution and discernment! Readers are warned! \n\nBefore his visa expired he gave a brief expose of how he saw his stay, a frustrating and disappointing picture. Read it;\n\nEcclesiastes 2:18-24 \nNIV\n[18] I hated all the things I had toiled for under the sun because I must leave them to the one who comes after me. \n\n[19] And who knows whether that person will be wise or foolish? Yet they will have control over all the fruit of my toil into which I have poured my effort and skill under the sun. This too is meaningless. \n\n[20] So my heart began to despair over all my toilsome labor under the sun. [21] For a person may labor with wisdom, knowledge and skill, and then they must leave all they own to another who has not toiled for it. This too is meaningless and a great misfortune.\n\n [22] What do people get for all the toil and anxious striving with which they labor under the sun? [23] All their days their work is grief and pain; even at night their minds do not rest. This too is meaningless.\n\nHope was not lost to him, read what he did and hence his advice;  \n\n[24] *A person can do nothing better than to eat and drink and find satisfaction in their own toil. This too, I see, is from the hand of God*\n\nTo conclude take note of the following; we came with a one-way return ticket. We shall not come back again. Our visas are non-renewable, even if extended they shall surely expire. As to when we are unaware. We wish we could know how many years remain on our visas!  \n\nKnowing this take his advice ; \nEcclesiastes 2:24 \nNIV\n[24] A person can do nothing better than to eat and drink and find satisfaction in their own toil. This too, I see, is from the hand of God,\n\n( Please do not “misread” or misinterpret  the word “drink” to mean go and “ chill” you are a Ghanaian I know you 🤣)\n\nBut on a more serious note be guided by his final advice \n\nEcclesiastes 11\nKJV\n9+ Rejoice, O young man, in thy youth; and let thy heart cheer thee in the days of thy youth, and walk in the ways of thine heart, and in the sight of thine eyes: but know thou, that for all these things God will bring thee into judgment\n\nEcclesiastes 12\nKJV\n13 Let us hear the conclusion of the whole matter: Fear God, and keep his commandments: for this is the whole duty of man.\n\n14+ For God shall bring every work into judgment, with every secret thing, whether it be good, or whether it be evil.\n\nA holiday reading I share with you! \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-19T09:02:18.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "”Low In The Grave He Lay: For So It Is Written”",
    "text": "Psalms 16\nKJV\n10+ For thou wilt not leave my soul in hell; neither wilt thou suffer thine Holy One to see corruption.\n\nThis was said many centuries before it found its fulfilment in Christ! Before then many have lived in anticipation of when this prophecy will come to pass. \n\nYes, “ thou will not leave my soul in Hell; neither wilt thou suffer Thine Holy One To see corruption “. \nThe final contest between the forces of Good and Evil, between Jesus and the Devil was that which began from His condemnation through his trial,  the crucifixion on the Cross, his burial and finally ended with His resurrection! \n\nYes, by His resurrection He put to shame the nay-sayers, those who out of envy condemned and crucified Him thinking they had finished Him!  \n\nYes, the same will be done to us who have pledged our loyalty to Him, our enemies, our doubters and naysayers shall humiliate and make a mockery of us! \n\nYes, beloved our enemies will bury us in disgrace, humiliation and dishonour! They will make our names a byword by soiling our image and reputation, but we shall rise to conquer in the end. \n\nJust like how He rose from the dead even so shall we also rise from the depth of humiliation, disgrace and dishonor that our foes have buried us. We shall rise to fame and glory in the name of Jesus. Impossibilities shall become possible. \n\nYes, he who laughs last laughs best! It is the doings of the Lord, disgrace and dishonor can not keep us down;  in the Name of Jesus we shall pull down the “ bars of shame “. \n\nA hymn writer put it this way “Death can not keep its prey, he tore the bars away, up from the grave he arose with a mighty triumph over his foes, he arose a Victor from the dark domain and for forever with His saints to reign! \n\nYes, Low in the grave He lay Jesus, my Savior! Waiting the coming day Jesus my Lord!\n\nUp from the grave He arose With a mighty triumph o'er His foes, He arose a Victor from the dark domain And He lives forever with His saints to reign \n\nHe arose! (He arose) He arose! (He arose) Hallelujah! Christ arose!\n\nVainly they watch His bed—\n  Jesus, my Savior!\nVainly they seal the dead—\n  Jesus my Lord!\n\nDeath cannot keep his prey—\n  Jesus, my Savior!\nHe tore the bars away—\n  Jesus my Lord!\n\nBeloved, trust in the Risen Jesus in the face of challenges, He overcame and so will you. “Enemies are not God” is an inscription I saw written on a trotro bus. Only exercise patience! Jesus overcame, and you also will overcome! \n\nLessons I learnt from the death, burial and the resurrection of Jesus. These I share with you. He who laughs last laughs the best! \n\nHave a blessed holiday \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-04-20T14:21:40.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "He Said It, And He Did It",
    "text": "Luke 24\nKJV\n7+ Saying, The Son of man must be delivered into the hands of sinful men, and be crucified, and the third day rise again.\n\nUnlike political candidates who say many things but are unable to fulfil them, all that Jesus said about himself, and what He will do or be done to Him were all fulfilled. He was an amazing Man of His Words who must be taken seriously. \n\nOne such prediction is what you’ve read;  that He will be betrayed, condemned and crucified and on the third day shall rise again. \n\nWhen He first said these many were those who doubted Him, made mockery and ridiculed  Him, but it came to pass. \n\nIn the early hours of the First Day of the week, the city of Jerusalem woke up to “ breaking news ! ”. \n\nThree women on a fact-finding mission to the cemetery where He was buried met with an empty tomb. They hurried back to town to gossip their findings to a few. They gossiped because they were afraid. \n\nBut as is normal with gossip no sooner had they whispered this to a few than it became news that went viral. \n\nReporters and stringers from the Jerusalem Chronicle, Jerusalem FM John 3:16,  Pilate FM, Matthew 27:24 and sister stations within and outside the city met with these women and interviewed them live on air. \n\nThey described vividly what they saw, the rolled stone, the empty tomb, and the man dressed in white who spoke to them. \n\nThey even repeated word for word what the white-clothed man said “Why seek ye the living among the dead? He has risen “\n\nYes, this is the Man Jesus. One newspaper headlined the morning’s publication with the words  “ He said it, and He did It!” The curious nature of the headline made the paper sold fast that by noon it has sold over several thousands. \n\nYes without a doubt , that Jesus died , was buried and on the third day rose again from the dead is an undeniable historical fact \n\nWe worship a risen Saviour. Upon the first day of the week as we assemble to break bread and drink of the cup let our voices and hearts rejoice   And may we do it from sincere , pure and honest hearts. \n\nAnd., remember he who eat and drink in an unworthy manner, ( wicked , evil , unrepentant heart) eats and drinks damnation unto himself. \n\nMaranatha \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-06-08T14:21:40.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Don’t Let The Green Grass Fool You!",
    "text": "Genesis 13\nKJV\n10+ And Lot lifted up his eyes, and beheld all the plain of Jordan, that it was well watered every where, before the Lord destroyed Sodom and Gomorrah, even as the garden of the Lord, like the land of Egypt, as thou comest unto Zoar.\n\nA few reading the heading to this article will recall it is the title of a popular song sang by the late legendary “soul icon “ Wilson Pickett; in our time we had singers whose songs meant  a lot their words were full of wisdom. \n\nWilson Pickett visited Ghana in the company of the Jackson Five ( Michael Jackson and his brothers), Staple Singers, and several other top-flight soul groups, If my memory serves me right I think Ike and Tina Turner were part to entertain Ghanaians at the Independence Square. It was a night to remember! \n\nThe program was arranged such that Wilson Pickett was to appear on stage exactly at midnight; which he did wearing a black slack with silver buttons that flashed dazzlingly. Guess what, he came on stage as the hour struck midnight with his evergreen song “ Midnight Hour!“ \n\nThe crowd yelled and surged forward  as he spoke the first words of the song “ Am gonna wait till the midnight hour”. And he did! It was a scene best seen/experienced rather than told/described. That was Ghana then! \n\nBeloved, the mistakes many have made ( and are still making) in life can be attributed to the exercise of poor judgment. Like Lot, many have allowed the “ green grass “to fool them. As the scriptures said,\n “And Lot lifted up his eyes, and beheld all the plain of Jordan, that it was well watered every where,”. Lot was undiscerning! He did what is described today as “ failure to read between the lines”. \n\nOh, how many an undiscerning youth have lifted their eyes and beheld all the fake, pretentious lives  of glamour that celebrities portray  on tv and other social media handles ,  and thought they are real. Only to be disappointed with the passage of time. \n\nYes, do not let the fake green grass fool you. In use in Ghana today is an imitated synthetic made  “green grass” used mostly to decorate event grounds.  \n\nFor a natural “green grass” to last long and not die/dry easily the soil must be well prepared, which activity takes time. It also requires regular maintenance . Beloved, for a success to last long, it would require  a deliberate, conscious effort and  preparation .  One must be willing to invest, work hard  and wait patiently. \n\nThere are many today who are in life’s scrap yard , gnashing their teeth because they were fooled by the “ green grass” ! \n\nScripture is true, read a few ; \nProverbs 13\nKJV\n11+ Wealth gotten by vanity shall be diminished: but he that gathereth by labour shall increase.\n\nProverbs 20\nKJV\n21+ An inheritance may be gotten hastily at the beginning; but the end thereof shall not be blessed.\n\nProverbs 28\nKJV\n20+ A faithful man shall abound with blessings: but he that maketh haste to be rich shall not be innocent.\n\nProverbs 28\nKJV\n22+ He that hasteth to be rich hath an evil eye, and considereth not that poverty shall come upon him.\n\nThe grass is not green everywhere, therefore be discerning ! Like , Lot don’t let the green grass fool you. \n\nJohn Franklin Tamakloe\n"
  },
  {
    "timestamp": "2025-06-08T14:21:40.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Teach Yourself How To Walk In The Truth",
    "text": "(series 5) \n3 John 1\nKJV\n3 For I rejoiced greatly, when the brethren came and testified of the truth that is in thee, even as thou *walkest in the truth*.\n4+ I have no greater joy than to hear that my children *walk in truth.*\n\nLife’s lessons are taught by following a systematically arranged curriculum or through experience. There is “ systematic truth “ and “ experiential Truth”. \n\nThe pursuit of both is recommended and desirable, but the experiential is the most preferred. An effective, useful, and successful person possesses the combination of both classroom and street ( experiential) sense! \n\nAs the psalmist requested, truth must be taught ; \nPsalms 86\nKJV\n11+ Teach me thy way, O Lord; I will walk in thy truth: unite my heart to fear thy name.\n\nIn the case of Christianity, an effective useful child of God is the one who not only knows the scriptures ( theoretical) but can apply them in the real world   It is not about “ quotation “ it is about “ application”. \n\nTwo things are highlighted in the above scripture passages, “to walk in the truth” and “to walk in truth”. The two statements are not the same. \n\nThe first presupposes that there is a body of knowledge called “ the truth “  which one must uphold and apply to be described as “ walking in the truth”\n\nTo live and do things as stated in the scriptures is to “ walk in *the* truth as scripture is the Truth \nJohn 17\nKJV\n17+ Sanctify them through thy truth: thy word is truth.\n\nThe question we  must ask ourselves daily is “Are we walking in *the truth*?”  Are we living lives that are consistent and in conformity with *the Truth*?” The Word.   \n\nThe second thought conveyed in the verses above is “ walking *in truth*” To walk In Truth is simply to be sincere, honest, to be a promise keeper, reliable, trustworthy, your word is your bond. One word sums it up “ principled”. \n\nTo walk in the teeth gladdens the heart of God and fellow man. The Apostle John could not hide his joy when he saw and experienced the life of the children of a Christian sister. \n\n2 John 1\nKJV\n4+ I rejoiced greatly that I found of thy children walking in truth, as we have received a commandment from the Father.\n\nWhen the knowledge of the Word of God influences us it makes us walk in truth. We deal sincerely and honestly with people as we live principled lives. \n\nInterestingly, it is only fellow principled people who see this and admire the principled. The unprincipled finds it difficult to understand let alone accept them! \n\nYes, darkness and light can not coexist. The vulgar, rude, uncouth etc can not coexist with the disciplined, decent-minded, orderly etc. We see these every day as we relate to people. \n\nEver wondered why some disliked, speak evil of you, why your presence in their midst disturbs them etc? It is because you Walk In Truth. You call a spade a spade and not a shovel  You are principled! \n\nRead God’s promise to the principled, those who walk in truth ; \n1 Kings 2\nKJV\n4+ That the Lord may continue his word which he spake concerning me, saying, *If thy children take heed to their way, to walk before me in truth* with all their *heart* and with all their *soul*, there shall not fail thee (said he) a man on the throne of Israel.\n\nBeloved, teach yourself how to walk not only in *the* truth but also *in* truth!\n\nJohn Franklin Tamakloe"
  },
  {
    "timestamp": "2025-04-20T14:21:40.000Z",
    "sender": "John Franklin Tamakloe",
    "title": "Great Admission, Great Confession: A Lesson  To Learn",
    "text": "1 Samuel 26\nKJV\n21+ Then said Saul, I have sinned: return, my son David: for I will no more do thee harm, because my soul was precious in thine eyes this day: behold, *I have played the fool*, and have erred exceedingly.\n\nThough Saul was known to be evil, at least here is something commendable about him that can not be ignored. \n\nAfter chasing David with the sole intention of eliminating him, a day came when he realised how foolish his efforts were! This was the day David had him in his power to destroy him, but instead, he saved him. \n\nWhen Saul woke from his sleep and heard the voice of David and heard how close he was to death; he opened his mouth and screamed these words to the hearing of those with him \n\n1 Samuel 26:21 \nNIV\n[21] Then Saul said, “I have sinned. Come back, David my son. Because you considered my life precious today, I will not try to harm you again. Surely I have acted like a fool and have been terribly wrong.”\n\nIt was a great admission and confession,  something unexpected from an avowed enemy. How many of us can do this, admitting and confessing our wrong thoughts and actions against someone we consider an enemy when it becomes clear that we were wrong? \n\nLet us admit that like Saul “ we all played the fool” before. \n\nMany have wrongly targeted some to destroy them by speaking evil, tarnishing their image and reputation; only to learn later how wrong they were   Yet they lacked the courage to admit and confess their error. \n\nJust as David forgave Saul even so we must forgive those who wrongly persecute us, but on condition that they openly admit and confess their error. \n\nThis principle of “admit and confess” to receive pardon/forgiveness is rooted in this verse; \n\n1 John 1\nKJV\n9+ If we confess our sins, he is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness.\n\nWe are reconciled to God after we have admitted and confessed our sins. Even so, we are reconciled to each other when we admit and confess our wrongs. \n\nA popular saying goes like this  “Time heals wounds”;   so it is with wrongs. Some have thought that with time wrongs done will fade, forgotten etc and relationships will be restored. \n\nIt doesn’t work that way, it is only the pains that will fade with time, but the scars remain to serve as a reminder. \n\nAs some have said “ crime has no expiry date “ even so  “unconfessed” wrong has no expiry date” it remains and serves as a barrier to true friendship and reconciliation. \n\nThe fact that a wronged person met and smiled with you does not mean the wrong done has disappeared.  Seeing you brings it back to mind. It is only when admitted and confessed that it can be forgiven. \n\nSo like Saul, let us admit and confess our wrongs to receive forgiveness and have our relationships restored. \n\nWe have all played the fool before! \n\nJohn Franklin Tamakloe"
  }
]