[
  {
    "timestamp": "2025-05-20T19:24:00.000Z",
    "sender": "John Tamakloe",
    "title": "Unity In Diversity: A Misunderstood Concept",
    "text": "1 Corinthians 10\nKJV\n15 I speak as to wise men; judge ye what I say.\n\n16+ The cup of blessing which we bless, is it not the communion of the blood of Christ? The bread which we break, is it not the communion of the body of Christ?\n\n17 For we being many are one bread, and one body: for we are all partakers of that one bread.\n\nIt was at one Sunday morning bible class that these verses came to mind when I observed the diverse views and opinions that members expressed with passion and held firmly to themselves! It was an incident that remained with me.\n\nSome were willing to accommodate the views of others saying “You’ll one day come to understand and appreciate these views that we hold”. Others said “No way “.\n\nThey concluded by saying to each other “As your faith is so be it to you “ and heartily shook hands and walked into the main auditorium\n\nAfter the Bible class, we entered into worship service to take the Lord’s supper. I watched quietly as these members who a short time ago were at each other’s “necks” sat together on the same bench and stretched forth their hands to take both the bread and the wine.\n\nWhen I sat back to reflect on this incident which always occurs in our bible classes I said to myself these men were divided over views,  opinions, interpretations etc but united as one when it came to the eating of the bread and drinking of the wine. What a beauty to watch.\n\nTheir diversities did not go beyond the Lord’s Table. When it came to breaking the Bread and drinking of the Cup they were united in one mind and one spirit.\n\nIt dawned on me as has always been the case that there are things that will divide us just as there are those that will unite us. There will always be essentials and non-essentials. The essentials unite the non-essentials divide.\n\nBlessed are those who can spot these and know what to do under each circumstance. You’ve heard this before “ concerning matters of faith unity, in matters of opinion, liberty; in all things charity (love) “.\n\nI loved what I experienced that Sunday and recommend that we see disagreements from these perspectives. There are essentials just as there are non-essentials, there are weightier matters just as there are non-weightier matters.\n\nI pledge never to expend my energy on non-essential matters instead let each hold and have his views and opinions. As was said after the Bible class “As your faith is so be it to you”  I’ll only come in if it is a “ matter of faith “. Otherwise, I'll remain silent.\n\nThe apostle Paul said it nicely, read it\n2 Timothy 2:23-24\nNIV\n[23] Don't have anything to do with foolish and stupid arguments, because you know they produce quarrels.\n\n[24] And the Lord's servant must not be quarrelsome but must be kind to everyone, able to teach, not resentful.\n\nMy take\n\nJohn Franklin Tamakloe"
  },
  {
    "timestamp": "2025-05-21T09:42:00.000Z",
    "sender": "John Tamakloe",
    "title": "The Pilgrim’s Sacred Duty",
    "text": "Psalms 119\nKJV\n54+ Thy statutes have been my songs in the house of my pilgrimage.\n\nAs a pilgrim, the psalmist made the statutes of the Lord his daily theme lest he forgets that he is on a pilgrimage! The same applies to those who read and meditate daily on the Word.\n\nTo remind ourselves that we are pilgrims traveling through the land may we not let His Word die out from our lips.\n\nRead and meditate on it every day. The psalmist composed them into songs which he sings daily!\nMay we also do likewise! Sing at least a song each day.!\n\nToday I sang and meditated on the words of this hymn ;\n\nO God, our help in ages past,\nOur hope for years to come,\nOur shelter from the stormy blast,\nAnd our eternal home.\n\nUnder the shadow of Thy throne\nThy saints have dwelt secure;\nSufficient is Thine arm alone,\nAnd our defence is sure.\n\nBefore the hills in order stood,\nOr Earth received her frame,\nFrom everlasting Thou art God,\nTo endless years the same.\n\nA thousand ages in Thy sight\nAre like an evening gone;\nShort as the watch that ends the night\nBefore the rising sun.\n\nTime, like an ever-rolling stream,\nBears all its sons away;\nThey fly forgotten, as a dream\nDies at the opening day.\n\nO God, our help in ages past,\nOur hope for years to come,\nBe Thou our guard while life shall last,\nAnd our eternal home.\n\nThis is a pilgrim’s sacred duty to remind himself of the fleeting nature of time. Have you sung a song this morning?\n\nJohn Franklin Tamakloe."
  },
  {
    "timestamp": "2025-05-23T10:50:00.000Z",
    "sender": "John Tamakloe",
    "title": "The Question Of Alliances",
    "text": "Proverbs 28\nKJV\n4+ They that forsake the law praise the wicked: but such as keep the law contend with them.\n\nAn incident took place in which I was involved and the outcome and reactions of those present brought home to me this truth expressed by the writer of the proverb\n\nProverbs 28:4\nNIV\n[4] Those who forsake instruction praise the wicked, but those who heed it resist them.\n\nThe issue of alliances has always plagued our society, whether spiritual or secular. We are either for or against someone or something.\n\nThere are only two alliances in life either a righteous or an evil partnership there is no middle ground;  even to be indifferent is an alliance.\n\nAs the writer said those who forsake the law praise the wicked ( law breakers ) but those who uphold it ( principled ) resist or contend against them.\n\nIn my dealing with people and issues I have observed over the years that those who do wrong have more support ( fans) than those who do right as  a result they end up having more enemies than wrongdoers\n\nYou see this on the road, someone stops in the middle of the road for no proper cause or reason, and you slow down to correct him; some blow their horns, while others shout at you to leave him!\n\nOr you see something that is being done or said etc; which is contrary to the law or the truth; you attempt to correct or draw attention to what the law says! Most present take sides with the lawless!\n\nA pickpocket was arrested and instead of those present to help take him to the police station they rather asked that you leave him once you’ve gotten your purse. Only for him to pick up another’s purse a few hours later.\n\nYou know and have experienced similar situations! Wrongdoers win the support of many, this explains why our society is plagued with evil despite the existence of many religious faiths.\n\nOur society, congregations,  workplaces, etc are what they are as a result of the alliances we form! They reflect the type of alliances that exist.\n\nAn upright, strong, progressive and prosperous society, congregation, workplace etc is one where righteous alliances outweigh the unrighteous!\n\nIs this not what the proverbs writer meant when he wrote ;\nProverbs 14\nKJV\n34 Righteousness exalteth a nation: but sin is a reproach to any people.\n\nIf those who uphold the principles of truth are more than those who support lies and liars our society, church, workplace etc will be loving, kind, peaceful and prosperous.\n\nSo be careful what alliances you form, with whom; where your loyalty lies etc. The choice is yours and remember so are the consequences! What a man sows that also he reaps!\n\nProverbs 1:10-11,13-15\nNIV\n[10] My son, if sinful men entice you, do not give in to them. [11] If they say, “Come along with us; let's lie in wait for innocent blood, let's ambush some harmless soul;\n\n[13] we will get all sorts of valuable things and fill our houses with plunder; [14] cast lots with us; we will all share the loot ”--- [15] my son, do not go along with them, do not set foot on their paths;\n\nA word to the wise\n\nJohn Franklin Tamakloe"
  }
]